000000*       QAS260              LEVEL=7        DATE=11.09.01
000100****************************************************************
000200*    会員ステータスファイル             ID:QAS260              *
000300*          RL：0750BYTE                 DATA-WRITTEN  03.02.16 *
000300*          RL：0688BYTE                 DATA-WRITTEN  11.09.01 *
000400*--------------------------------------------------------------*
000500*            修  正  履  歴                                    *
000600*    管理NO            修正理由              担当者  修正日付  *
000700*   1006060   顧客分析ｻｰﾊﾞIF変更対応   FIP.Eriguchi  11/09/01  *
000800****************************************************************
000900     03  QAS260-G0010.                           *>入力エリア
001000       05  QAS260-T0010.                         *>キー
001100         07  QAS260-A0010    PIC  9(004).        *>企業コード
001200         07  QAS260-A0020    PIC  9(004).        *>サブレンジ
001300         07  QAS260-A0030    PIC  9(008).        *>内部会員番号
001400       05  QAS260-A0040      PIC  9(002).        *>ＰＯＳステータス
001500       05  QAS260-A0050      PIC  9(004).        *>代表ステータス
001600       05  QAS260-T0060.
001700         07  QAS260-P0060      OCCURS  20.       *>口座情報
001800           09  QAS260-A0060    PIC S9(007) COMP-3. *>登録日
001900           09  QAS260-A0070    PIC  9(002).        *>ステータス
002000       05  QAS260-T0080.
002100         07  QAS260-P0080    OCCURS  09.         *>カード情報
002200           09  QAS260-S0080    OCCURS  10.         *>（利用者別）
002300             11  QAS260-A0080  PIC S9(007) COMP-3. *>登録日
002400             11  QAS260-A0090  PIC  9(002).        *>ステータス
002500       05  QAS260-T0100.                         *>カード区分情報
002600         07  QAS260-A0100  PIC  X(006).          *>カード区分
002650* DEL  2011/09/01 1006060 FIP Eriguchi START
002700*         07  QAS260-A0110  PIC  X(001).          *>ＩＣ・ＭＳ区分
002800*     03  QAS260-G0120.                           *>リボ振替会員情報
002900*       05  QAS260-A0120      PIC  X(001).        *>リボ振替会員区分
003000*     03  QAS260-G0130.                           *>ポイント情報
003100*       05  QAS260-A0130      PIC S9(011) COMP-3. *>前月繰越ポイント
003200*       05  QAS260-A0140      PIC S9(011) COMP-3. *>当月発生ポイント
003300*       05  QAS260-A0150      PIC S9(011) COMP-3. *>当月引換ポイント
003400*       05  QAS260-A0160      PIC S9(011) COMP-3. *>当月引換取消ポイント
003500*       05  QAS260-A0170      PIC S9(011) COMP-3. *>当月残ポイント
003600*     03  QAS260-FILLER       PIC  X(030).        *>余白
003700* DEL  2011/09/01 1006060 FIP Eriguchi END
