000000*       QAS300              LEVEL=2        DATE=03.05.30
000100******************************************************************
000200*@@@@@@”N‰ï”ïE•ÔMƒŒƒR[ƒh                                *
000300*----------------------------------------------------------------*
000400*@áŠQNO@C³—š—ði“à—ej@@@@@@@@@@’S“–ŽÒ@C³“ú•t@*
000500*----------------------------------------------------------------*
000600*QXXXXXXX-XXX  ‚w‚w‚w‚w‚w‚w‚w‚w‚w‚w‚w‚w‚w‚w‚w‚w‚w‚w‚w  XX/XX/XX  *
000700******************************************************************
000800     03  QAS300-SEG.                               *>•ÔMƒŒƒR[ƒh
000900       05  QAS300-G0010.                           *>ƒL[•”
001000         07  QAS300-A0010      PIC  9(04).         *>Šé‹ÆƒR[ƒh
001100         07  QAS300-A0020      PIC  9(04).         *>ƒTƒuƒŒƒ“ƒWƒL[
001200         07  QAS300-A0030      PIC  9(08).         *>“à•”‰ïˆõ”Ô†
001300         07  QAS300-A0040      PIC  9(08).         *>“o˜^“ú
001400         07  QAS300-A0050      PIC  9(06).         *>“o˜^Žž
001500       05  QAS300-G0060.                           *>–ß‚è“o˜^î•ñ
001600         07  QAS300-A0060      PIC  X(02).         *>–ß‚è——R
001700         07  QAS300-A0070      PIC  X(01).         *>’m•s”õƒtƒ‰ƒO
001800         07  QAS300-A0080      PIC  X(01).         *>“¯ˆÓƒtƒ‰ƒO
001900         07  QAS300-A0090      PIC  X(01).         *>•ÔMŽí•Ê
002000         07  QAS300-A0100      PIC  X(17).         *>®—”Ô†
002100         07  QAS300-A0110      PIC  X(08).         *>ƒIƒyƒŒ[ƒ^‚h‚c
002200       05  QAS300-G0120.                           *>ƒzƒXƒg‘—Mî•ñ
002300         07  QAS300-A0120      PIC  X(08).         *>ì¬“ú•t
002400         07  QAS300-A0130      PIC  X(06).         *>ì¬Žž
002500       05  FILLER          PIC  X(26).         *>—\”õ
