      *8...........2.........3.........4.........5........6........7.........8  
      *    QAS810
      ****************************************************************
      *                ƒT[ƒoŒü‚¯ˆµŽÒƒ}ƒXƒ^                          *
      *                             DATA-WRITTEN  99.01.13           *
      *--------------------------------------------------------------*
      *                  C  ³  —š  —ð                              *
      *   ŠÇ—NO            C³——R             ’S“–ŽÒ   C³“ú•t   * 
      ****************************************************************    
           03          ()-SEG.                          *>ˆµŽÒƒ}ƒXƒ^
             05        ()-G0010.                        *>
               07      ()-A0010      PIC  X(04).        *>‚b^‚b
             05        ()-G0020.                        *>‚j‚d‚x
               07      ()-T0020.                        *>Š‘®“X
                 09    ()-A0020      PIC  X(01).        *>—\”õ
                 09    ()-A0030      PIC  X(02).        *>“X
               07      ()-A0040      PIC  X(06).        *>—\”õ
               07      ()-T0050.                        *>ˆµ‚¢ƒR[ƒh
                 09    ()-A0050      PIC  X(02).        *>•”
                 09    ()-A0060      PIC  X(02).        *>‰Û
                 09    ()-A0070      PIC  X(02).        *>ŒW
             05        ()-G0080.                        *>ƒ}ƒXƒ^[”NEŠú
               07      ()-A0080      PIC  X(04).        *>”N
               07      ()-A0090      PIC  X(01).        *>Šú
             05        ()-G0100.                        *>“o˜^”NŒŽ“ú
               07      ()-A0100      PIC  X(04).        *>”N
               07      ()-A0110      PIC  X(02).        *>ŒŽ
               07      ()-A0120      PIC  X(02).        *>“ú
             05        ()-G0130.                        *>XV”NŒŽ“ú
               07      ()-A0130      PIC  X(04).        *>”N
               07      ()-A0140      PIC  X(02).        *>ŒŽ
               07      ()-A0150      PIC  X(02).        *>“ú
             05        ()-G0160.                        *>‹Î–±“X
               07      ()-A0160      PIC  X(01).        *>—\”õ
               07      ()-A0170      PIC  X(02).        *>“X
             05        ()-A0180      PIC  X(02).        *>ˆµ•”–å
             05        ()-A0190      PIC  X(02).        *>ƒuƒƒbƒN
             05        ()-A0200      PIC  X(01).        *>Œš‘•“Œ¼‹æ•ª
             05        ()-A0210      PIC  X(02).        *>—\”õ
             05        ()-A0220      PIC  N(06).        *>’S“–ŽÒ–¼Š¿Žš
             05        ()-A0230      PIC  X(12).        *>’S“–ŽÒ–¼ƒJƒi
             05        ()-G0240.                        *>íœ”NŒŽ“ú
               07      ()-A0240      PIC  X(04).        *>”N
               07      ()-A0250      PIC  X(02).        *>ŒŽ
               07      ()-A0260      PIC  X(02).        *>“ú
             05        ()-A0270      PIC  N(12).        *>ˆµ•”–¼
             05        ()-A0280      PIC  N(12).        *>ˆµ•”‰Û–¼
             05        ()-A0290      PIC  X(20).        *>—\”õ             
