      *8...........2.........3.........4.........5........6........7.........8
      *    QBF007
      ****************************************************************
      *                イメージ管理  カード更新データ                *
      *                             DATA-WRITTEN  2005.03.10         *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO            修正理由             担当者   修正日付   *
      ****************************************************************
      *  インデックスファイル
      *  index.txt
          03    ()-G0010.
            05  ()-A0010          PIC X(100).
      *     05  ()-A0040          PIC X(16).        *> 会員番号
      *     05  ()-A0030          PIC X(03).        *> 種別
      *     05  ()-A0020          PIC X(20).        *> バーコード値
      *     05  ()-A0010          PIC X(20).        *>ファイル名
      *     05  ()-A0050          PIC X(01).        *> 改行
