      *8...........2.........3.........4.........5........6........7.........8
      *    QBF002
      ****************************************************************
      *                イメージ管理  カード再発行データ              *
      *                             DATA-WRITTEN  2005.03.10         *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO            修正理由             担当者   修正日付   *
      ****************************************************************
      * カード発行ＮＧデータ
      *  O.F.QA02
          03	()-G0010.
            05    ()-A0010      PIC X(40).
      *     05    ()-A0010      PIC X(08).               *> 受付番号(申込番号)
      *     05    ()-A0015      PIC X(08).               *> ブラック番号
      *     05    ()-A0020      PIC X(08).               *> 決裁ＮＧ日
      *     05    ()-A0030      PIC X(01).               *> 東西フラグ
      *     05    ()-A0040      PIC X(01).               *> 改行
