      *8...........2.........3.........4.........5........6........7.........8
      *    QBF001
      ****************************************************************
      *                イメージ管理  カード発行ＯＫデータ            *
      *                             DATA-WRITTEN  2005.03.10         *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO            修正理由             担当者   修正日付   *
      ****************************************************************
      * カード発行ＯＫデータ
      * O.F.QA01
          03      ()-G0010.
            05    ()-A0010      PIC X(60).
      *     05    ()-A0010      PIC X(08).               *> 受付番号(申込番号)
      *     05    ()-A0020      PIC X(16).               *> 会員番号
      *     05    ()-A0030      PIC X(16).               *> 内部会員番号
      *     05    ()-A0040      PIC X(08).               *> 入会日（決裁応諾日）
      *     05    ()-A0050      PIC X(01).               *> 東西フラグ
      *     05    ()-A0060      PIC X(01).               *> 改行
