      *****************************************************************
      * Ç`ÇdÇrè∆âÔèÓïÒÇs (QBS056)    ÉåÉRÅ[Éhí∑ÅFÇQÇUÇPÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS056-AESINQT.
              05  QBS056-SEQNO                    PIC  X(019).
              05  QBS056-UKETSUKENO               PIC  X(008).
              05  QBS056-KANKEIKBN                PIC  X(001).
              05  QBS056-KAZOKURBN                PIC  X(001).
              05  QBS056-ICCHITYPE                PIC  X(002).
              05  QBS056-KNSEI                    PIC  X(030).
              05  QBS056-KNMEI                    PIC  X(030).
              05  QBS056-BIRTHDAY                 PIC  X(007).
              05  QBS056-YUBINNO                  PIC  X(008).
              05  QBS056-CHIBAN                   PIC  X(003).
              05  QBS056-TEL1                     PIC  X(017).
              05  QBS056-TEL2                     PIC  X(017).
              05  QBS056-KAIINNO                  PIC  X(009).
              05  QBS056-INQDATE                  PIC  X(007).
              05  QBS056-HONHOSHOKBN              PIC  X(001).
              05  QBS056-KEIYAKUKBN               PIC  X(002).
              05  QBS056-SHOHINCD                 PIC  X(003).
              05  QBS056-YUSHIGAKU                PIC  X(006).
              05  QBS056-SHIHARAICNT              PIC  X(003).
              05  QBS056-INQGYOSHU                PIC  X(002).
              05  QBS056-STRDATE                  PIC  X(019).
              05  QBS056-UPDDATE                  PIC  X(019).
              05  QBS056-DELDATE                  PIC  X(019).
              05  QBS056-OPID                     PIC  X(008).
              05  QBS056-WSID                     PIC  X(020).
