      *****************************************************************
      * 信用電話番号識別
      *****************************************************************
              03  QBS014-DATA.
                  05  QBS014-KUBUN                          PIC  X(02).
                  05  QBS014-NAME                           PIC  X(30).
                  05  QBS014-SYMD                           PIC  9(07).
                  05  QBS014-YUBIN                          PIC  X(05).
                  05  QBS014-CHIBAN                         PIC  X(03).
                  05  QBS014-TEL                            PIC  X(14).
                  05  QBS014-KRKYM                          PIC  X(04).
                  05  QBS014-JYOKBN                         PIC  X(01).
                  05  QBS014-NAME2                          PIC  X(30).
      *           05  FILLER                                PIC  X(30).
