      *****************************************************************
      * ç›ämÉÅÉÇÇs (QBS059)    ÉåÉRÅ[Éhí∑ÅFÇUÇUÇXÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS059-ZAIKAKUMEMOT.
              05  QBS059-UKETSUKENO               PIC  X(008).
              05  QBS059-MAKEDATE                 PIC  X(019).
              05  QBS059-MEMOCD                   PIC  X(008).
              05  QBS059-KAKUNINSAKI              PIC  X(001).
              05  QBS059-KAKAITEKBN               PIC  X(001).
              05  QBS059-KAKKEKKAKBN              PIC  X(001).
              05  QBS059-KAKDATE                  PIC  X(019).
              05  QBS059-KDNTEL1                  PIC  X(007).
              05  QBS059-KDNTEL2                  PIC  X(004).
              05  QBS059-KDNTEL3                  PIC  X(004).
              05  QBS059-MEMO                     PIC  X(512).
              05  QBS059-STRDATE                  PIC  X(019).
              05  QBS059-UPDDATE                  PIC  X(019).
              05  QBS059-DELDATE                  PIC  X(019).
              05  QBS059-OPID                     PIC  X(008).
              05  QBS059-WSID                     PIC  X(020).
