      *****************************************************************
      * óﬁéóéÅñºÇs (QBS050)    ÉåÉRÅ[Éhí∑ÅFÇPÇTÇSÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS050-SNRUIJINAMET.
              05  QBS050-TABANO                   PIC  X(006).
              05  QBS050-UKETSUKENO               PIC  X(008).
              05  QBS050-INQKBN                   PIC  X(001).
              05  QBS050-KAZOKURENBAN             PIC  X(001).
              05  QBS050-SAIIRAIKBN               PIC  X(001).
              05  QBS050-SAIIRAICNT               PIC  X(003).
              05  QBS050-CICINQREQ                PIC  X(001).
              05  QBS050-CICINQRESULT             PIC  X(001).
              05  QBS050-JISHAINQREQ              PIC  X(001).
              05  QBS050-JISHAINQRESULT           PIC  X(001).
              05  QBS050-BLACKINQREQ              PIC  X(001).
              05  QBS050-BLACKINQRESULT           PIC  X(001).
              05  QBS050-NGRIYU                   PIC  X(004).
              05  QBS050-RECORDKBN                PIC  X(001).
              05  QBS050-RECORDSKB1               PIC  X(001).
              05  QBS050-RENBAN1                  PIC  X(002).
              05  QBS050-RECORDSKB2               PIC  X(001).
              05  QBS050-RENBAN2                  PIC  X(002).
              05  QBS050-TYPE                     PIC  X(002).
              05  QBS050-RUINAME                  PIC  X(030).
              05  QBS050-STRDATE                  PIC  X(019).
              05  QBS050-UPDDATE                  PIC  X(019).
              05  QBS050-DELDATE                  PIC  X(019).
              05  QBS050-OPID                     PIC  X(008).
              05  QBS050-WSID                     PIC  X(020).
