      *****************************************************************
      * êMópèÓïÒ
      *****************************************************************
                03  QBS009-DATA.
                    05  QBS009-TYPE                           PIC X(02).
                    05  QBS009-NAME                           PIC X(30).
                    05  QBS009-SYMD                           PIC 9(07).
                    05  QBS009-YUBIN                          PIC 9(05).
                    05  QBS009-CHIBAN                         PIC X(03).
                    05  QBS009-ADD                            PIC X(60).
                    05  QBS009-TEL                            PIC X(14).
                    05  QBS009-TELKBN                         PIC X(01).
                    05  QBS009-SEX                            PIC X(01).
                    05  QBS009-HOJIN                          PIC X(01).
                    05  QBS009-JYUKYO                         PIC X(01).
                    05  QBS009-HAIGU                          PIC X(01).
                    05  FILLER                                PIC X(30).
