      *****************************************************************
      * êMópóﬁéóéÅñº
      *****************************************************************
              03  QBS015-DATA.
                  05  QBS015-TYPE                           PIC  X(02).
                  05  QBS015-RUINAME                        PIC  X(30).
