      *****************************************************************
      * àœëıêÊì¸âÔéÛïtÉfÅ[É^ (QBS072) ÉåÉRÅ[Éhí∑ÅFÇQÇOÇOÇaÇxÇsÇd
      *****************************************************************
           03  QBS072-SEG.
               05  QBS072-RECKBN             PIC  X(001).
               05  QBS072-UKETSUKENO         PIC  X(008).
               05  QBS072-HONKNNAME          PIC  X(020).
               05  QBS072-HONKJNAME          PIC  N(020).
               05  QBS072-HONBIRTHDAY        PIC  X(008).
               05  QBS072-HONSEX             PIC  X(001).
               05  QBS072-CARDKBN2           PIC  X(006).
               05  QBS072-MOUSHIKOMIDAY      PIC  X(008).
               05  QBS072-HONTEL             PIC  X(012).
               05  QBS072-TEIKEI-ARA.
      *****************************************************************
      *             07  QBS072-HONCASHKIBOKG  PIC  X(003).
      *             07  QBS072-SKIKACD        PIC  X(006).
      *             07  QBS072-EIGYOTEN       PIC  X(002).
      *             07  QBS072-KAKUTOKUTEN    PIC  X(002).
      *             07  QBS072-SKIKOJINCD     PIC  X(007).
      *             07  QBS072-SKIBUHANCD     PIC  X(004).
                   07  QBS072-HONCASHKIBOKG  PIC  X(003).
      *             07  QBS072-SKIKOJINCD1    PIC  X(006).
                   07  QBS072-TENBUKACD1     PIC  X(003).
                   07  QBS072-TENBUKACD2     PIC  X(003).
                   07  QBS072-EIGYOTEN       PIC  X(002).
                   07  QBS072-KAKUTOKUTEN    PIC  X(002).
      *             07  QBS072-SKIKOJINCD2    PIC  X(003).
                   07  QBS072-TENBUKACD3     PIC  X(003).
                   07  QBS072-SKIBUHANCD     PIC  X(008).
      *****************************************************************
                   07  FILLER                PIC  X(006).
               05  FILLER                    PIC  X(066).
