      *****************************************************************
      * Ç`ÇdÇrå¬ï Çs (QBS055)    ÉåÉRÅ[Éhí∑ÅFÇQÇVÇUÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS055-AESKOBETSUT.
              05  QBS055-SEQNO                    PIC  X(019).
              05  QBS055-UKETSUKENO               PIC  X(008).
              05  QBS055-KANKEIKBN                PIC  X(001).
              05  QBS055-KAZOKURBN                PIC  X(001).
              05  QBS055-ICCHITYPE                PIC  X(002).
              05  QBS055-KAIINGYOSHUKBN           PIC  X(002).
              05  QBS055-KAIINCD                  PIC  X(009).
              05  QBS055-JOUHODATE                PIC  X(007).
              05  QBS055-JOUHOSBT                 PIC  X(002).
              05  QBS055-KEIKACMT                 PIC  X(002).
              05  QBS055-KEIKACMTDATE             PIC  X(007).
              05  QBS055-SHURYOCMT                PIC  X(002).
              05  QBS055-KEIYAKUDATE              PIC  X(007).
              05  QBS055-KEIYAKUKBN               PIC  X(002).
              05  QBS055-TANPOUMU                 PIC  X(001).
              05  QBS055-SHOHINNAME               PIC  X(007).
              05  QBS055-HOUKOKUDATE              PIC  X(008).
              05  QBS055-HOSHODATE                PIC  X(008).
              05  QBS055-SHIHARAICNT              PIC  X(003).
              05  QBS055-YUUSIGAKU                PIC  X(006).
              05  QBS055-KYOKUDOGAKU              PIC  X(006).
              05  QBS055-CASHKYOKUDOGAKU          PIC  X(006).
              05  QBS055-ZAISAI                   PIC  X(006).
              05  QBS055-CASHZANSAI               PIC  X(006).
              05  QBS055-SEIKYUGAKU               PIC  X(006).
              05  QBS055-NYUKINGAKU               PIC  X(006).
              05  QBS055-NYUKINRUIKEI             PIC  X(006).
              05  QBS055-NYUKINRIREKI             PIC  X(024).
              05  QBS055-KYOJUNENSUKBN            PIC  X(001).
              05  QBS055-SHOKUGYOKBN              PIC  X(001).
              05  QBS055-KINTEL                   PIC  X(017).
              05  QBS055-KINZOKUNENSU             PIC  X(002).
              05  QBS055-STRDATE                  PIC  X(019).
              05  QBS055-UPDDATE                  PIC  X(019).
              05  QBS055-DELDATE                  PIC  X(019).
              05  QBS055-OPID                     PIC  X(008).
              05  QBS055-WSID                     PIC  X(020).
