      *****************************************************************
      * ÇbÇqå¬ï óvåè
      *****************************************************************
              03  QBS006-DATA.
                  05  QBS006-KEIYAKUNAIYO.
                      07  QBS006-GYOSYU                     PIC  X(02).
                      07  QBS006-KAIIN                      PIC  X(04).
                      07  QBS006-KEINO                      PIC  X(20).
                      07  QBS006-KEIYMD                     PIC  9(07).
                      07  QBS006-KEIKBN                     PIC  X(02).
                      07  QBS006-TANPO                      PIC  X(01).
                      07  QBS006-SYOHIN                     PIC  X(07).
                      07  QBS006-HARAI                      PIC  9(03).
                      07  QBS006-KEISYMD                    PIC  9(07).
                      07  QBS006-KEIGAKU                    PIC  9(06).
                      07  QBS006-KYOKGK                     PIC  9(06).
                      07  QBS006-CKYOKGK                    PIC  9(06).
                      07  QBS006-HOUYMD                     PIC  9(07).
                      07  QBS006-ZANSAI                     PIC  9(06).
                      07  QBS006-CZANSAI                    PIC  9(06).
                      07  QBS006-SEIGAKU                    PIC  9(06).
                      07  QBS006-NYUGAKU                    PIC  9(06).
                      07  QBS006-NYURIGK                    PIC  9(06).
                      07  QBS006-NYUREKI                    PIC  X(24).
                      07  QBS006-KEICMNT                    PIC  X(02).
                      07  QBS006-KEICYMD                    PIC  9(07).
                      07  QBS006-ENDCMNT                    PIC  X(02).
                      07  QBS006-KINGAKU                    PIC  9(06).
                      07  QBS006-HRIKGK                     PIC  9(06).
                      07  QBS006-HRIKYMD                    PIC  9(07).
                      07  QBS006-KAIYMD                     PIC  9(07).
                      07  QBS006-HOKBN                      PIC  X(01).
                      07  QBS006-KANAHNA                    PIC  X(30).
                      07  QBS006-KANJHNA                    PIC  X(20).
                  05  QBS006-ATTRITEM.
                      07  QBS006-JYUKYO                     PIC  X(01).
                      07  QBS006-JYUNEN                     PIC  X(01).
                      07  QBS006-SYOKU                      PIC  X(01).
                      07  QBS006-KNMNAME                    PIC  X(30).
                      07  QBS006-KNMTEL                     PIC  X(14).
                      07  QBS006-KMTLKBN                    PIC  X(01).
                      07  QBS006-KNMNEN                     PIC  9(02).
                      07  QBS006-NENSYU                     PIC  X(01).
                      07  QBS006-SYOTOKU1                   PIC  X(01).
                      07  QBS006-SYOTOKU2                   PIC  X(01).
                      07  QBS006-SYOTOKU3                   PIC  X(01).
                      07  QBS006-ZOKCMNT                    PIC  X(02).
                  05  QBS006-FUKAITEM.
                      07  QBS006-KNRCMNT                    PIC X(1).
                      07  QBS006-CMNT                       PIC X(1).
                      07  QBS006-ZHFLG1                     PIC X(1).
                      07  QBS006-ZHFLG2                     PIC X(1).
                      07  QBS006-ZHFLG3                     PIC X(1).
                      07  QBS006-ZHFLG4                     PIC X(1).
                      07  QBS006-ZHFLG5                     PIC X(1).
                      07  QBS006-ZHFLG6                     PIC X(1).
                      07  QBS006-ZHFLG7                     PIC X(1).
                      07  QBS006-ZHFLG8                     PIC X(1).
                      07  QBS006-ZHFLG9                     PIC X(1).
                      07  QBS006-ZHFLG10                    PIC X(1).
                      07  QBS006-ZHFLG11                    PIC X(1).
                      07  QBS006-ZHFLG12                    PIC X(1).
                      07  QBS006-ZHFLG13                    PIC X(1).
                      07  QBS006-ZHFLG14                    PIC X(1).
                      07  QBS006-CMNTUMU                    PIC X(1).
                      07  FILLER                            PIC X(20).
                      07  QBS006-FUKCMNT                    PIC X(100).
                  05  QBS006-ZOKUSEI2.
                      07  QBS006-KNMNAME2                   PIC X(30).
                      07  QBS006-KNMTEL2                    PIC X(14).
