      *****************************************************************
      * êRç∏åãâ Çs (QBS035)    ÉåÉRÅ[Éhí∑ÅFÇQÇXÇVÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS035-SHINSAKEKKAT.
              05  QBS035-UKETSUKENO               PIC  X(008).
              05  QBS035-KANKEIKBN                PIC  X(001).
              05  QBS035-KAZOKURBN                PIC  X(001).
              05  QBS035-JDSJ001                  PIC  X(001).
              05  QBS035-JDSJ002                  PIC  X(001).
              05  QBS035-JDSJ003                  PIC  X(001).
              05  QBS035-JDSJ004                  PIC  X(001).
              05  QBS035-JDSJ005                  PIC  X(001).
              05  QBS035-JDSJ006                  PIC  X(001).
              05  QBS035-JDSJ007                  PIC  X(001).
              05  QBS035-JDSJ008                  PIC  X(001).
              05  QBS035-JDSJ009                  PIC  X(001).
              05  QBS035-JDSJ010                  PIC  X(001).
              05  QBS035-JDSJ011                  PIC  X(001).
              05  QBS035-JDSJ012                  PIC  X(001).
              05  QBS035-JDSJ013                  PIC  X(001).
              05  QBS035-JDSJ014                  PIC  X(001).
              05  QBS035-JDSJ015                  PIC  X(001).
              05  QBS035-JDSJ016                  PIC  X(001).
              05  QBS035-JDSJ017                  PIC  X(001).
              05  QBS035-JDSJ018                  PIC  X(001).
              05  QBS035-JDSJ019                  PIC  X(001).
              05  QBS035-JDSJ020                  PIC  X(001).
              05  QBS035-JDSJ021                  PIC  X(001).
              05  QBS035-JDSJ022                  PIC  X(001).
              05  QBS035-JDSJ023                  PIC  X(001).
              05  QBS035-JDSJ024                  PIC  X(001).
              05  QBS035-JDSJ025                  PIC  X(001).
              05  QBS035-JDSJ026                  PIC  X(001).
              05  QBS035-JDSJ027                  PIC  X(001).
              05  QBS035-JDSJ028                  PIC  X(001).
              05  QBS035-JDSJ029                  PIC  X(001).
              05  QBS035-JDSJ030                  PIC  X(001).
              05  QBS035-JDSC001                  PIC  X(001).
              05  QBS035-JDSC002                  PIC  X(001).
              05  QBS035-JDSC003                  PIC  X(001).
              05  QBS035-JDSC004                  PIC  X(001).
              05  QBS035-JDSC005                  PIC  X(001).
              05  QBS035-JDSC006                  PIC  X(001).
              05  QBS035-JDSC007                  PIC  X(001).
              05  QBS035-JDSC008                  PIC  X(001).
              05  QBS035-JDSC009                  PIC  X(001).
              05  QBS035-JDSC010                  PIC  X(001).
              05  QBS035-JDSC011                  PIC  X(001).
              05  QBS035-JDSC012                  PIC  X(001).
              05  QBS035-JDSC013                  PIC  X(001).
              05  QBS035-JDSC014                  PIC  X(001).
              05  QBS035-JDSC015                  PIC  X(001).
              05  QBS035-JDSC016                  PIC  X(001).
              05  QBS035-JDSC017                  PIC  X(001).
              05  QBS035-JDSC018                  PIC  X(001).
              05  QBS035-JDSC019                  PIC  X(001).
              05  QBS035-JDSC020                  PIC  X(001).
              05  QBS035-JDSC021                  PIC  X(001).
              05  QBS035-JDSC022                  PIC  X(001).
              05  QBS035-JDSC023                  PIC  X(001).
              05  QBS035-JDSC024                  PIC  X(001).
              05  QBS035-JDSC025                  PIC  X(001).
              05  QBS035-JDSC026                  PIC  X(001).
              05  QBS035-JDSC027                  PIC  X(001).
              05  QBS035-JDSC028                  PIC  X(001).
              05  QBS035-JDSC029                  PIC  X(001).
              05  QBS035-JDSC030                  PIC  X(001).
              05  QBS035-JDSYOSINRANK             PIC  X(001).
              05  QBS035-JDSCASHLIMIT             PIC  X(011).
              05  QBS035-JDSKEKKA                 PIC  X(002).
              05  QBS035-JDSDATE                  PIC  X(019).
              05  QBS035-AESNYSKAIINNO            PIC  X(016).
              05  QBS035-AESKESSAITANTO           PIC  X(008).
              05  QBS035-AESKEKKA                 PIC  X(001).
              05  QBS035-AESRESULTCD              PIC  X(002).
              05  QBS035-AESRESULTMEMO            PIC  X(040).
              05  QBS035-AESYOSINRANK             PIC  X(001).
              05  QBS035-AESCASHLIMIT             PIC  X(011).
              05  QBS035-AESCENTERKBN             PIC  X(001).
              05  QBS035-CICACTPLAN1              PIC  X(002).
              05  QBS035-CICACTPLAN2              PIC  X(002).
              05  QBS035-CICACTPLAN3              PIC  X(002).
              05  QBS035-KJUACTPLAN1              PIC  X(002).
              05  QBS035-KJUACTPLAN2              PIC  X(002).
              05  QBS035-KJUACTPLAN3              PIC  X(002).
              05  QBS035-KINACTPLAN1              PIC  X(002).
              05  QBS035-KINACTPLAN2              PIC  X(002).
              05  QBS035-KINACTPLAN3              PIC  X(002).
              05  QBS035-STRDATE                  PIC  X(019).
              05  QBS035-UPDDATE                  PIC  X(019).
              05  QBS035-DELDATE                  PIC  X(019).
              05  QBS035-OPID                     PIC  X(008).
              05  QBS035-WSID                     PIC  X(020).
