      *****************************************************************
      * ê\çûèëé©êUèÓïÒÇs (QBS032)    ÉåÉRÅ[Éhí∑ÅFÇPÇWÇPÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS032-JIFURIT.
              05  QBS032-UKETSUKENO               PIC  X(008).
              05  QBS032-BANKCD                   PIC  X(004).
              05  QBS032-SHITENCD                 PIC  X(003).
              05  QBS032-YOKINSBT                 PIC  X(001).
              05  QBS032-KOUZANO                  PIC  X(008).
              05  QBS032-KOUZANAME                PIC  X(030).
              05  QBS032-KJKOUZANAME              PIC  X(030).
              05  QBS032-TSUTYOKIGOU              PIC  X(003).
              05  QBS032-TSUTYONO                 PIC  X(008).
              05  QBS032-YUUCHOSAIKBN             PIC  X(001).
              05  QBS032-STRDATE                  PIC  X(019).
              05  QBS032-UPDDATE                  PIC  X(019).
              05  QBS032-DELDATE                  PIC  X(019).
              05  QBS032-OPID                     PIC  X(008).
              05  QBS032-WSID                     PIC  X(020).
