      *****************************************************************
      * êMópäÓñ{Çs (QBS043)    ÉåÉRÅ[Éhí∑ÅFÇQÇRÇQÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS043-SNBASET.
              05  QBS043-TABANO                   PIC  X(006).
              05  QBS043-UKETSUKENO               PIC  X(008).
              05  QBS043-INQKBN                   PIC  X(001).
              05  QBS043-KAZOKURENBAN             PIC  X(001).
              05  QBS043-SAIIRAIKBN               PIC  X(001).
              05  QBS043-SAIIRAICNT               PIC  X(003).
              05  QBS043-CICINQREQ                PIC  X(001).
              05  QBS043-CICINQRESULT             PIC  X(001).
              05  QBS043-JISHAINQREQ              PIC  X(001).
              05  QBS043-JISHAINQRESULT           PIC  X(001).
              05  QBS043-BLACKINQREQ              PIC  X(001).
              05  QBS043-BLACKINQRESULT           PIC  X(001).
              05  QBS043-NGRIYU                   PIC  X(004).
              05  QBS043-RECORDKBN                PIC  X(001).
              05  QBS043-RECORDSKB1               PIC  X(001).
              05  QBS043-RENBAN1                  PIC  X(002).
              05  QBS043-RECORDSKB2               PIC  X(001).
              05  QBS043-RENBAN2                  PIC  X(002).
              05  QBS043-IDXNO                    PIC  X(006).
              05  QBS043-INQNO                    PIC  X(006).
              05  QBS043-SEQNO                    PIC  X(018).
              05  QBS043-DTSBT                    PIC  X(002).
              05  QBS043-CRE1                     PIC  X(003).
              05  QBS043-CRE21                    PIC  X(003).
              05  QBS043-CRE22                    PIC  X(003).
              05  QBS043-CRE23                    PIC  X(003).
              05  QBS043-CRE24                    PIC  X(003).
              05  QBS043-CRE25                    PIC  X(003).
              05  QBS043-CRE26                    PIC  X(003).
              05  QBS043-CRE27                    PIC  X(003).
              05  QBS043-CRE28                    PIC  X(003).
              05  QBS043-CRE29                    PIC  X(003).
              05  QBS043-CRE210                   PIC  X(003).
              05  QBS043-INQ1                     PIC  X(003).
              05  QBS043-INQ21                    PIC  X(003).
              05  QBS043-INQ22                    PIC  X(003).
              05  QBS043-INQ23                    PIC  X(003).
              05  QBS043-INQ24                    PIC  X(003).
              05  QBS043-INQ25                    PIC  X(003).
              05  QBS043-INQ26                    PIC  X(003).
              05  QBS043-INQ27                    PIC  X(003).
              05  QBS043-INQ28                    PIC  X(003).
              05  QBS043-INQ29                    PIC  X(003).
              05  QBS043-INQ210                   PIC  X(003).
              05  QBS043-RUIJI                    PIC  X(003).
              05  QBS043-TELS1                    PIC  X(003).
              05  QBS043-TELS2                    PIC  X(003).
              05  QBS043-RUIMEI                   PIC  X(003).
              05  QBS043-STRDATE                  PIC  X(019).
              05  QBS043-UPDDATE                  PIC  X(019).
              05  QBS043-DELDATE                  PIC  X(019).
              05  QBS043-OPID                     PIC  X(008).
              05  QBS043-WSID                     PIC  X(020).
