      *****************************************************************
      * ìdòbí†Çs (QBS036)    ÉåÉRÅ[Éhí∑ÅFÇWÇPÇOÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS036-TELINFOT.
              05  QBS036-UKETSUKENO               PIC  X(008).
              05  QBS036-KANKEIKBN                PIC  X(001).
              05  QBS036-KAZOKURBN                PIC  X(001).
              05  QBS036-SHOZAIKBN                PIC  X(001).
              05  QBS036-TEL1                     PIC  X(007).
              05  QBS036-TEL2                     PIC  X(004).
              05  QBS036-TEL3                     PIC  X(004).
              05  QBS036-YUBINNO                  PIC  X(007).
              05  QBS036-TELKNNAME                PIC  X(070).
              05  QBS036-TELKJNAME                PIC  X(070).
              05  QBS036-TELKNJUSHO1              PIC  X(040).
              05  QBS036-TELKNJUSHO2              PIC  X(100).
              05  QBS036-TELKNJUSHO3              PIC  X(100).
              05  QBS036-TELKJJUSHO1              PIC  X(040).
              05  QBS036-TELKJJUSHO2              PIC  X(100).
              05  QBS036-TELKJJUSHO3              PIC  X(100).
              05  QBS036-TELSEX                   PIC  X(001).
              05  QBS036-TELKJHJKBN               PIC  X(001).
              05  QBS036-TELKNNAME2               PIC  X(070).
              05  QBS036-STRDATE                  PIC  X(019).
              05  QBS036-UPDDATE                  PIC  X(019).
              05  QBS036-DELDATE                  PIC  X(019).
              05  QBS036-OPID                     PIC  X(008).
              05  QBS036-WSID                     PIC  X(020).
