      *****************************************************************
      * ìdòbî‘çÜéØï Çs (QBS049)    ÉåÉRÅ[Éhí∑ÅFÇQÇPÇWÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS049-SNTELT.
              05  QBS049-TABANO                   PIC  X(006).
              05  QBS049-UKETSUKENO               PIC  X(008).
              05  QBS049-INQKBN                   PIC  X(001).
              05  QBS049-KAZOKURENBAN             PIC  X(001).
              05  QBS049-SAIIRAIKBN               PIC  X(001).
              05  QBS049-SAIIRAICNT               PIC  X(003).
              05  QBS049-CICINQREQ                PIC  X(001).
              05  QBS049-CICINQRESULT             PIC  X(001).
              05  QBS049-JISHAINQREQ              PIC  X(001).
              05  QBS049-JISHAINQRESULT           PIC  X(001).
              05  QBS049-BLACKINQREQ              PIC  X(001).
              05  QBS049-BLACKINQRESULT           PIC  X(001).
              05  QBS049-NGRIYU                   PIC  X(004).
              05  QBS049-RECORDKBN                PIC  X(001).
              05  QBS049-RECORDSKB1               PIC  X(001).
              05  QBS049-RENBAN1                  PIC  X(002).
              05  QBS049-RECORDSKB2               PIC  X(001).
              05  QBS049-RENBAN2                  PIC  X(002).
              05  QBS049-KUBUN                    PIC  X(002).
              05  QBS049-NAME                     PIC  X(030).
              05  QBS049-SYMD                     PIC  X(007).
              05  QBS049-YUBIN                    PIC  X(005).
              05  QBS049-CHIBAN                   PIC  X(003).
              05  QBS049-TEL                      PIC  X(014).
              05  QBS049-KRKYM                    PIC  X(004).
              05  QBS049-JYOKBN                   PIC  X(001).
              05  QBS049-NAME2                    PIC  X(030).
              05  QBS049-STRDATE                  PIC  X(019).
              05  QBS049-UPDDATE                  PIC  X(019).
              05  QBS049-DELDATE                  PIC  X(019).
              05  QBS049-OPID                     PIC  X(008).
              05  QBS049-WSID                     PIC  X(020).
