      *****************************************************************
      * é©é–É}ÉXÉ^Çs (QBS052)    ÉåÉRÅ[Éhí∑ÅFÇRÇTÇRÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS052-JISHAMST.
              05  QBS052-TABANO                   PIC  X(006).
              05  QBS052-UKETSUKENO               PIC  X(008).
              05  QBS052-INQKBN                   PIC  X(001).
              05  QBS052-KAZOKURENBAN             PIC  X(001).
              05  QBS052-SAIIRAIKBN               PIC  X(001).
              05  QBS052-SAIIRAICNT               PIC  X(003).
              05  QBS052-CICINQREQ                PIC  X(001).
              05  QBS052-CICINQRESULT             PIC  X(001).
              05  QBS052-JISHAINQREQ              PIC  X(001).
              05  QBS052-JISHAINQRESULT           PIC  X(001).
              05  QBS052-BLACKINQREQ              PIC  X(001).
              05  QBS052-BLACKINQRESULT           PIC  X(001).
              05  QBS052-NGRIYU                   PIC  X(004).
              05  QBS052-RECORDKBN                PIC  X(001).
              05  QBS052-RECORDSKB1               PIC  X(001).
              05  QBS052-RENBAN1                  PIC  X(002).
              05  QBS052-RECORDSKB2               PIC  X(001).
              05  QBS052-RENBAN2                  PIC  X(002).
              05  QBS052-TYPE                     PIC  X(002).
              05  QBS052-KAIINJYOTAI              PIC  X(008).
              05  QBS052-KAIINNO                  PIC  X(016).
              05  QBS052-KNNAME                   PIC  X(020).
              05  QBS052-BIRTHDAY                 PIC  X(019).
              05  QBS052-TEL1                     PIC  X(007).
              05  QBS052-TEL2                     PIC  X(004).
              05  QBS052-TEL3                     PIC  X(004).
              05  QBS052-BANKCD                   PIC  X(004).
              05  QBS052-BANKNAME                 PIC  X(020).
              05  QBS052-SHITENCD                 PIC  X(005).
              05  QBS052-SHITENNAME               PIC  X(020).
              05  QBS052-YOKINSBT                 PIC  X(001).
              05  QBS052-KOUZABANGO               PIC  X(008).
              05  QBS052-KOUZANAME                PIC  X(030).
              05  QBS052-JUSHOCD                  PIC  X(011).
              05  QBS052-POSSTATUS                PIC  X(002).
              05  QBS052-DAIHYOSTATUS             PIC  X(004).
              05  QBS052-CARDJYOKYO               PIC  X(004).
              05  QBS052-CIFNO                    PIC  X(008).
              05  QBS052-SHOPPINGZANDAKA          PIC  X(011).
              05  QBS052-CASHINGZANDAKA           PIC  X(011).
              05  QBS052-AZUKARIKIN               PIC  X(011).
              05  QBS052-RIYOUSHACD               PIC  X(001).
              05  QBS052-STRDATE                  PIC  X(019).
              05  QBS052-UPDDATE                  PIC  X(019).
              05  QBS052-DELDATE                  PIC  X(019).
              05  QBS052-OPID                     PIC  X(008).
              05  QBS052-WSID                     PIC  X(020).
