      *****************************************************************
      * ÇbÇqóﬁéóèÓïÒÇs (QBS042)    ÉåÉRÅ[Éhí∑ÅFÇRÇOÇOÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS042-CRRUIJIT.
              05  QBS042-TABANO                   PIC  X(006).
              05  QBS042-UKETSUKENO               PIC  X(008).
              05  QBS042-INQKBN                   PIC  X(001).
              05  QBS042-KAZOKURENBAN             PIC  X(001).
              05  QBS042-SAIIRAIKBN               PIC  X(001).
              05  QBS042-SAIIRAICNT               PIC  X(003).
              05  QBS042-CICINQREQ                PIC  X(001).
              05  QBS042-CICINQRESULT             PIC  X(001).
              05  QBS042-JISHAINQREQ              PIC  X(001).
              05  QBS042-JISHAINQRESULT           PIC  X(001).
              05  QBS042-BLACKINQREQ              PIC  X(001).
              05  QBS042-BLACKINQRESULT           PIC  X(001).
              05  QBS042-NGRIYU                   PIC  X(004).
              05  QBS042-RECORDKBN                PIC  X(001).
              05  QBS042-RECORDSKB1               PIC  X(001).
              05  QBS042-RENBAN1                  PIC  X(002).
              05  QBS042-RECORDSKB2               PIC  X(001).
              05  QBS042-RENBAN2                  PIC  X(002).
              05  QBS042-TYPE                     PIC  X(002).
              05  QBS042-KANANA                   PIC  X(030).
              05  QBS042-KANJINA                  PIC  X(020).
              05  QBS042-SYMD                     PIC  X(007).
              05  QBS042-YUBIN                    PIC  X(005).
              05  QBS042-CHIBAN                   PIC  X(003).
              05  QBS042-KANAADD                  PIC  X(060).
              05  QBS042-TEL                      PIC  X(014).
              05  QBS042-SAISHYMD                 PIC  X(007).
              05  QBS042-SAISKNM                  PIC  X(030).
              05  QBS042-STRDATE                  PIC  X(019).
              05  QBS042-UPDDATE                  PIC  X(019).
              05  QBS042-DELDATE                  PIC  X(019).
              05  QBS042-OPID                     PIC  X(008).
              05  QBS042-WSID                     PIC  X(020).
