      *****************************************************************
      * 申込書Ｔ (QBS029)    レコード長：１８５８Ｂｙｔｅ
      *****************************************************************
            03  QBS029-MOSHIKOMIT.
              05  QBS029-UKETSUKENO               PIC  X(008).
              05  QBS029-COURIERID                PIC  X(015).
              05  QBS029-KAKUTOKUTEN              PIC  X(002).
              05  QBS029-EIGYOTEN                 PIC  X(002).
              05  QBS029-KAKUTOKUROUT             PIC  X(009).
              05  QBS029-INPUTROUTE               PIC  X(001).
              05  QBS029-CARDKBN                  PIC  X(006).
              05  QBS029-CARDSYURUI               PIC  X(001).
              05  QBS029-CARDHAKKOKEITAI          PIC  X(001).
              05  QBS029-IMAGESTRDATE             PIC  X(019).
              05  QBS029-IMAGEFILE                PIC  X(080).
              05  QBS029-HONFACEKBN               PIC  X(001).
              05  QBS029-HONTEIKEIKBN             PIC  X(001).
              05  QBS029-HONKNNAME                PIC  X(030).
              05  QBS029-HONKJNAME                PIC  X(030).
              05  QBS029-HONRMNAME                PIC  X(030).
              05  QBS029-HONJUSHOCD               PIC  X(011).
              05  QBS029-HONCHIBAN                PIC  X(003).
              05  QBS029-HONYUBINNO               PIC  X(007).
              05  QBS029-HONKNTODOFUKEN           PIC  X(008).
              05  QBS029-HONKNSHIKCHOSN           PIC  X(042).
              05  QBS029-HONKNBANCHI              PIC  X(015).
              05  QBS029-HONKNKATAGAKI            PIC  X(032).
              05  QBS029-HONKJJUSHO               PIC  X(050).
              05  QBS029-HONKJBANCHI              PIC  X(030).
              05  QBS029-HONKJKATAGAKI            PIC  X(064).
              05  QBS029-HONTEL1                  PIC  X(007).
              05  QBS029-HONTEL2                  PIC  X(004).
              05  QBS029-HONTEL3                  PIC  X(004).
              05  QBS029-HONKEITAITEL1            PIC  X(007).
              05  QBS029-HONKEITAITEL2            PIC  X(004).
              05  QBS029-HONKEITAITEL3            PIC  X(004).
              05  QBS029-HONSEX                   PIC  X(001).
              05  QBS029-HONBIRTHDAY              PIC  X(019).
              05  QBS029-HONSUMAIKBN              PIC  X(001).
              05  QBS029-HONSUMAINENSU            PIC  X(001).
              05  QBS029-HONHAIGUUM               PIC  X(001).
              05  QBS029-HONCHILDSU               PIC  X(002).
              05  QBS029-HONDOKYOKBN              PIC  X(001).
              05  QBS029-HONCASHKIBOKG            PIC  X(003).
              05  QBS029-HONZANDAKACNT            PIC  X(002).
              05  QBS029-HONZANDAKAKG             PIC  X(011).
              05  QBS029-HONPASSWORD              PIC  X(004).
              05  QBS029-HONCALLKBN               PIC  X(001).
              05  QBS029-HONCALLNAME              PIC  X(020).
              05  QBS029-KINSHOKUSHU              PIC  X(001).
              05  QBS029-KINKINMUKBN              PIC  X(001).
              05  QBS029-KINKNHAIGUNAME           PIC  X(030).
              05  QBS029-KINKJHAIGUNAME           PIC  X(030).
              05  QBS029-KINHAIGUZOKGR            PIC  X(001).
              05  QBS029-KINHAIGUBIRTH            PIC  X(019).
              05  QBS029-KINKNNAME                PIC  X(030).
              05  QBS029-KINKJNAME                PIC  X(060).
              05  QBS029-KINJUSHOCD               PIC  X(011).
              05  QBS029-KINCHIBAN                PIC  X(003).
              05  QBS029-KINYUBINNO               PIC  X(007).
              05  QBS029-KINKNTODOFUKEN           PIC  X(008).
              05  QBS029-KINKNSHIKCHOSN           PIC  X(042).
              05  QBS029-KINKNBANCHI              PIC  X(015).
              05  QBS029-KINKNKATAGAKI            PIC  X(032).
              05  QBS029-KINKJJUSHO               PIC  X(050).
              05  QBS029-KINKJBANCHI              PIC  X(030).
              05  QBS029-KINKJKATAGAKI            PIC  X(064).
              05  QBS029-KINTEL1                  PIC  X(007).
              05  QBS029-KINTEL2                  PIC  X(004).
              05  QBS029-KINTEL3                  PIC  X(004).
              05  QBS029-KINNAISEN                PIC  X(005).
              05  QBS029-KINHONTEL1               PIC  X(007).
              05  QBS029-KINHONTEL2               PIC  X(004).
              05  QBS029-KINHONTEL3               PIC  X(004).
              05  QBS029-KINNENSHUKBN             PIC  X(001).
              05  QBS029-KINSHUNYUKBN             PIC  X(001).
              05  QBS029-KINKJMAENAME             PIC  X(060).
              05  QBS029-KINMAENENSUKBN           PIC  X(001).
              05  QBS029-KINMAERIYU               PIC  X(001).
              05  QBS029-KINSHOZOKUBUKA           PIC  X(030).
              05  QBS029-KINYAKUSHOKU             PIC  X(020).
              05  QBS029-KINNYUSHADATE            PIC  X(006).
              05  QBS029-KINSETSURITSU            PIC  X(006).
              05  QBS029-KINSHIHONKG              PIC  X(001).
              05  QBS029-KINJUGYOCNT              PIC  X(001).
              05  QBS029-KINNENSUKBN              PIC  X(001).
              05  QBS029-KINJIEINAIYO             PIC  X(040).
              05  QBS029-KINELSENENSHU            PIC  X(001).
              05  QBS029-KINELSESHUNYU            PIC  X(040).
              05  QBS029-SKISHOKAISHA             PIC  X(030).
              05  QBS029-SKIKACD                  PIC  X(006).
              05  QBS029-SKIKOJINCD               PIC  X(007).
              05  QBS029-SKINAISEN                PIC  X(005).
              05  QBS029-SKIMISECD                PIC  X(002).
              05  QBS029-SKIBUHANCD               PIC  X(004).
              05  QBS029-SKICORNERDATE            PIC  X(019).
              05  QBS029-ELSTOZAIKBN              PIC  X(001).
              05  QBS029-ELSCLABUCD               PIC  X(002).
              05  QBS029-ELSFUNYUSKB              PIC  X(004).
              05  QBS029-ELSHENSAIHOHO            PIC  X(001).
              05  QBS029-ELSCARDSOUFU             PIC  X(001).
              05  QBS029-ELSSEIKYUSOFU            PIC  X(001).
              05  QBS029-ELSCARDHAKKOKBN          PIC  X(001).
              05  QBS029-ELSCARDYUSOKBN           PIC  X(001).
              05  QBS029-ELSBUBIKIKBN             PIC  X(001).
              05  QBS029-ELSYOSINRANK             PIC  X(001).
              05  QBS029-ELSCARDUMUFLG            PIC  X(010).
              05  QBS029-ELSCARDSINPAN            PIC  X(030).
              05  QBS029-ELSCARDSONOTA            PIC  X(030).
              05  QBS029-CTLCANS                  PIC  X(001).
              05  QBS029-CTLCANRIYU               PIC  X(004).
              05  QBS029-CTLCANTUIKI              PIC  X(060).
              05  QBS029-CTLHENKYAKUS             PIC  X(001).
              05  QBS029-CTLCANSOKUJIKBN          PIC  X(001).
              05  QBS029-CTLSEISADATE             PIC  X(019).
              05  QBS029-CTLFSTSGDATE             PIC  X(019).
              05  QBS029-CTLSCDSNSDATE            PIC  X(019).
              05  QBS029-CTLMSTSTRDATE            PIC  X(019).
              05  QBS029-CTLHAKKENDATE            PIC  X(019).
              05  QBS029-CTLRONEDATE              PIC  X(019).
              05  QBS029-CTLHONKNNAME             PIC  X(030).
              05  QBS029-CTLKINKNNAME             PIC  X(030).
              05  QBS029-CTLKANRITEN              PIC  X(002).
              05  QBS029-CTLKAISHATEN             PIC  X(002).
              05  QBS029-CTLJIGYOTEN              PIC  X(002).
              05  QBS029-CTLDMTEN                 PIC  X(002).
              05  QBS029-CTLFLOKBN                PIC  X(001).
              05  QBS029-NOCIFNO                  PIC  X(008).
              05  QBS029-NOKAIINNO                PIC  X(016).
              05  QBS029-NOBLACKNO                PIC  X(007).
              05  QBS029-NOCICINQNO               PIC  X(008).
              05  QBS029-RONSYURUI                PIC  X(001).
              05  QBS029-RONKNG                   PIC  X(011).
              05  QBS029-RONSHIHARAICNT           PIC  X(003).
              05  QBS029-RONATAMAKNG              PIC  X(009).
              05  QBS029-RONKAIINNO               PIC  X(016).
              05  QBS029-RONSKTKBN                PIC  X(001).
              05  QBS029-RONSKTKESSAICD           PIC  X(008).
              05  QBS029-STRDATE                  PIC  X(019).
              05  QBS029-UPDDATE                  PIC  X(019).
              05  QBS029-DELDATE                  PIC  X(019).
              05  QBS029-OPID                     PIC  X(008).
              05  QBS029-WSID                     PIC  X(020).
      * 2001/08/01 カードローン対応　項目追加による修正SQT.SATOU -->
      * QBS029-ELSYUUCHOSAIKBNは修正もれの為、今回追加した。
              05  QBS029-ELSYUUCHOSAIKBN          PIC  X(001).
              05  QBS029-HENSAIKNG                PIC  X(001).
              05  QBS029-BOUNASKNG                PIC  X(002).
      * 2001/08/01 カードローン対応　申込書Ｔ項目追加  SQT.SATOU <--
