      *****************************************************************
      * ïRïtÇØÉÅÉÇÇs (QBS069)    ÉåÉRÅ[Éhí∑ÅFÇUÇVÇVÇaÇxÇsÇd
      *****************************************************************
            03  QBS069-LINKMEMOT.
              05  QBS069-UKETSUKENO                PIC  X(008).
              05  QBS069-MAKEDATE                  PIC  X(019).
              05  QBS069-MEMOCD                    PIC  X(008).
              05  QBS069-MEMOBNR                   PIC  X(002).
              05  QBS069-INQKBN                    PIC  X(001).
              05  QBS069-LINKRENBAN                PIC  X(002).
              05  QBS069-LINKKAIIN                 PIC  X(016).
              05  QBS069-LINKUKETSUKE              PIC  X(008).
              05  QBS069-LINKKIGYO                 PIC  X(004).
              05  QBS069-LINKSUBRANGE              PIC  X(004).
              05  QBS069-LINKNAIBUKAIIN            PIC  X(008).
              05  QBS069-MEMO                      PIC  X(512).
              05  QBS069-STRDATE                   PIC  X(019).
              05  QBS069-UPDDATE                   PIC  X(019).
              05  QBS069-DELDATE                   PIC  X(019).
              05  QBS069-OPID                      PIC  X(008).
              05  QBS069-WSID                      PIC  X(020).
