      *****************************************************************
      * ÉuÉâÉbÉNìoò^ÇhÇe(QBS022)  ÉåÉRÅ[Éhí∑ÅFÇUÇOÇOÇaÇôÇîÇÖ
      *****************************************************************
            03  BLK-TABANO                             PIC 9(006).
            03  FILLER                                 PIC X(008).
            03  BLK-TENINF.   
              05  BLK-EIGYOTEN                         PIC 9(002).
              05  BLK-KAKUTOKUTEN                      PIC 9(002).
            03  BLK-STRDATE                            PIC 9(007).
            03  BLK-STRKBN                             PIC 9(001).
            03  BLK-RIYU                               PIC 9(002).
            03  BLK-RIYUTSUIKI                         PIC N(010).
            03  BLK-UKETSUKENO                         PIC 9(008).
            03  BLK-KAIINNO                            PIC 9(012).
            03  BLK-HONKNNAME                          PIC X(030).
            03  BLK-HONKJNAME                          PIC N(015).
            03  BLK-HONBIRETHDAY                       PIC 9(007).
            03  BLK-SEX                                PIC 9(001).
            03  BLK-YUBINNO                            PIC X(008).
            03  BLK-CHIBAN                             PIC X(003).
            03  BLK-TELINF.   
              05  BLK-HONTEL.   
                07  BLK-HONTEL1                        PIC X(007).
                07  BLK-HONTEL2                        PIC X(004).
                07  BLK-HONTEL3                        PIC X(004).
              05  BLK-KINTEL.   
                07  BLK-KINTEL1                        PIC X(007).
                07  BLK-KINTEL2                        PIC X(004).
                07  BLK-KINTEL3                        PIC X(004).
            03  BLK-JUSHOINF.   
              05  BLK-HONJUSHO.   
                07  BLK-HONJUSHOCD                     PIC 9(011).
                07  BLK-HONKNBANCHI                    PIC X(015).
                07  BLK-HONKNKATAGAKI                  PIC X(032).
                07  BLK-HONKJBANCHI                    PIC N(015).
                07  BLK-HONKJKATAGAKI                  PIC N(032).
              05  BLK-KINJUSHO.   
                07  BLK-KINKINMUKBN                    PIC 9(001).
                07  BLK-KINKNNAME                      PIC X(030).
                07  BLK-KINKJNAME                      PIC N(015).
                07  BLK-KINJUSHOCD                     PIC 9(011).
                07  BLK-KINKNBANCHI                    PIC X(015).
                07  BLK-KINKNKATAGAKI                  PIC X(032).
                07  BLK-KINKJBANCHI                    PIC N(015).
                07  BLK-KINKJKATAGAKI                  PIC N(032).
              05  BLK-CIFNO                            PIC 9(008).
            03  BLK-CARDKBN                            PIC 9(006).
            03  FILLER                                 PIC X(044).
