      *****************************************************************
      * ìùåvÇs (QBS051)    ÉåÉRÅ[Éhí∑ÅFÇPÇSÇXÇTÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS051-TOKEIT.
              05  QBS051-UKETSUKENO               PIC  X(008).
              05  QBS051-KAKUTOKUTEN              PIC  X(002).
              05  QBS051-EIGYOTEN                 PIC  X(002).
              05  QBS051-INPUTROUTE               PIC  X(001).
              05  QBS051-CARDKBN                  PIC  X(006).
              05  QBS051-CARDHAKKOUKEITAI         PIC  X(001).
              05  QBS051-IMAGESTRDATE             PIC  X(019).
              05  QBS051-IMAGESTRUSER             PIC  X(040).
              05  QBS051-WFSTRDATE                PIC  X(019).
              05  QBS051-WFSTRUSER                PIC  X(040).
              05  QBS051-PASSWORDNRKDATE          PIC  X(019).
              05  QBS051-PASSWORDNRKUSER          PIC  X(040).
              05  QBS051-PASSWORDSISDATE          PIC  X(019).
              05  QBS051-PASSWORDSISUSER          PIC  X(040).
              05  QBS051-MOUSINRKDATE             PIC  X(019).
              05  QBS051-MOUSINRKUSER             PIC  X(040).
              05  QBS051-MOUSISISDATE             PIC  X(019).
              05  QBS051-MOUSISISUSER             PIC  X(040).
              05  QBS051-INQIRAIDATE              PIC  X(019).
              05  QBS051-INQIRAIUSER              PIC  X(040).
              05  QBS051-INQKAKUTEIDATE           PIC  X(019).
              05  QBS051-INQKAKUTEIUSER           PIC  X(040).
              05  QBS051-ZAIKAKUWAKEDATE          PIC  X(019).
              05  QBS051-ZAIKAKUWAKEUSER          PIC  X(040).
              05  QBS051-ZAIKAKUDATE              PIC  X(019).
              05  QBS051-ZAIKAKUUSER              PIC  X(040).
              05  QBS051-JIDOUSINSADATE           PIC  X(019).
              05  QBS051-JIDOUSINSAUSER           PIC  X(040).
              05  QBS051-2JISINSAIRAIDATE         PIC  X(019).
              05  QBS051-2JISINSAIRAIUSER         PIC  X(040).
              05  QBS051-2JISINSAKNRDATE          PIC  X(019).
              05  QBS051-2JISINSAKNRUSER          PIC  X(040).
              05  QBS051-ISHIKAKUWAKEDATE         PIC  X(019).
              05  QBS051-ISHIKAKUWAKEUSER         PIC  X(040).
              05  QBS051-ISHIKAKUDATE             PIC  X(019).
              05  QBS051-ISHIKAKUUSER             PIC  X(040).
              05  QBS051-MASTERSTRIRAIDATE        PIC  X(019).
              05  QBS051-MASTERSTRIRAIUSER        PIC  X(040).
              05  QBS051-MASTERSTRKNRDATE         PIC  X(019).
              05  QBS051-MASTERSTRKNRUSER         PIC  X(040).
              05  QBS051-HAKKENDATE               PIC  X(019).
              05  QBS051-HAKKENUSER               PIC  X(040).
              05  QBS051-YAKUJOSHONINDATE         PIC  X(019).
              05  QBS051-YAKUJOSHONINUSER         PIC  X(040).
              05  QBS051-CANCELNRKDATE            PIC  X(019).
              05  QBS051-CANCELNRKUSER            PIC  X(040).
              05  QBS051-FUBIIRAISU               PIC  X(002).
              05  QBS051-MEMONRKSU                PIC  X(002).
              05  QBS051-ZAIKAKSU                 PIC  X(002).
              05  QBS051-KAZOKUUMU                PIC  X(001).
              05  QBS051-SHINHOUMU                PIC  X(001).
              05  QBS051-JDSJ001                  PIC  X(001).
              05  QBS051-JDSJ002                  PIC  X(001).
              05  QBS051-JDSJ003                  PIC  X(001).
              05  QBS051-JDSJ004                  PIC  X(001).
              05  QBS051-JDSJ005                  PIC  X(001).
              05  QBS051-JDSJ006                  PIC  X(001).
              05  QBS051-JDSJ007                  PIC  X(001).
              05  QBS051-JDSJ008                  PIC  X(001).
              05  QBS051-JDSJ009                  PIC  X(001).
              05  QBS051-JDSJ010                  PIC  X(001).
              05  QBS051-JDSJ011                  PIC  X(001).
              05  QBS051-JDSJ012                  PIC  X(001).
              05  QBS051-JDSJ013                  PIC  X(001).
              05  QBS051-JDSJ014                  PIC  X(001).
              05  QBS051-JDSJ015                  PIC  X(001).
              05  QBS051-JDSJ016                  PIC  X(001).
              05  QBS051-JDSJ017                  PIC  X(001).
              05  QBS051-JDSJ018                  PIC  X(001).
              05  QBS051-JDSJ019                  PIC  X(001).
              05  QBS051-JDSJ020                  PIC  X(001).
              05  QBS051-JDSJ021                  PIC  X(001).
              05  QBS051-JDSJ022                  PIC  X(001).
              05  QBS051-JDSJ023                  PIC  X(001).
              05  QBS051-JDSJ024                  PIC  X(001).
              05  QBS051-JDSJ025                  PIC  X(001).
              05  QBS051-JDSJ026                  PIC  X(001).
              05  QBS051-JDSJ027                  PIC  X(001).
              05  QBS051-JDSJ028                  PIC  X(001).
              05  QBS051-JDSJ029                  PIC  X(001).
              05  QBS051-JDSJ030                  PIC  X(001).
              05  QBS051-JDSC001                  PIC  X(001).
              05  QBS051-JDSC002                  PIC  X(001).
              05  QBS051-JDSC003                  PIC  X(001).
              05  QBS051-JDSC004                  PIC  X(001).
              05  QBS051-JDSC005                  PIC  X(001).
              05  QBS051-JDSC006                  PIC  X(001).
              05  QBS051-JDSC007                  PIC  X(001).
              05  QBS051-JDSC008                  PIC  X(001).
              05  QBS051-JDSC009                  PIC  X(001).
              05  QBS051-JDSC010                  PIC  X(001).
              05  QBS051-JDSC011                  PIC  X(001).
              05  QBS051-JDSC012                  PIC  X(001).
              05  QBS051-JDSC013                  PIC  X(001).
              05  QBS051-JDSC014                  PIC  X(001).
              05  QBS051-JDSC015                  PIC  X(001).
              05  QBS051-JDSC016                  PIC  X(001).
              05  QBS051-JDSC017                  PIC  X(001).
              05  QBS051-JDSC018                  PIC  X(001).
              05  QBS051-JDSC019                  PIC  X(001).
              05  QBS051-JDSC020                  PIC  X(001).
              05  QBS051-JDSC021                  PIC  X(001).
              05  QBS051-JDSC022                  PIC  X(001).
              05  QBS051-JDSC023                  PIC  X(001).
              05  QBS051-JDSC024                  PIC  X(001).
              05  QBS051-JDSC025                  PIC  X(001).
              05  QBS051-JDSC026                  PIC  X(001).
              05  QBS051-JDSC027                  PIC  X(001).
              05  QBS051-JDSC028                  PIC  X(001).
              05  QBS051-JDSC029                  PIC  X(001).
              05  QBS051-JDSC030                  PIC  X(001).
              05  QBS051-JDSYOSINRANK             PIC  X(001).
              05  QBS051-JDSCASHLIMIT             PIC  X(011).
              05  QBS051-JDSKEKKA                 PIC  X(002).
              05  QBS051-JDSDATE                  PIC  X(019).
              05  QBS051-AESNYSKAIINNO            PIC  X(016).
              05  QBS051-AESKESSAITANTO           PIC  X(008).
              05  QBS051-AESKEKKA                 PIC  X(001).
              05  QBS051-AESRESULTCD              PIC  X(002).
              05  QBS051-AESRESULTMEMO            PIC  X(040).
              05  QBS051-AESYOSINRANK             PIC  X(001).
              05  QBS051-AESCASHLIMIT             PIC  X(011).
              05  QBS051-AESCENTERKBN             PIC  X(001).
              05  QBS051-CICACTPLAN1              PIC  X(002).
              05  QBS051-CICACTPLAN2              PIC  X(002).
              05  QBS051-CICACTPLAN3              PIC  X(002).
              05  QBS051-KJUACTPLAN1              PIC  X(002).
              05  QBS051-KJUACTPLAN2              PIC  X(002).
              05  QBS051-KJUACTPLAN3              PIC  X(002).
              05  QBS051-KINACTPLAN1              PIC  X(002).
              05  QBS051-KINACTPLAN2              PIC  X(002).
              05  QBS051-KINACTPLAN3              PIC  X(002).
              05  QBS051-KESSAITANTOU             PIC  X(008).
              05  QBS051-KESSAIKEKKA              PIC  X(002).
              05  QBS051-STRDATE                  PIC  X(019).
              05  QBS051-UPDDATE                  PIC  X(019).
              05  QBS051-DELDATE                  PIC  X(019).
              05  QBS051-OPID                     PIC  X(008).
              05  QBS051-WSID                     PIC  X(020).
