      *****************************************************************
      * 削除キーデータ＜削除依頼Ｔ＞ (QBS071) レコード長：１４ＢＹＴＥ
      *****************************************************************
           03  QBS071-SEG.
               05  QBS071-UKETSUKENO         PIC  X(008).
               05  QBS071-DELETEDATE         PIC  X(006).
