000100******************************************************************
000200*       ＪＣＢ属性累積データファイル    QBSXXX-->(QBS074)RL:1000 *
000300*                                                                *
000400*                                                 2004.02.16     *
000500******************************************************************
000600     03  QBS074-SEG.                                 *>属性累積データ
000700       05  QBS074-G0010.                             *>ヘッダレコード
000800         07  QBS074-A0010        PIC  9(001).        *>レコード区分
000900         07  QBS074-A0020        PIC  9(002).        *>種別コード
001000         07  QBS074-A0030        PIC  9(001).        *>コード区分
001100         07  QBS074-A0040        PIC  X(004).        *>仕向会社コード
001200         07  QBS074-A0050        PIC  X(020).        *>仕向会社名
001300         07  QBS074-A0060        PIC  9(006).        *>締切日
001400         07  QBS074-A0070        PIC  X(004).        *>被仕向会社コー
001500         07  QBS074-A0080        PIC  X(020).        *>被仕向会社名
001600         07  QBS074-A0090        PIC  9(006).        *>処理日
001700         07  FILLER              PIC  X(936).
001800       05 QBS074-G0100  REDEFINES  QBS074-G0010.     *>データレコード
001900         07  QBS074-T0100.                           *>ＫＥＹ項目
002000           09  QBS074-A0100      PIC  9(001).        *>レコード区分
002100           09  QBS074-A0110      PIC  9(004).        *>データ種別
002200           09  QBS074-A0120      PIC  9(001).        *>人格区分
002300           09  QBS074-A0130      PIC  9(002).        *>カードコード種
002400           09  QBS074-A0140      PIC  X(001).        *>新規種別コード
002500           09  QBS074-A0150      PIC  9(001).        *>代理人サイン
002600           09  QBS074-A0160      PIC  X(016).        *>ＪＣＢ会員番号
002700           09  QBS074-A0170      PIC  X(016).        *>ＪＣＢ会員番号
002800           09  QBS074-A0180      PIC  X(001).        *>カナ氏名変更Ｓ
002900           09  QBS074-A0190      PIC  X(020).        *>カナ氏名
003000           09  QBS074-A0200      PIC  X(001).        *>ALPHA氏名変更
003100           09  QBS074-A0210      PIC  X(025).        *>ALPHA氏名
003200           09  QBS074-A0220      PIC  X(001).        *>性別区分
003300           09  QBS074-A0230      PIC  X(001).        *>家族会員続柄区
003400           09  QBS074-A0240      PIC  X(007).        *>生年月日
003500           09  QBS074-A0250      PIC  X(001).        *>年会費区分
003600           09  QBS074-A0260      PIC  X(001).        *>法人ダミー識別
003700           09  QBS074-A0270      PIC  X(001).        *>暗証番号変更Ｓ
003800           09  QBS074-A0280      PIC  X(004).        *>（暗証番号）
003900           09  QBS074-A0290      PIC  X(001).        *>（暗証サイン）
004000           09  QBS074-A0300      PIC  9(006).        *>入会年月日
004100           09  QBS074-A0310      PIC  9(004).        *>有効期限（西暦）
004200           09  QBS074-A0320      PIC  9(004).        *>保存期限（西暦）
004300         07  QBS074-T0330.                           *>通知先情報
004400           09  QBS074-A0330      PIC  X(001).        *>通知区分変更Ｓ
004500           09  QBS074-A0340      PIC  X(001).        *>郵便物送付先区
004600           09  QBS074-A0350      PIC  X(001).        *>カード送付先区
004700           09  QBS074-A0360      PIC  X(001).        *>電話連絡先区分
004800           09  FILLER            PIC  X(001).
004900         07  QBS074-T0370.                           *>自宅情報
005000           09  QBS074-A0370      PIC  X(009).        *>自宅住所コード
005100           09  QBS074-A0380      PIC  X(001).        *>自宅住所変更Ｓ
005200           09  QBS074-A0390      PIC  X(005).        *>自宅郵便Ｎｏ．
005300           09  QBS074-A0400      PIC  X(020).        *>自宅カナ住所（１）
005400           09  QBS074-A0410      PIC  X(020).        *>自宅カナ住所（２）
005500           09  QBS074-A0420      PIC  X(020).        *>自宅カナ住所（３）
005600           09  QBS074-A0430      PIC  X(001).        *>自宅電話番号変Ｓ
005700           09  QBS074-A0440      PIC  X(012).        *>自宅電話番号
005800           09  QBS074-A0450      PIC  X(001).        *>家族状況区分
005900           09  QBS074-A0460      PIC  X(001).        *>住宅状況区分
006000           09  QBS074-A0470      PIC  X(001).        *>専用カードサイ
006100           09  QBS074-A0480      PIC  X(004).        *>未払残高枠
006200         07  QBS074-T0490.                           *>決済情報
006300           09  QBS074-A0490      PIC  X(001).        *>ＦＣコード変更
006400           09  QBS074-A0500      PIC  X(006).        *>ＦＣコード
006500           09  QBS074-A0510      PIC  X(001).        *>提携先コード変
006600           09  QBS074-A0520      PIC  X(006).        *>提携先コード
006700           09  QBS074-A0530      PIC  X(001).        *>金融機関コード
006800           09  QBS074-A0540      PIC  9(004).        *>金融機関コード
006900           09  QBS074-A0550      PIC  9(004).        *>営業店コード
007000           09  QBS074-A0560      PIC  9(001).        *>預金種別
007100           09  QBS074-A0570      PIC  X(010).        *>口座番号
007200           09  QBS074-A0580      PIC  X(003).        *>管理地区コード
007300           09  QBS074-A0590      PIC  X(001).        *>決済口座名義名
007400           09  QBS074-A0600      PIC  X(020).        *>決済口座名義名
007500           09  QBS074-A0610      PIC  X(001).        *>決済区分
007600           09  QBS074-A0620      PIC  X(001).        *>提携先情報変更
007700           09  QBS074-A0630      PIC  X(030).        *>提携先情報
007800           09  QBS074-A0640      PIC  X(010).        *>法人番号
007900         07  QBS074-T0650.                           *>勤務先情報
008000           09  QBS074-A0650      PIC  X(001).        *>勤務先名変更Ｓ
008100           09  QBS074-A0660      PIC  X(020).        *>勤務先名
008200           09  QBS074-A0670      PIC  X(001).        *>勤務先対象区分
008300           09  FILLER            PIC  X(002).
008400           09  QBS074-A0680      PIC  X(001).        *>所属部課名変更
008500           09  QBS074-A0690      PIC  X(020).        *>所属部課名
008600           09  QBS074-A0700      PIC  X(001).        *>役職名変更Ｓ
008700           09  QBS074-A0710      PIC  X(010).        *>役職名
008800           09  QBS074-A0720      PIC  X(006).        *>入社年月
008900           09  QBS074-A0730      PIC  X(006).        *>設立年月
009000           09  QBS074-A0740      PIC  X(001).        *>資本金区分
009100           09  QBS074-A0750      PIC  X(001).        *>従業員数区分
009200           09  QBS074-A0760      PIC  X(002).        *>年収コード
009300           09  QBS074-A0770      PIC  X(001).        *>行員提携先区分
009400           09  QBS074-A0780      PIC  X(001).        *>チャージバック
009500           09  QBS074-A0790      PIC  X(001).        *>重複レベル
009600           09  QBS074-A0800      PIC  X(005).        *>内部会員番号
009700           09  QBS074-A0810      PIC  X(009).        *>勤務先住所コード
009800           09  QBS074-A0820      PIC  X(001).        *>勤務先所在地変
009900           09  QBS074-A0830      PIC  X(005).        *>勤務先郵便Ｎｏ
010000           09  QBS074-A0840      PIC  X(020).        *>勤務先カナ所在
010100           09  QBS074-A0850      PIC  X(020).        *>勤務先カナ所在
010200           09  QBS074-A0860      PIC  X(020).        *>勤務先カナ所在
010300           09  QBS074-A0870      PIC  X(001).        *>勤務先電話番号
010400           09  QBS074-A0880      PIC  X(012).        *>勤務先電話番号
010500           09  QBS074-A0890      PIC  X(004).        *>勤務先電話番号
010600           09  QBS074-A0900      PIC  X(001).        *>会員状態
010700           09  QBS074-A0910      PIC  X(001).        *>オンラインバッ
010800           09  QBS074-A0920      PIC  X(006).        *>取引分割コード
010900         07  QBS074-T0930.                           *>申込保管情報
011000           09  QBS074-A0930      PIC  X(001).        *>申込書整理番号
011100           09  QBS074-A0940      PIC  X(016).        *>整理番号
011200         07  QBS074-T0950.                           *>処理日時
011300           09  QBS074-A0950      PIC  9(006).        *>処理年月日
011400           09  QBS074-A0960      PIC  9(006).        *>処理時分秒
011500         07  QBS074-T0970.                           *>審査結果情報
011600           09  QBS074-A0970      PIC  X(001).        *>審査結果区分
011700           09  QBS074-A0980      PIC  X(003).        *>審査結果理由コード
011800         07  QBS074-T0990.                           *>諸変更情報
011900           09  QBS074-A0990      PIC  X(002).        *>項目変更経路
012000           09  QBS074-A1000      PIC  X(020).        *>変更項目指示
012100           09  QBS074-A1010      PIC  X(040).        *>カード更新保留
012200           09  QBS074-A1020      PIC  X(005).        *>退会・除名理由
012300         07  QBS074-T1030.                           *>漢字情報
012400           09  QBS074-A1030      PIC  X(001).        *>漢字氏名変更Ｓ
012500           09  QBS074-A1040      PIC  N(020).        *>漢字氏名
012600           09  QBS074-A1050      PIC  X(001).        *>自宅漢字住所変
012700           09  QBS074-A1060      PIC  N(018).        *>自宅漢字住所１
012800           09  QBS074-A1070      PIC  N(018).        *>自宅漢字住所２
012900           09  QBS074-A1080      PIC  N(018).        *>自宅漢字住所３
013000           09  QBS074-A1090      PIC  N(018).        *>自宅漢字住所４
013100           09  QBS074-A1100      PIC  X(001).        *>勤務先漢字住所
013200           09  QBS074-A1110      PIC  N(018).        *>勤先漢字所在１
013300           09  QBS074-A1120      PIC  N(018).        *>勤先漢字所在２
013400           09  QBS074-A1130      PIC  N(018).        *>勤先漢字所在３
013500           09  QBS074-A1140      PIC  N(018).        *>勤先漢字所在４
013600           09  FILLER            PIC  X(009).
013700           09  QBS074-A1150      PIC  X(007).        *>自宅新郵便番号
013800           09  QBS074-A1160      PIC  X(007).        *>勤務先新郵便番
013900           09  FILLER            PIC  X(046).
014000       05 QBS074-G1170  REDEFINES  QBS074-G0010.     *>トレーラレコード
014100         07  QBS074-A1170        PIC  9(001).        *>レコード区分
014200         07  QBS074-A1180        PIC  9(009).        *>データ件数
014300         07  FILLER              PIC  X(990).
014400       05 QBS074-G1190  REDEFINES  QBS074-G0010.     *>エンドレコード
014500         07  QBS074-A1190        PIC  9(001).        *>レコード区分
014600         07  FILLER              PIC  X(999).
