      *****************************************************************
      * メールアドレステーブル (QBS067)    レコード長：２３０Ｂｙｔｅ
      *****************************************************************
           03  QBS067-SEG.
              05  QBS067-UKETSUKENO              PIC  X(008).
              05  QBS067-KAZOKURBN               PIC  X(001).
              05  QBS067-INQKBN                  PIC  X(001).
              05  QBS067-GAIBUKAIINNO            PIC  X(016).
              05  QBS067-ADDRESS                 PIC  X(100).
              05  QBS067-STRDATE                 PIC  X(019).
              05  QBS067-UPDDATE                 PIC  X(019).
              05  QBS067-DELDATE                 PIC  X(019).
              05  QBS067-EXPDATE                 PIC  X(019).
              05  QBS067-OPID                    PIC  X(008).
              05  QBS067-WSID                    PIC  X(020).
