      *****************************************************************
      * ÉLÉÉÉìÉZÉãÉÅÉÇÇs (QBS062)    ÉåÉRÅ[Éhí∑ÅFÇUÇRÇWÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS062-CANMEMOT.
              05  QBS062-UKETSUKENO               PIC  X(008).
              05  QBS062-MAKEDATE                 PIC  X(019).
              05  QBS062-MEMOCD                   PIC  X(008).
              05  QBS062-CANCELRIYU               PIC  X(004).
              05  QBS062-MOUSIHENKYAKU            PIC  X(001).
              05  QBS062-CANCELSOKUZIKBN          PIC  X(001).
              05  QBS062-MEMO                     PIC  X(512).
              05  QBS062-STRDATE                  PIC  X(019).
              05  QBS062-UPDDATE                  PIC  X(019).
              05  QBS062-DELDATE                  PIC  X(019).
              05  QBS062-OPID                     PIC  X(008).
              05  QBS062-WSID                     PIC  X(020).
              