      *****************************************************************
      * ç›ê–ämîFÇs (QBS033)    ÉåÉRÅ[Éhí∑ÅFÇUÇUÇTÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS033-ZAIKAKUT.
              05  QBS033-UKETSUKENO               PIC  X(008).
              05  QBS033-KAKUNINDAY               PIC  X(019).
              05  QBS033-KAKUNINSAKI              PIC  X(001).
              05  QBS033-KAKUNINAITE              PIC  X(001).
              05  QBS033-KAKUNINKEKKA             PIC  X(001).
              05  QBS033-KDNTEL1                  PIC  X(007).
              05  QBS033-KDNTEL2                  PIC  X(004).
              05  QBS033-KDNTEL3                  PIC  X(004).
              05  QBS033-NEXTKDNDATE              PIC  X(019).
              05  QBS033-KIJITSUKNRKBN            PIC  X(001).
              05  QBS033-KIJITSUKNRCNT            PIC  X(002).
              05  QBS033-WFKBN                    PIC  X(001).
              05  QBS033-MEMO                     PIC  X(512).
              05  QBS033-STRDATE                  PIC  X(019).
              05  QBS033-UPDDATE                  PIC  X(019).
              05  QBS033-DELDATE                  PIC  X(019).
              05  QBS033-OPID                     PIC  X(008).
              05  QBS033-WSID                     PIC  X(020).
