      *****************************************************************
      * î≠åîèÓïÒÇe (QBS027)    ÉåÉRÅ[Éhí∑ÅFÇUÇOÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS027-SEG.
              05  QBS027-T0010.
                07  QBS027-A0010                 PIC  9(004).
                07  QBS027-A0020                 PIC  9(004).
                07  QBS027-A0030                 PIC  9(008).
                07  QBS027-A0040                 PIC  9(016).
                07  QBS027-A0050                 PIC  9(008).
                07  QBS027-A0060                 PIC  9(008).
              05  QBS027-A0070                   PIC  X(012).
