      *****************************************************************
      * ämíËéÛïtî‘çÜ
      *****************************************************************
              03  QBS018-DATA.
                  05  QBS018-TABANO                        PIC 9(6).
                  05  QBS018-UKETSUKENO                    PIC X(8).
                  05  QBS018-INQKBN                        PIC X(001).
                  05  QBS018-KAZOKURENBAN                  PIC 9(001).

