      *****************************************************************
      * 受付件数ファイル (QBS076)    レコード長：１３３ＢＹＴＥ
      *****************************************************************
           03  QBS076-SEG.
      * スキャン日
               05  QBS076-A0010              PIC  X(010).
               05  FILLER                    PIC  X(001).
      * 経過日
               05  QBS076-A0020              PIC  X(005).
               05  FILLER                    PIC  X(001).
      * トータル件数
               05  QBS076-A0030              PIC  9(008).
               05  FILLER                    PIC  X(001).
      * キャンセル件数
               05  QBS076-A0040              PIC  9(008).
               05  FILLER                    PIC  X(001).
      * 応諾済件数
               05  QBS076-A0050              PIC  9(008).
               05  FILLER                    PIC  X(001).
      * 名寄せ確認済件数
               05  QBS076-A0060              PIC  9(008).
               05  FILLER                    PIC  X(001).
      * 名寄せ仮登録件数
               05  QBS076-A0070              PIC  9(008).
               05  FILLER                    PIC  X(001).
      * 名寄せなし件数
               05  QBS076-A0080              PIC  9(008).
               05  FILLER                    PIC  X(001).
      * 委託判定結果済件数
               05  QBS076-A0090              PIC  9(008).
               05  FILLER                    PIC  X(001).
      * 委託判定保留件数
               05  QBS076-A0100              PIC  9(008).
               05  FILLER                    PIC  X(001).
      * 委託判定なし件数
               05  QBS076-A0110              PIC  9(008).
               05  FILLER                    PIC  X(001).
      * 口振依頼確認済件数
               05  QBS076-A0120              PIC  9(008).
               05  FILLER                    PIC  X(001).
      * 口振依頼不備件数
               05  QBS076-A0130              PIC  9(008).
               05  FILLER                    PIC  X(001).
      * 口振依頼不要件数
               05  QBS076-A0140              PIC  9(008).
               05  FILLER                    PIC  X(001).
      * 口振依頼なし件数
               05  QBS076-A0150              PIC  9(008).
