      *****************************************************************
      * ÇbÇqå¬ï óvåèÇs (QBS041)    ÉåÉRÅ[Éhí∑ÅFÇTÇTÇXÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS041-CRKOBETSUYKT.
              05  QBS041-TABANO                   PIC  X(006).
              05  QBS041-UKETSUKENO               PIC  X(008).
              05  QBS041-INQKBN                   PIC  X(001).
              05  QBS041-KAZOKURENBAN             PIC  X(001).
              05  QBS041-SAIIRAIKBN               PIC  X(001).
              05  QBS041-SAIIRAICNT               PIC  X(003).
              05  QBS041-CICINQREQ                PIC  X(001).
              05  QBS041-CICINQRESULT             PIC  X(001).
              05  QBS041-JISHAINQREQ              PIC  X(001).
              05  QBS041-JISHAINQRESULT           PIC  X(001).
              05  QBS041-BLACKINQREQ              PIC  X(001).
              05  QBS041-BLACKINQRESULT           PIC  X(001).
              05  QBS041-NGRIYU                   PIC  X(004).
              05  QBS041-RECORDKBN                PIC  X(001).
              05  QBS041-RECORDSKB1               PIC  X(001).
              05  QBS041-RENBAN1                  PIC  X(002).
              05  QBS041-RECORDSKB2               PIC  X(001).
              05  QBS041-RENBAN2                  PIC  X(002).
              05  QBS041-GYOSYU                   PIC  X(002).
              05  QBS041-KAIIN                    PIC  X(004).
              05  QBS041-KEINO                    PIC  X(020).
              05  QBS041-KEIYMD                   PIC  X(007).
              05  QBS041-KEIKBN                   PIC  X(002).
              05  QBS041-TANPO                    PIC  X(001).
              05  QBS041-SYOHIN                   PIC  X(007).
              05  QBS041-HARAI                    PIC  X(003).
              05  QBS041-KEISYMD                  PIC  X(007).
              05  QBS041-KEIGAKU                  PIC  X(006).
              05  QBS041-KYOKGK                   PIC  X(006).
              05  QBS041-CKYOKGK                  PIC  X(006).
              05  QBS041-HOUYMD                   PIC  X(007).
              05  QBS041-ZANSAI                   PIC  X(006).
              05  QBS041-CZANSAI                  PIC  X(006).
              05  QBS041-SEIGAKU                  PIC  X(006).
              05  QBS041-NYUGAKU                  PIC  X(006).
              05  QBS041-NYURIGK                  PIC  X(006).
              05  QBS041-NYUREKI                  PIC  X(024).
              05  QBS041-KEICMNT                  PIC  X(002).
              05  QBS041-KEICYMD                  PIC  X(007).
              05  QBS041-ENDCMNT                  PIC  X(002).
              05  QBS041-KINGAKU                  PIC  X(006).
              05  QBS041-HRIKGK                   PIC  X(006).
              05  QBS041-HRIKYMD                  PIC  X(007).
              05  QBS041-KAIYMD                   PIC  X(007).
              05  QBS041-HOKBN                    PIC  X(001).
              05  QBS041-KANAHNA                  PIC  X(030).
              05  QBS041-KANJHNA                  PIC  X(020).
              05  QBS041-JYUKYO                   PIC  X(001).
              05  QBS041-JYUNEN                   PIC  X(001).
              05  QBS041-SYOKU                    PIC  X(001).
              05  QBS041-KNMNAME                  PIC  X(030).
              05  QBS041-KNMTEL                   PIC  X(014).
              05  QBS041-KMTLKBN                  PIC  X(001).
              05  QBS041-KNMNEN                   PIC  X(002).
              05  QBS041-NENSYU                   PIC  X(001).
              05  QBS041-SYOTOKU1                 PIC  X(001).
              05  QBS041-SYOTOKU2                 PIC  X(001).
              05  QBS041-SYOTOKU3                 PIC  X(001).
              05  QBS041-ZOKCMNT                  PIC  X(002).
              05  QBS041-KNRCMNT                  PIC  X(001).
              05  QBS041-CMNT                     PIC  X(001).
              05  QBS041-ZHFLG1                   PIC  X(001).
              05  QBS041-ZHFLG2                   PIC  X(001).
              05  QBS041-ZHFLG3                   PIC  X(001).
              05  QBS041-ZHFLG4                   PIC  X(001).
              05  QBS041-ZHFLG5                   PIC  X(001).
              05  QBS041-ZHFLG6                   PIC  X(001).
              05  QBS041-ZHFLG7                   PIC  X(001).
              05  QBS041-ZHFLG8                   PIC  X(001).
              05  QBS041-ZHFLG9                   PIC  X(001).
              05  QBS041-ZHFLG10                  PIC  X(001).
              05  QBS041-ZHFLG11                  PIC  X(001).
              05  QBS041-ZHFLG12                  PIC  X(001).
              05  QBS041-ZHFLG13                  PIC  X(001).
              05  QBS041-ZHFLG14                  PIC  X(001).
              05  QBS041-CMNTUMU                  PIC  X(001).
              05  QBS041-FUKCMNT                  PIC  X(100).
              05  QBS041-KNMNAME2                 PIC  X(030).
              05  QBS041-KNMTEL2                  PIC  X(014).
              05  QBS041-STRDATE                  PIC  X(019).
              05  QBS041-UPDDATE                  PIC  X(019).
              05  QBS041-DELDATE                  PIC  X(019).
              05  QBS041-OPID                     PIC  X(008).
              05  QBS041-WSID                     PIC  X(020).
