      *****************************************************************
      * çÏã∆ÉÅÉÇÇs (QBS064)    ÉåÉRÅ[Éhí∑ÅFÇUÇRÇQÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS064-WORKMEMOT.
              05  QBS064-UKETSUKENO               PIC  X(008).
              05  QBS064-MAKEDATE                 PIC  X(019).
              05  QBS064-MEMOCD                   PIC  X(008).
              05  QBS064-MEMO                     PIC  X(512).
              05  QBS064-STRDATE                  PIC  X(019).
              05  QBS064-UPDDATE                  PIC  X(019).
              05  QBS064-DELDATE                  PIC  X(019).
              05  QBS064-OPID                     PIC  X(008).
              05  QBS064-WSID                     PIC  X(020).
              