      *****************************************************************
      * à”éuämîFÇs (QBS034)    ÉåÉRÅ[Éhí∑ÅFÇUÇUÇTÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS034-ISHIKAKUT.
              05  QBS034-UKETSUKENO               PIC  X(008).
              05  QBS034-KAKUNINDAY               PIC  X(019).
              05  QBS034-KAKUNINSAKI              PIC  X(001).
              05  QBS034-KAKUNINAITE              PIC  X(001).
              05  QBS034-KAKUNINKEKKA             PIC  X(001).
              05  QBS034-KDNTEL1                  PIC  X(007).
              05  QBS034-KDNTEL2                  PIC  X(004).
              05  QBS034-KDNTEL3                  PIC  X(004).
              05  QBS034-NEXTKDNDATE              PIC  X(019).
              05  QBS034-KIJITSUKNRKBN            PIC  X(001).
              05  QBS034-KIJITSUKNRCNT            PIC  X(002).
              05  QBS034-WFKBN                    PIC  X(001).
              05  QBS034-MEMO                     PIC  X(512).
              05  QBS034-STRDATE                  PIC  X(019).
              05  QBS034-UPDDATE                  PIC  X(019).
              05  QBS034-DELDATE                  PIC  X(019).
              05  QBS034-OPID                     PIC  X(008).
              05  QBS034-WSID                     PIC  X(020).
