      *****************************************************************
      * è∆âÔóöóÇs (QBS047)    ÉåÉRÅ[Éhí∑ÅFÇPÇTÇTÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS047-SNINQRIREKIT.
              05  QBS047-TABANO                   PIC  X(006).
              05  QBS047-UKETSUKENO               PIC  X(008).
              05  QBS047-INQKBN                   PIC  X(001).
              05  QBS047-KAZOKURENBAN             PIC  X(001).
              05  QBS047-SAIIRAIKBN               PIC  X(001).
              05  QBS047-SAIIRAICNT               PIC  X(003).
              05  QBS047-CICINQREQ                PIC  X(001).
              05  QBS047-CICINQRESULT             PIC  X(001).
              05  QBS047-JISHAINQREQ              PIC  X(001).
              05  QBS047-JISHAINQRESULT           PIC  X(001).
              05  QBS047-BLACKINQREQ              PIC  X(001).
              05  QBS047-BLACKINQRESULT           PIC  X(001).
              05  QBS047-NGRIYU                   PIC  X(004).
              05  QBS047-RECORDKBN                PIC  X(001).
              05  QBS047-RECORDSKB1               PIC  X(001).
              05  QBS047-RENBAN1                  PIC  X(002).
              05  QBS047-RECORDSKB2               PIC  X(001).
              05  QBS047-RENBAN2                  PIC  X(002).
              05  QBS047-KAIIN                    PIC  X(009).
              05  QBS047-INQYMD                   PIC  X(007).
              05  QBS047-HOKBN                    PIC  X(001).
              05  QBS047-KYKBN                    PIC  X(002).
              05  QBS047-HINMEI                   PIC  X(003).
              05  QBS047-YUSHI                    PIC  X(006).
              05  QBS047-HARAI                    PIC  X(003).
              05  QBS047-INQMOTO                  PIC  X(002).
              05  QBS047-STRDATE                  PIC  X(019).
              05  QBS047-UPDDATE                  PIC  X(019).
              05  QBS047-DELDATE                  PIC  X(019).
              05  QBS047-OPID                     PIC  X(008).
              05  QBS047-WSID                     PIC  X(020).
