      *****************************************************************
      * Ž©ŽÐƒuƒ‰ƒbƒN
      *****************************************************************
              03  QBS017-DATA.
                  05  QBS017-TYPE                            PIC 9(2).
                  05  QBS017-KAIINJYOTAI.
                      07  QBS017-KAIINJYOTAIN                PIC N(4).
                  05  QBS017-BLACKNO                         PIC X(8).
                  05  QBS017-EIGYOTEN                        PIC X(2).
                  05  QBS017-KAKUTOKUTEN                     PIC X(2).
                  05  QBS017-BLKSTRDATE                      PIC 9(7).
                  05  QBS017-STRKBN                          PIC X(1).
                  05  QBS017-RIYU                            PIC X(2).
                  05  QBS017-RIYUTSUIKI.
                      07  QBS017-RIYUTSUIKIN                 PIC N(10).
                  05  QBS017-BLKUKETSUKENO                   PIC X(8).
                  05  QBS017-KAIINNO                         PIC 9(12).
                  05  QBS017-HONKNNAME                       PIC X(30).
                  05  QBS017-HONKJNAME.
                      07  QBS017-HONKJNAMEN                  PIC N(15).
                  05  QBS017-HONBIRETHDAY                    PIC 9(7).
                  05  QBS017-HONSEX                          PIC X(1).
                  05  QBS017-HONYUBINNO                      PIC X(5).
                  05  QBS017-HONYUBINYOBI                    PIC X(3).
                  05  QBS017-HONCHIBAN                       PIC X(3).
                  05  QBS017-HONTEL1                         PIC X(7).
                  05  QBS017-HONTEL2                         PIC X(4).
                  05  QBS017-HONTEL3                         PIC X(4).
                  05  QBS017-KINTEL1                         PIC X(7).
                  05  QBS017-KINTEL2                         PIC X(4).
                  05  QBS017-KINTEL3                         PIC X(4).
                  05  QBS017-HONJUSYOCD                      PIC 9(11).
                  05  QBS017-HONKNBANCHI                     PIC X(15).
                  05  QBS017-HONKNKATAGAKI                   PIC X(32).
                  05  QBS017-HONKJBANCHI.
                      07  QBS017-HONKJBANCHN                 PIC N(15).
                  05  QBS017-HONKJKATAGAKI.
                      07  QBS017-HONKJKATAGAKIN              PIC N(32).
                  05  QBS017-KINKINMUKBN                     PIC X(1).
                  05  QBS017-KINKNNAME                       PIC X(30).
                  05  QBS017-KINKJNAME.
                      07  QBS017-KINKJNAMEN                  PIC N(15).
                  05  QBS017-KINJOSHOCD                      PIC 9(11).
                  05  QBS017-KINKNBANCHI                     PIC X(15).
                  05  QBS017-KINKNKATAGAKI                   PIC X(32).
                  05  QBS017-KINKJBANCHI.
                      07  QBS017-KINKJBANCHIN                PIC N(15).
                  05  QBS017-KINKJKATAGAKI.
                      07  QBS017-KINKJKATAGAKIN              PIC N(32).
                  05  QBS017-CIFNO                           PIC X(8).
                  05  QBS017-CARDKBN                         PIC 9(6).
                  05  QBS017-CREDATE                         PIC 9(8).
                  05  QBS017-CRETIME                         PIC 9(6).
