      *****************************************************************
      * êMópè∆âÔóöó
      *****************************************************************
              03  QBS012-DATA.
                  05  QBS012-KAIIN                          PIC  X(09).
                  05  QBS012-INQYMD                         PIC  9(07).
                  05  QBS012-HOKBN                          PIC  X(01).
                  05  QBS012-KYKBN                          PIC  X(02).
                  05  QBS012-HINMEI                         PIC  X(03).
                  05  QBS012-YUSHI                          PIC  9(06).
                  05  QBS012-HARAI                          PIC  9(03).
                  05  QBS012-INQMOTO                        PIC  X(02).
                  05  FILLER                                PIC  X(20).
