      *****************************************************************
      * êMópå¬ï èÓïÒ
      *****************************************************************
              03  QBS010-DATA.
                  05  QBS010-KAIIN                          PIC  X(09).
                  05  QBS010-KYKNO                          PIC  X(20).
                  05  QBS010-JYMD                           PIC  9(7).
                  05  QBS010-JYOSYU                         PIC  X(02).
                  05  QBS010-RIYU                           PIC  X(02).
                  05  QBS010-KYMD                           PIC  9(7).
                  05  QBS010-KYKBN                          PIC  X(02).
                  05  QBS010-TANPO                          PIC  X(01).
                  05  QBS010-SYOHIN                         PIC  X(07).
                  05  QBS010-YUSHI                          PIC S9(06).
                  05  QBS010-HARAI                          PIC S9(03).
                  05  QBS010-ZANSAI                         PIC S9(06).
                  05  QBS010-ENTAI                          PIC  X(02).
                  05  QBS010-ENTAIDO                        PIC  X(02).
                  05  QBS010-SUMIYMD                        PIC  9(07).
                  05  QBS010-HOKBN                          PIC  X(01).
                  05  QBS010-HONEME                         PIC  X(30).
                  05  QBS010-TEKIYO                         PIC  X(20).
                  05  QBS010-SAIBAN                         PIC  X(20).
                  05  QBS010-JIKEN                          PIC  X(08).
                  05  QBS010-FNO                            PIC S9(03).
                  05  QBS010-FPAGE                          PIC  X(03).
                  05  QBS010-JYUNEN                         PIC  X(01).
                  05  QBS010-SYOKU                          PIC  X(01).
                  05  QBS010-KNMNAME                        PIC  X(30).
                  05  QBS010-KNMTEL                         PIC  X(14).
                  05  QBS010-KNMTELK                        PIC  X(01).
                  05  QBS010-KNMNEN                         PIC  X(02).
                  05  QBS010-NENSYU                         PIC  X(01).
                  05  QBS010-SYOTOKU1                       PIC  X(01).
                  05  QBS010-SYOTOKU2                       PIC  X(01).
                  05  QBS010-SYOTOKU3                       PIC  X(01).
                  05  QBS010-CMNT                           PIC  X(01).
                  05  QBS010-KNPCMNT                        PIC  X(01).
                  05  QBS010-TEISHI                         PIC  X(01).
                  05  QBS010-RIREKI                         PIC  X(12).
                  05  QBS010-RUISUU                         PIC  X(04).
                  05  QBS010-KSNYMD                         PIC  9(07).
                  05  QBS010-GYOSYU                         PIC  X(02).
                  05  QBS010-CMNTUMU                        PIC  X(01).
                  05  FILLER                                PIC  X(40).
                  05  QBS010-FUKCMNT                        PIC  X(100).
                  05  QBS010-KNMNAME2                       PIC  X(30).
                  05  QBS010-KNMTEL2                        PIC  X(14).
