      *****************************************************************
      * ê\çûèëñºäÒÇπÇs (QBS037)    ÉåÉRÅ[Éhí∑ÅFÇSÇOÇQÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS037-NAYOSET.
              05  QBS037-UKETSUKENO               PIC  X(008).
              05  QBS037-KANKEIKBN                PIC  X(001).
              05  QBS037-KAZOKURBN                PIC  X(001).
              05  QBS037-ICCHITYPE                PIC  X(002).
              05  QBS037-NAYOSENO                 PIC  X(008).
              05  QBS037-HONKNNAME                PIC  X(030).
              05  QBS037-HONKJNAME                PIC  X(030).
              05  QBS037-HONBIRTHDAY              PIC  X(019).
              05  QBS037-HONTEL1                  PIC  X(007).
              05  QBS037-HONTEL2                  PIC  X(004).
              05  QBS037-HONTEL3                  PIC  X(004).
              05  QBS037-HONJUSHOCD               PIC  X(011).
              05  QBS037-KINKNNAME                PIC  X(030).
              05  QBS037-KINKJNAME                PIC  X(060).
              05  QBS037-KINTEL1                  PIC  X(007).
              05  QBS037-KINTEL2                  PIC  X(004).
              05  QBS037-KINTEL3                  PIC  X(004).
              05  QBS037-BANKCD                   PIC  X(004).
              05  QBS037-SHITENCD                 PIC  X(003).
              05  QBS037-YOKINSBT                 PIC  X(001).
              05  QBS037-KOUZANO                  PIC  X(008).
              05  QBS037-KOUZANAME                PIC  X(030).
              05  QBS037-KJKOUZANAME              PIC  X(030).
              05  QBS037-TSUTYOKIGOU              PIC  X(003).
              05  QBS037-TSUTYONO                 PIC  X(008).
              05  QBS037-STRDATE                  PIC  X(019).
              05  QBS037-UPDDATE                  PIC  X(019).
              05  QBS037-DELDATE                  PIC  X(019).
              05  QBS037-OPID                     PIC  X(008).
              05  QBS037-WSID                     PIC  X(020).
