      *****************************************************************
      * í†ï[éwé¶ÇsçÏê¨àÀóäÇe (QBS026)
      *****************************************************************
            03  QBS026-UKETSUKENO                PIC  X(008).
            03  QBS026-FILLER                    PIC  X(042).
