      *****************************************************************
      * Ç`ÇdÇrìdéØèÓïÒÇs (QBS057)    ÉåÉRÅ[Éhí∑ÅFÇQÇQÇPÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS057-AESTELT.
              05  QBS057-SEQNO                    PIC  X(019).
              05  QBS057-UKETSUKENO               PIC  X(008).
              05  QBS057-KANKEIKBN                PIC  X(001).
              05  QBS057-KAZOKURBN                PIC  X(001).
              05  QBS057-ICCHITYPE                PIC  X(002).
              05  QBS057-KNSEI                    PIC  X(030).
              05  QBS057-KNMEI                    PIC  X(030).
              05  QBS057-BIRTHDAY                 PIC  X(008).
              05  QBS057-YUBINNO                  PIC  X(008).
              05  QBS057-CHIBAN                   PIC  X(003).
              05  QBS057-TEL1                     PIC  X(017).
              05  QBS057-JOUHODATE                PIC  X(008).
              05  QBS057-JOUHOGEN                 PIC  X(001).
              05  QBS057-STRDATE                  PIC  X(019).
              05  QBS057-UPDDATE                  PIC  X(019).
              05  QBS057-DELDATE                  PIC  X(019).
              05  QBS057-OPID                     PIC  X(008).
              05  QBS057-WSID                     PIC  X(020).
