      *****************************************************************
      * ë¶åàÉÅÉÇÇs (QBS063)    ÉåÉRÅ[Éhí∑ÅFÇUÇTÇUÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS063-SOKKMEMOT.
              05  QBS063-UKETSUKENO               PIC  X(008).
              05  QBS063-MAKEDATE                 PIC  X(019).
              05  QBS063-MEMOCD                   PIC  X(008).
              05  QBS063-KAIINNO                  PIC  X(016).
              05  QBS063-KESSAITANTOUSHA          PIC  X(008).
              05  QBS063-MEMO                     PIC  X(512).
              05  QBS063-STRDATE                  PIC  X(019).
              05  QBS063-UPDDATE                  PIC  X(019).
              05  QBS063-DELDATE                  PIC  X(019).
              05  QBS063-OPID                     PIC  X(008).
              05  QBS063-WSID                     PIC  X(020).
              