      *****************************************************************
      * êMópóﬁéóèÓïÒ
      *****************************************************************
              03  QBS013-DATA.
                  05  QBS013-TYPE                           PIC  X(02).
                  05  QBS013-NAME                           PIC  X(30).
                  05  QBS013-SYMD                           PIC  9(07).
                  05  QBS013-YUBIN                          PIC  9(05).
                  05  QBS013-CHIBAN                         PIC  X(03).
                  05  QBS013-ADD                            PIC  X(60).
                  05  QBS013-TEL                            PIC  X(14).
                  05  QBS013-TELKBN                         PIC  X(01).
                  05  QBS013-SEX                            PIC  X(01).
                  05  QBS013-HOJIN                          PIC  X(01).
                  05  QBS013-JYUKYO                         PIC  X(01).
                  05  QBS013-HAIGU                          PIC  X(01).
                  05  QBS013-JYMD                           PIC  9(07).
                  05  QBS013-JYOSYU                         PIC  X(02).
                  05  QBS013-RIYU                           PIC  X(02).
                  05  FILLER                                PIC  X(30).
