      *****************************************************************
      * CRóﬁéóèÓïÒ
      *****************************************************************
              03  QBS007-DATA.
                  05  QBS007-TYPE                            PIC X(02).
                  05  QBS007-KANANA                          PIC X(30).
                  05  QBS007-KANJINA                         PIC X(20).
                  05  QBS007-SYMD                            PIC 9(07).
                  05  QBS007-YUBIN                           PIC 9(05).
                  05  QBS007-CHIBAN                          PIC X(03).
                  05  QBS007-KANAADD                         PIC X(60).
                  05  QBS007-TEL                             PIC X(14).
                  05  QBS007-SAISHYMD                        PIC 9(07).
                  05  QBS007-SAISKNM                         PIC X(30).
                  05  FILLER                                 PIC X(10).
