      *****************************************************************
      * インターフェースヘッダー
      *****************************************************************
           03  QBS001-HEADER.
               05  QBS001-TABANO.
                   07  QBS001-TABAYYMM                PIC X(004).
                   07  QBS001-TABASAIBAN              PIC 9(002).
               05  QBS001-UKETSUKENO                  PIC 9(008).
               05  QBS001-INQKBN                      PIC X(001).
               05  QBS001-KAZOKURENBAN                PIC 9(001).
               05  QBS001-SAIREQKBN                   PIC X(001).
               05  QBS001-SAIREQCNT                   PIC 9(003).
               05  QBS001-CICINQREQ                   PIC X(001).
               05  QBS001-CICINQRESULT                PIC X(001).
               05  QBS001-JISHAINQREQ                 PIC X(001).
               05  QBS001-JISHAINQRESULT              PIC X(001).
               05  QBS001-BLACKREQ                    PIC X(001).
               05  QBS001-BLACKRESULT                 PIC X(001).
               05  QBS001-NGRIYUU                     PIC X(004).
               05  QBS001-RECORDKBN                   PIC X(001).
               05  QBS001-RECORDSKB1                  PIC X(001).
               05  QBS001-RENBAN1                     PIC 9(002).
               05  QBS001-RECORDSKB2                  PIC X(001).
               05  QBS001-RENBAN2                     PIC 9(002).
