      *****************************************************************
      * à”éuämÉÅÉÇÇs (QBS060)    ÉåÉRÅ[Éhí∑ÅFÇUÇUÇXÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS060-ISHIKAKUMEMOT.
              05  QBS060-UKETSUKENO               PIC  X(008).
              05  QBS060-MAKEDATE                 PIC  X(019).
              05  QBS060-MEMOCD                   PIC  X(008).
              05  QBS060-KAKUNINSAKI              PIC  X(001).
              05  QBS060-KAKAITEKBN               PIC  X(001).
              05  QBS060-KAKKEKKAKBN              PIC  X(001).
              05  QBS060-KAKDATE                  PIC  X(019).
              05  QBS060-KDNTEL1                  PIC  X(007).
              05  QBS060-KDNTEL2                  PIC  X(004).
              05  QBS060-KDNTEL3                  PIC  X(004).
              05  QBS060-MEMO                     PIC  X(512).
              05  QBS060-STRDATE                  PIC  X(019).
              05  QBS060-UPDDATE                  PIC  X(019).
              05  QBS060-DELDATE                  PIC  X(019).
              05  QBS060-OPID                     PIC  X(008).
              05  QBS060-WSID                     PIC  X(020).
              