      *****************************************************************
      * éËéÜÇsçÏê¨àÀóäÇe (QBS025)
      *****************************************************************
	    03  QBS025-LETTERID                   PIC  X(008).
	    03  QBS025-MAKEDATE                   PIC  9(008).
	    03  QBS025-UKETSUKENO                 PIC  9(008).
	    03  QBS025-YUBINNO                    PIC  X(007).
	    03  QBS025-JUSHO1                     PIC  N(025).
	    03  QBS025-JUSHO2                     PIC  N(015).
	    03  QBS025-JUSHO3                     PIC  N(032).
	    03  QBS025-KJNAME                     PIC  N(015).
	    03  QBS025-KINKJNAME                  PIC  N(030).
	    03  QBS025-TOUZAIKBN                  PIC  X(001).
	    03  QBS025-HASSOUYOTEIBI              PIC  X(008).
	    03  QBS025-HENKYAKUYOTEIDATE          PIC  X(008).
	    03  QBS025-HENKYAKUDATE               PIC  X(008).
	    03  QBS025-HENKYAKURIYUCD             PIC  X(002).
            03  QBS025-KAHENKOUMOKU               PIC  X(200).
            03  FILLER                            PIC  X(018).
