      *****************************************************************
      * ÉÅÉÇÇs (QBS058)    ÉåÉRÅ[Éhí∑ÅFÇPÇQÇQÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS058-MEMOT.
              05  QBS058-UKETSUKENO               PIC  X(008).
              05  QBS058-MAKEDATE                 PIC  X(019).
              05  QBS058-MEMOCD                   PIC  X(008).
              05  QBS058-TSUUCHIKBN               PIC  X(001).
              05  QBS058-RIREKIKBN                PIC  X(001).
              05  QBS058-USERNAME                 PIC  X(040).
              05  QBS058-STRDATE                  PIC  X(019).
              05  QBS058-UPDDATE                  PIC  X(019).
              05  QBS058-DELDATE                  PIC  X(019).
              05  QBS058-OPID                     PIC  X(008).
              05  QBS058-WSID                     PIC  X(020).
