      *****************************************************************
      * âÒìöèÓïÒÇs (QBS038)    ÉåÉRÅ[Éhí∑ÅFÇUÇUÇTÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS038-ANSWERT.
              05  QBS038-TABANO                   PIC  X(006).
              05  QBS038-UKETSUKENO               PIC  X(008).
              05  QBS038-INQKBN                   PIC  X(001).
              05  QBS038-KAZOKURENBAN             PIC  X(001).
              05  QBS038-SAIIRAIKBN               PIC  X(001).
              05  QBS038-SAIIRAICNT               PIC  X(003).
              05  QBS038-CICINQREQ                PIC  X(001).
              05  QBS038-CICINQRESULT             PIC  X(001).
              05  QBS038-JISHAINQREQ              PIC  X(001).
              05  QBS038-JISHAINQRESULT           PIC  X(001).
              05  QBS038-BLACKINQREQ              PIC  X(001).
              05  QBS038-BLACKINQRESULT           PIC  X(001).
              05  QBS038-NGRIYU                   PIC  X(004).
              05  QBS038-RECORDKBN                PIC  X(001).
              05  QBS038-RECORDSKB1               PIC  X(001).
              05  QBS038-RENBAN1                  PIC  X(002).
              05  QBS038-RECORDSKB2               PIC  X(001).
              05  QBS038-RENBAN2                  PIC  X(002).
              05  QBS038-INQNO                    PIC  X(006).
              05  QBS038-USER2                    PIC  X(010).
              05  QBS038-KWSID                    PIC  X(008).
              05  QBS038-USER                     PIC  X(019).
              05  QBS038-KAITO                    PIC  X(001).
              05  QBS038-MADCD                    PIC  X(003).
              05  QBS038-KIKAN                    PIC  X(002).
              05  QBS038-CICSRV                   PIC  X(002).
              05  QBS038-NETSRV                   PIC  X(002).
              05  QBS038-NAME                     PIC  X(030).
              05  QBS038-HJNAME                   PIC  X(030).
              05  QBS038-SYMD                     PIC  X(007).
              05  QBS038-YUBIN                    PIC  X(005).
              05  QBS038-TEL                      PIC  X(014).
              05  QBS038-TEL2                     PIC  X(014).
              05  QBS038-CHIBAN                   PIC  X(003).
              05  QBS038-HHOSYO                   PIC  X(001).
              05  QBS038-KYKBN                    PIC  X(002).
              05  QBS038-SHOHIN                   PIC  X(003).
              05  QBS038-YUSHI                    PIC  X(006).
              05  QBS038-HARAI                    PIC  X(003).
              05  QBS038-HJCODE                   PIC  X(010).
              05  QBS038-CHIIKI                   PIC  X(005).
              05  QBS038-CHOU                     PIC  X(011).
              05  QBS038-CHIG                     PIC  X(008).
              05  QBS038-HEYAG                    PIC  X(004).
              05  QBS038-MUNEG                    PIC  X(004).
              05  QBS038-DUMMY1                   PIC  X(003).
              05  QBS038-KAIIN                    PIC  X(006).
              05  QBS038-MISIYO                   PIC  X(003).
              05  QBS038-SEQNO                    PIC  X(018).
              05  QBS038-KYOKU1                   PIC  X(020).
              05  QBS038-KYOKU2                   PIC  X(020).
              05  QBS038-CHIKU                    PIC  X(020).
              05  QBS038-HH                       PIC  X(002).
              05  QBS038-MM                       PIC  X(002).
              05  QBS038-SS                       PIC  X(002).
              05  QBS038-ERR                      PIC  X(046).
              05  QBS038-SRERR                    PIC  X(020).
              05  QBS038-SRSBT                    PIC  X(002).
              05  QBS038-DUMMY3                   PIC  X(018).
              05  QBS038-DUMMY4                   PIC  X(040).
              05  QBS038-ANSFLG                   PIC  X(001).
              05  QBS038-KMSFLG                   PIC  X(001).
              05  QBS038-CREFLG                   PIC  X(001).
              05  QBS038-HOJFLG                   PIC  X(001).
              05  QBS038-KSCFLG                   PIC  X(001).
              05  QBS038-JICFLG                   PIC  X(001).
              05  QBS038-TELFLG                   PIC  X(001).
              05  QBS038-MAPFLG                   PIC  X(001).
              05  QBS038-DUMMY5                   PIC  X(004).
              05  QBS038-ANSSBT                   PIC  X(002).
              05  QBS038-KMSSBT                   PIC  X(002).
              05  QBS038-CRESBT                   PIC  X(002).
              05  QBS038-HOJSBT                   PIC  X(002).
              05  QBS038-KSCSBT                   PIC  X(002).
              05  QBS038-JICSBT                   PIC  X(002).
              05  QBS038-TELSBT                   PIC  X(002).
              05  QBS038-MAPSBT                   PIC  X(002).
              05  QBS038-DUMMY6                   PIC  X(008).
              05  QBS038-ANSIX                    PIC  X(006).
              05  QBS038-KMSIX                    PIC  X(006).
              05  QBS038-CREIX                    PIC  X(006).
              05  QBS038-HOJIX                    PIC  X(006).
              05  QBS038-KSCIX                    PIC  X(006).
              05  QBS038-JICIX                    PIC  X(006).
              05  QBS038-TELIX                    PIC  X(006).
              05  QBS038-MAPIX                    PIC  X(006).
              05  QBS038-DUMMY7                   PIC  X(024).
              05  QBS038-STRDATE                  PIC  X(019).
              05  QBS038-UPDDATE                  PIC  X(019).
              05  QBS038-DELDATE                  PIC  X(019).
              05  QBS038-OPID                     PIC  X(008).
              05  QBS038-WSID                     PIC  X(020).
