      *****************************************************************
      * é©é–É}ÉXÉ^
      *****************************************************************
              03  QBS016-DATA.
                  05  QBS016-TYPE                PIC 9(2).
                  05  QBS016-KAIINJYOTAI.
                      07  QBS016-KAIINJYOTAIN    PIC N(4).
                  05  QBS016-KAIINNO             PIC X(16).
                  05  QBS016-KNNAME              PIC X(20).
                  05  QBS016-BIRTHDAY            PIC 9(7).
                  05  QBS016-TEL1                PIC X(7).
                  05  QBS016-TEL2                PIC X(4).
                  05  QBS016-TEL3                PIC X(4).
                  05  QBS016-BANKCD              PIC X(4).
                  05  QBS016-BANKNAME.
                      07  QBS016-BANKNAMEN       PIC N(10).
                  05  QBS016-SHITENCD            PIC X(5).
                  05  QBS016-SHITENNAME.
                      07  QBS016-SHITENNAMEN     PIC N(10).
                  05  QBS016-YOKINSBT            PIC 9(1).
                  05  QBS016-KOUZABANGO          PIC 9(8).
                  05  QBS016-KOUZANAME           PIC X(30).
                  05  QBS016-JUSHOCD             PIC 9(11).
                  05  QBS016-POSSTATUS           PIC 9(2).
                  05  QBS016-DAIHYOSTATUS        PIC 9(4).
                  05  QBS016-CARDJYOKYO          PIC 9(4).
                  05  QBS016-CIFNO               PIC 9(8).
                  05  QBS016-SHOPPINGZANDAKA     PIC 9(11).
                  05  QBS016-CASHINGZANDAKA      PIC 9(11).
                  05  QBS016-AZUKARIKIN          PIC 9(11).
                  05  QBS016-RIYOUSHACD          PIC 9(1).
                  05  QBS016-CREDATE             PIC 9(8).
                  05  QBS016-CRETIME             PIC 9(6).
