      *****************************************************************
      * ê\çûèëâ∆ë∞Çs (QBS030)    ÉåÉRÅ[Éhí∑ÅFÇQÇSÇPÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS030-FAMILYT.
              05  QBS030-UKETSUKENO               PIC  X(008).
              05  QBS030-SEQ                      PIC  X(001).
              05  QBS030-KNNAME                   PIC  X(015).
              05  QBS030-KJNAME                   PIC  X(030).
              05  QBS030-RMNAME                   PIC  X(030).
              05  QBS030-BIRTHDAY                 PIC  X(019).
              05  QBS030-SEX                      PIC  X(001).
              05  QBS030-ZOKGR                    PIC  X(001).
              05  QBS030-HAKKENUMU                PIC  X(001).
              05  QBS030-PASSWORD                 PIC  X(004).
              05  QBS030-CIFNO                    PIC  X(008).
              05  QBS030-CICINQNO                 PIC  X(008).
              05  QBS030-CTLHONKNNAME             PIC  X(030).
              05  QBS030-STRDATE                  PIC  X(019).
              05  QBS030-UPDDATE                  PIC  X(019).
              05  QBS030-DELDATE                  PIC  X(019).
              05  QBS030-OPID                     PIC  X(008).
              05  QBS030-WSID                     PIC  X(020).
