      *****************************************************************
      * êMópè∆âÔèÓïÒ
      *****************************************************************
              03  QBS011-DATA.
                  05  QBS011-TYPE                           PIC  X(02).
                  05  QBS011-NAME                           PIC  X(30).
                  05  QBS011-SYMD                           PIC  9(07).
                  05  QBS011-YUBIN                          PIC  9(05).
                  05  QBS011-CHIBAN                         PIC  X(03).
                  05  QBS011-TEL1                           PIC  X(14).
                  05  QBS011-TEL2                           PIC  X(14).
                  05  FILLER                                PIC  X(6).
