      *****************************************************************
      * êeå†é“Å^ï€èÿêlÇs (QBS031)    ÉåÉRÅ[Éhí∑ÅFÇXÇSÇTÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS031-SHINKENSHAT.
              05  QBS031-UKETSUKENO               PIC  X(008).
              05  QBS031-SINKENSHAKBN             PIC  X(001).
              05  QBS031-KNNAME                   PIC  X(030).
              05  QBS031-KJNAME                   PIC  X(030).
              05  QBS031-BIRTHDAY                 PIC  X(019).
              05  QBS031-SEX                      PIC  X(001).
              05  QBS031-ZOKGR                    PIC  X(001).
              05  QBS031-CHIBAN                   PIC  X(003).
              05  QBS031-HONTEL1                  PIC  X(007).
              05  QBS031-HONTEL2                  PIC  X(004).
              05  QBS031-HONTEL3                  PIC  X(004).
              05  QBS031-HONJUSHOCD               PIC  X(011).
              05  QBS031-HONYUBINNO               PIC  X(007).
              05  QBS031-HONKNTODOFUKEN           PIC  X(008).
              05  QBS031-HONKNSHIKCHOSN           PIC  X(042).
              05  QBS031-HONKNBANCHI              PIC  X(015).
              05  QBS031-HONKNKATAGAKI            PIC  X(032).
              05  QBS031-HONKJJUSHO               PIC  X(050).
              05  QBS031-HONKJBANCHI              PIC  X(030).
              05  QBS031-HONKJKATAGAKI            PIC  X(064).
              05  QBS031-HONHAIGUUM               PIC  X(001).
              05  QBS031-HONCHILDSU               PIC  X(002).
              05  QBS031-HONDOKYOKBN              PIC  X(001).
              05  QBS031-HONSUMAIKBN              PIC  X(001).
              05  QBS031-HONSUMAINENSU            PIC  X(001).
              05  QBS031-KINKNNAME                PIC  X(030).
              05  QBS031-KINKJNAME                PIC  X(060).
              05  QBS031-KINTEL1                  PIC  X(007).
              05  QBS031-KINTEL2                  PIC  X(004).
              05  QBS031-KINTEL3                  PIC  X(004).
              05  QBS031-KINJUSHOCD               PIC  X(011).
              05  QBS031-KINYUBINNO               PIC  X(007).
              05  QBS031-KINKNTODOFUKEN           PIC  X(008).
              05  QBS031-KINKNSHIKCHOSN           PIC  X(042).
              05  QBS031-KINKNBANCHI              PIC  X(015).
              05  QBS031-KINKNKATAGAKI            PIC  X(032).
              05  QBS031-KINKJJUSHO               PIC  X(050).
              05  QBS031-KINKJBANCHI              PIC  X(030).
              05  QBS031-KINKJKATAGAKI            PIC  X(064).
              05  QBS031-NOCICINQNO               PIC  X(008).
              05  QBS031-KINNENSHUKBN             PIC  X(001).
              05  QBS031-KINSHOZOKUBUKA           PIC  X(030).
              05  QBS031-KINYAKUSHOKU             PIC  X(020).
              05  QBS031-KINSHIHONKG              PIC  X(001).
              05  QBS031-KINELSENENSHU            PIC  X(001).
              05  QBS031-KINJUGYOCNT              PIC  X(001).
              05  QBS031-SHINHISSUKBN             PIC  X(001).
              05  QBS031-CTLHONKNNAME             PIC  X(030).
              05  QBS031-CTLKINKNNAME             PIC  X(030).
              05  QBS031-STRDATE                  PIC  X(019).
              05  QBS031-UPDDATE                  PIC  X(019).
              05  QBS031-DELDATE                  PIC  X(019).
              05  QBS031-OPID                     PIC  X(008).
              05  QBS031-WSID                     PIC  X(020).
