      *****************************************************************
      * ‰ïˆõ“o˜^ˆË—Šƒf[ƒ^ (QBS065)    ƒŒƒR[ƒh’·F‚P‚V‚O‚O‚a‚™‚”‚…
      *****************************************************************
           03  QBS065-SEG.
             05  QBS065-A0010          PIC 9(006).         *>‘©”Ô†
             05  QBS065-A0020          PIC 9(008).         *>Žó•t”Ô†
             05  QBS065-A0030          PIC 9(002).         *>‰ïŽÐ“X
             05  QBS065-A0031          PIC 9(002).         *>ÂŒ ŠÇ—“X
             05  QBS065-A0032          PIC 9(002).         *>‰c‹Æ“X
             05  FILLER                PIC X(002).         *>DM“X
             05  QBS065-A0033          PIC 9(002).         *>Ž–‹Æ–{•”º°ÄÞ
             05  QBS065-A0040          PIC 9(002).         *>Šl“¾“X
             05  QBS065-A0050          PIC 9(006).         *>ƒJ[ƒh‹æ•ª
             05  QBS065-A0060          PIC 9(001).         *>•ÔÏ•û–@
             05  QBS065-A0070          PIC 9(004).         *>ˆÃØ”Ô†
             05  QBS065-A0080          PIC 9(007).         *>Žó•t“ú
             05  FILLER                PIC X(007).         *>ŒˆÏ“ú
             05  QBS065-A0100          PIC 9(009).         *>Šl“¾ƒ‹[ƒg
             05  QBS065-A0110          PIC 9(008).         *>Ð‰îŽÒƒR[ƒh
             05  QBS065-A0120          PIC X(001).         *>—^Mƒ‰ƒ“ƒN
             05  QBS065-A0130          PIC 9(005).         *>·¬¯¼Ý¸ÞŒÀ“xŠz
             05  FILLER                PIC X(008).         *>CIF”Ô†
             05  FILLER                PIC X(008).         *>CICÆ‰ï”Ô†
             05  QBS065-A0160          PIC X(016).         *>ŠO•”‰ïˆõ”Ô†
             05  QBS065-G0170.                             *>–{lî•ñ
               07  QBS065-T0170.                           *>Ž–¼
                 09  QBS065-A0170      PIC X(030).         *>ƒJƒi
                 09  QBS065-A0180      PIC X(030).         *>ƒ[ƒ}Žš
                 09  QBS065-A0190      PIC N(015).         *>Š¿Žš
               07  QBS065-A0200        PIC 9(007).         *>¶”NŒŽ“ú
               07  QBS065-A0210        PIC 9(001).         *>«•Ê
             05  QBS065-G0220.                             *>Ž©‘îî•ñ
               07  QBS065-T0220.                           *>‚s‚d‚k
                 09  QBS065-A0220      PIC X(007).         *>ŽsŠO‹Ç”Ô
                 09  QBS065-A0230      PIC X(004).         *>‹Ç”Ô
                 09  QBS065-A0240      PIC X(004).         *>”Ô†
               07  QBS065-T0250.                           *>ZŠ
                 09  QBS065-A0260      PIC 9(011).         *>ZŠƒR[ƒh
                 09  QBS065-A0270      PIC X(007).         *>—X•Ö”Ô†
                 09  QBS065-T0280.                         *>ƒJƒiZŠ
                   11  QBS065-A0280    PIC X(008).         *>Œ§–¼  ƒJƒi
                   11  QBS065-A0290    PIC X(042).         *>Žs‹æ’¬‘º  ƒJƒi
                   11  QBS065-A0300    PIC X(015).         *>”Ô’n  ƒJƒi
                   11  QBS065-A0310    PIC X(032).         *>•û‘  ƒJƒi
                 09  QBS065-T0320.                         *>Š¿ŽšZŠ
                   11  QBS065-A0320    PIC N(025).         *>ZŠ–¼  Š¿Žš
                   11  QBS065-A0330    PIC N(015).         *>”Ô’n’¬‘º  Š¿Žš
                   11  QBS065-A0340    PIC N(032).         *>•û‘  Š¿Žš
             05  QBS065-G0350.                             *>Ž©UŒûÀî•ñ
               07  QBS065-T0350.                           *>‹âsî•ñ
                 09  QBS065-A0350      PIC 9(004).         *>‹âsƒR[ƒh
                 09  QBS065-A0360      PIC N(010).         *>‹âs–¼
                 09  QBS065-A0370      PIC 9(005).         *>Žx“XƒR[ƒh
                 09  QBS065-A0380      PIC N(010).         *>Žx“X–¼
                 09  QBS065-A0390      PIC 9(001).         *>—a‹àŽí•Ê
                 09  QBS065-A0400      PIC 9(008).         *>ŒûÀ”Ô†
                 09  QBS065-A0410      PIC X(030).         *>ŒûÀ–¼‹`l
             05  QBS065-A0420          PIC 9(002).         *>ƒNƒ‰ƒuƒR[ƒh
             05  QBS065-G0430.                             *>‘—•tæ
               07  QBS065-A0430        PIC 9(001).         *>ƒJ[ƒh
               07  QBS065-A0440        PIC 9(001).         *>¿‹‘
             05  QBS065-G0450.                             *>ƒJ[ƒh”­s
               07  QBS065-A0450        PIC 9(001).         *>ƒJ[ƒh”­s‹æ•ª
               07  QBS065-A0460        PIC 9(001).         *>—X‘—‹æ•ª
             05  QBS065-G0470.                             *>ŒˆÏî•ñ
               07  QBS065-T0470.                           *>Ž©UŒˆÏî•ñ
                 09  FILLER            PIC X(001).         *>ŒˆÏŒ‹‰Ê
               07  QBS065-T0480.                           *>UžŒˆÏî•ñ
                 09  FILLER            PIC X(001).         *>ŒˆÏŒ‹‰Ê
             05  QBS065-G0490.                             *>ƒJ[ƒhXVŽwŽ¦‹æ•ª
               07  FILLER              PIC X(001).         *>Ž©“®R¸Œ‹‰Ê
               07  FILLER              PIC X(001).         *>lˆ×R¸Œ‹‰Ê
             05  QBS065-A0510          PIC X(006).         *>ˆµ•”‰ÛŒW
             05  QBS065-A0520          PIC X(001).         *>—X’™Ä”­s”
             05  QBS065-A0530          PIC 9(001).         *>•àˆø/Îß²ÝÄ‹æ•ª
             05  QBS065-A0540          PIC 9(001).         *>¶°ÄÞÌª²½‹æ•ª
             05  QBS065-A0550          PIC X(001).         *>’ñŒg‹æ•ª
             05  QBS065-A0560          PIC X(004).         *>••“üŽ¯•ÊƒR[ƒh
             05  QBS065-G0570.                             *>‹Î–±æî•ñ
               07  QBS065-A0570        PIC X(001).         *>‹Î–±æ‹æ•ª
               07  QBS065-T0580.                           *>–¼Ì
                 09  QBS065-A0580      PIC X(030).         *>–¼Ì  ƒJƒi
                 09  QBS065-A0590      PIC N(030).         *>–¼Ì  Š¿Žš
               07  QBS065-A0600        PIC N(015).         *>Š‘®•”‰Û
               07  QBS065-T0610.                           *>‚s‚d‚k
                 09  QBS065-A0610      PIC X(007).         *>ŽsŠO‹Ç”Ô
                 09  QBS065-A0620      PIC X(004).         *>‹Ç”Ô
                 09  QBS065-A0630      PIC X(004).         *>”Ô†
               07  QBS065-T0640.                           *>ZŠ
                 09  QBS065-A0640      PIC 9(011).         *>ZŠƒR[ƒh
                 09  QBS065-A0650      PIC X(008).         *>—X•Ö”Ô†
                 09  QBS065-T0660.                         *>ƒJƒiZŠ
                   11  QBS065-A0660    PIC X(008).         *>Œ§–¼  ƒJƒi
                   11  QBS065-A0670    PIC X(042).         *>Žs‹æ’¬‘º  ƒJƒi
                   11  QBS065-A0680    PIC X(015).         *>”Ô’n  ƒJƒi
                   11  QBS065-A0690    PIC X(032).         *>•û‘  ƒJƒi
                 09  QBS065-T0700.                         *>Š¿ŽšZŠ
                   11  QBS065-A0700    PIC N(025).         *>ZŠ–¼  Š¿Žš
                   11  QBS065-A0710    PIC N(015).         *>”Ô’n’¬‘º  Š¿Žš
                   11  QBS065-A0720    PIC N(032).         *>•û‘  Š¿Žš
             05  QBS065-G0730          OCCURS  5.          *>‰Æ‘°Šî–{î•ñ
               07  QBS065-A0730        PIC X(001).         *>Ý’è‹æ•ª
               07  QBS065-A0740        PIC 9(001).         *>Ž}”Ô
               07  QBS065-A0750        PIC 9(001).         *>—˜—pŽÒƒR[ƒh
               07  QBS065-A0760        PIC 9(007).         *>“ü‰ï”NŒŽ“ú
               07  QBS065-T0770.                           *>Ž–¼
                 09  QBS065-A0770      PIC X(015).         *>Ž–¼ƒJƒi
                 09  QBS065-A0780      PIC X(030).         *>Ž–¼ƒ[ƒ}Žš
                 09  QBS065-A0790      PIC N(015).         *>Ž–¼Š¿Žš
               07  QBS065-A0800        PIC 9(007).         *>¶”NŒŽ“ú
               07  QBS065-A0810        PIC 9(001).         *>«•Ê
               07  QBS065-A0820        PIC 9(001).         *>‘±•¿
               07  QBS065-A0830        PIC X(001).         *>”­Œ”—L–³
               07  QBS065-T0840.                           *>”Ô†î•ñ
                 09  FILLER            PIC X(008).         *>CIF”Ô†
               07  QBS065-A0850        PIC 9(004).         *>ˆÃØ”Ô†
               07  FILLER              PIC X(002).         *>¸×ÌÞº°ÄÞ
             05  FILLER                PIC X(125).
             05  QBS065-ERCD           PIC X(004).         *>´×°º°ÄÞ
             05  QBS065-ERMSG          PIC N(020).         *>´×°Ò¯¾°¼Þ
              