      *****************************************************************
      * ì¸óÕèÓïÒÉtÉ@ÉCÉã
      *****************************************************************
              03  QBS020-DATA.
                  05  QBS020-SEQNO                         PIC  X(19).
                  05  QBS020-UKETSUKENO                    PIC  X(08).
                  05  QBS020-KANKEIKBN                     PIC  X(01).
                  05  QBS020-KAZOKURBN                     PIC  9(01).
                  05  QBS020-TYPE                          PIC  X(02).
              03  QBS020-KOJININF.
                  05  QBS020-KNSEI                         PIC  X(30).
                  05  QBS020-KNMEI                         PIC  X(30).
                  05  QBS020-KJNAME                        PIC  N(30).
                  05  QBS020-TEL                           PIC  X(17).
                  05  QBS020-YUBINNO                       PIC  X(08).
                  05  QBS020-CHIBAN                        PIC  X(03).
                  05  QBS020-KNJUSHO1                      PIC  X(50).
                  05  QBS020-KNJUSHO2                      PIC  X(15).
                  05  QBS020-KNJUSHO3                      PIC  X(32).
                  05  QBS020-KJJUSHO1                      PIC  N(25).
                  05  QBS020-KJJUSHO2                      PIC  N(15).
                  05  QBS020-KJJUSHO3                      PIC  N(32).
                  05  QBS020-SUMAIKBN                      PIC  X(01).
                  05  QBS020-SUMAINENSU                    PIC  X(01).
                  05  QBS020-BIRTHDAY                      PIC  X(07).
                  05  QBS020-SEX                           PIC  X(01).
                  05  QBS020-HAIGUUMU                      PIC  X(01).
                  05  QBS020-CARDHAKKOKBN                  PIC  X(01).
              03  QBS020-KINMUINF.
                  05  QBS020-KNKINNAME                     PIC  X(30).
                  05  QBS020-KJKINNAME                     PIC  N(30).
                  05  QBS020-KINTEL                        PIC  X(17).
                  05  QBS020-KINYUBINNO                    PIC  X(08).
                  05  QBS020-KINCHIBAN                     PIC  X(03).
                  05  QBS020-KINKNJUSHO1                   PIC  X(50).
                  05  QBS020-KINKNJUSHO2                   PIC  X(15).
                  05  QBS020-KINKNJUSHO3                   PIC  X(32).
                  05  QBS020-KINKJJUSHO1                   PIC  N(25).
                  05  QBS020-KINKJJUSHO2                   PIC  N(15).
                  05  QBS020-KINKJJUSHO3                   PIC  N(32).
                  05  QBS020-SHOKUSHU                      PIC  X(01).
                  05  QBS020-KINMUKBN                      PIC  X(01).
                  05  QBS020-KINNENSUKBN                   PIC  X(01).
                  05  QBS020-KINNENSHUKBN                  PIC  X(01).
                  05  QBS020-KINSHUNYUGEN                  PIC  X(01).
                  05  QBS020-KINMAENENSUKBN                PIC  X(01).
              03  QBS020-SHOHININF.
                  05  QBS020-SHOHINCD                      PIC  X(03).
                  05  QBS020-SHOHINKNG                     PIC  9(06).
                  05  QBS020-ATAMAKNG                      PIC  9(06).
                  05  QBS020-SHIHARAISU                    PIC  9(03).
      *       1999/07/28 ADD
              03  QBS020-INQINF.
                  05  QBS020-CARDKBN                       PIC  X(06).
                  05  QBS020-MEMOUMU                       PIC  X(01).
                  05  QBS020-EIGYOTEN                      PIC  X(02).
                  05  QBS020-IMGDATE                       PIC  X(08).
              03  QBS020-KANRIINF.
                  05  QBS020-STRDATE                       PIC  9(08).
                  05  QBS020-UPDDATE                       PIC  9(08).
                  05  QBS020-DELDATE                       PIC  9(08).
                  05  QBS020-OPID                          PIC  X(08).
                  05  QBS020-WSID                          PIC  X(20).
