      *****************************************************************
      * ‚b‚qŠî–{
      *****************************************************************
              03  QBS004-DATA.
                  05  QBS004-IDXNO                          PIC  9(06).
                  05  QBS004-INQNO                          PIC  9(06).
                  05  QBS004-SEQNO                          PIC  9(18).
                  05  QBS004-DTSBT                          PIC  X(02).
                  05  QBS004-CREDT                          PIC  9(03).
                  05  QBS004-KOBET1                         PIC  9(03).
                  05  QBS004-KOBET2                         PIC  9(03).
                  05  QBS004-KOBET3                         PIC  9(03).
                  05  QBS004-KOBET4                         PIC  9(03).
                  05  QBS004-KOBET5                         PIC  9(03).
                  05  QBS004-KOBET6                         PIC  9(03).
                  05  QBS004-KOBET7                         PIC  9(03).
                  05  QBS004-KOBET8                         PIC  9(03).
                  05  QBS004-KOBET9                         PIC  9(03).
                  05  QBS004-KOBET10                        PIC  9(03).
                  05  QBS004-RUIJI                          PIC  9(03).
