      *****************************************************************
      * ブラックファイル(QBS024)  レコード長：６７０Ｂｙｔｅ
      *****************************************************************
           03  QBS024-SEG.                                *>
             05  QBS024-G0010.                            *>
               07  QBS024-A0010        PIC 9(008).        *>ブラックＮＯ
             05  QBS024-G0020.                            *>店
               07  QBS024-A0020        PIC 9(002).        *>営業店コード
               07  QBS024-A0030        PIC 9(002).        *>獲得店
             05  QBS024-A0040          PIC 9(008) COMP-3. *>登録日
             05  QBS024-A0050          PIC 9(001).        *>登録区分
             05  QBS024-A0060          PIC 9(002).        *>ブラック理由
             05  QBS024-A0070          PIC N(010).        *>ブラック理由（追記）
             05  QBS024-A0080          PIC 9(008).        *>受付番号
             05  QBS024-A0090          PIC 9(012).        *>会員番号
             05  QBS024-A0100          PIC X(030).        *>カナ氏名（法人名）
             05  QBS024-A0110          PIC N(015).        *>漢字氏名（法人名）
             05  QBS024-A0120          PIC 9(008) COMP-3. *>生年月日
             05  QBS024-A0130          PIC 9(001).        *>性別
             05  QBS024-A0140          PIC X(005).        *>郵便番号
             05  QBS024-A0150          PIC X(003).        *>郵便番号予備
             05  QBS024-A0160          PIC X(003).        *>地番
             05  QBS024-G0170.                            *>ＴＥＬ
               07  QBS024-T0170.                          *>自宅／法人
                 09  QBS024-A0170      PIC X(007).        *>市外局番
                 09  QBS024-A0180      PIC X(004).        *>局番
                 09  QBS024-A0190      PIC X(004).        *>番号
               07  QBS024-T0200.                          *>勤務先
                 09  QBS024-A0200      PIC X(007).        *>市外局番
                 09  QBS024-A0210      PIC X(004).        *>局番
                 09  QBS024-A0220      PIC X(004).        *>番号
             05  QBS024-G0230.                            *>住所
               07  QBS024-T0230.                          *>自宅／法人
                 09  QBS024-A0230      PIC 9(011).        *>住所コード
                 09  QBS024-A0240      PIC X(015).        *>番地　カナ
                 09  QBS024-A0250      PIC X(032).        *>方書　カナ
                 09  QBS024-A0260      PIC N(015).        *>番地　漢字
                 09  QBS024-A0270      PIC N(032).        *>方書　漢字
               07  QBS024-T0280.                          *>勤務先
                 09  QBS024-A0280      PIC 9(001).        *>勤務先区分
                 09  QBS024-A0290      PIC X(030).        *>名称　カナ
                 09  QBS024-A0300      PIC N(015).        *>名称　漢字
                 09  QBS024-A0310      PIC 9(011).        *>住所コード
                 09  QBS024-A0320      PIC X(015).        *>番地　カナ
                 09  QBS024-A0330      PIC X(032).        *>方書　カナ
                 09  QBS024-A0340      PIC N(015).        *>番地　漢字
                 09  QBS024-A0350      PIC N(032).        *>方書　漢字
               07  QBS024-A0360        PIC 9(008).        *>ＣＩＦ　Ｎｏ
             05  QBS024-A0370          PIC 9(006).        *>カード区分
             05  QBS024-G0380.                            *>コンデンス
               07  QBS024-A0380        PIC X(030).        *>コンデンスカナ氏名
               07  QBS024-A0390        PIC X(030).        *>コンデンス勤務先名
               07  QBS024-A0400        PIC X(014).        *>コンデンス自宅ＴＥＬ
               07  QBS024-A0410        PIC X(014).        *>コンデンス勤務先ＴＥＬ
             05  FILLER                PIC X(036).        *>予備
