      *****************************************************************
      * êRç∏óöóÉeÅ[ÉuÉã (QBS066)    ÉåÉRÅ[Éhí∑ÅFÇPÇVÇQÇaÇôÇîÇÖ
      *****************************************************************
           03  QBS066-SEG.
              05  QBS066-UKETSUKENO              PIC  X(008).
              05  QBS066-KANKEIKBN               PIC  X(001).
              05  QBS066-KAZOKURBN               PIC  X(001).
              05  QBS066-SHINSACD                PIC  X(004).
              05  QBS066-HONKBN                  PIC  X(001).
              05  QBS066-PARM1                   PIC  X(009).
              05  QBS066-PARM2                   PIC  X(009).
              05  QBS066-JUDGE                   PIC  X(100).
              05  QBS066-RESULTCD                PIC  X(001).
              05  QBS066-STRDATE                 PIC  X(019).
              05  QBS066-UPDDATE                 PIC  X(019).
