      *****************************************************************
      * ÉÜÅ[ÉUÉçÉMÉìÉOÉtÉ@ÉCÉã (QBS019)    ÇWÇOÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS019-SEG.
              05  QBS019-G0010.
                07  QBS019-A0010                 PIC  9(004).
                07  QBS019-A0020                 PIC  9(004).
              05  QBS019-G0030.
                07  QBS019-T0030.
                  09  QBS019-A0030               PIC  X(008).
                  09  QBS019-A0040               PIC  X(001).
                07  QBS019-T0050.
                  09  QBS019-A0050               PIC  X(004).
                  09  QBS019-A0060               PIC  X(002).
                  09  QBS019-A0070               PIC  X(002).
                07  QBS019-T0080.
                  09  QBS019-A0080               PIC  X(007).
                07  QBS019-T0090.
                  09  QBS019-S0090.
                    11  QBS019-A0090             PIC  X(001).
                    11  QBS019-A0100             PIC  X(001).
                    11  QBS019-A0110             PIC  X(001).
                    11  QBS019-A0120             PIC  X(002).
                    11  QBS019-A0130             PIC  X(002).
                    11  QBS019-A0140             PIC  X(001).
                  09  QBS019-A0150               PIC  9(001).
                07  QBS019-T0160.
                  09  QBS019-A0160               PIC  9(008).
                  09  QBS019-A0170               PIC  9(001).
                  09  QBS019-A0180               PIC  9(008).
                07  QBS019-A0190                 PIC  9(001).
                07  QBS019-T0200.
                  09  QBS019-A0200               PIC  X(001).
                  09  QBS019-A0210               PIC  9(002).
              05  QBS019-A0220                   PIC  X(006).
              05  QBS019-A0230                   PIC  9(001).
              05  QBS019-A0240                   PIC  9(001).
              05  QBS019-A0250                   PIC  9(001).
              05  QBS019-A0260                   PIC  9(001).
              05  FILLER                         PIC  X(008).
