      *****************************************************************
      * êMópäÓñ{
      *****************************************************************
              03  QBS008-DATA.
                  05  QBS008-IDXNO                          PIC X(6).
                  05  QBS008-INQNO                          PIC X(6).
                  05  QBS008-SEQNO                          PIC X(18).
                  05  QBS008-SINYOCNT.
                      07  QBS008-DTSBT                      PIC  X(02).
                      07  QBS008-CRE1                       PIC  9(03).
                      07  QBS008-CRE21                      PIC  9(03).
                      07  QBS008-CRE22                      PIC  9(03).
                      07  QBS008-CRE23                      PIC  9(03).
                      07  QBS008-CRE24                      PIC  9(03).
                      07  QBS008-CRE25                      PIC  9(03).
                      07  QBS008-CRE26                      PIC  9(03).
                      07  QBS008-CRE27                      PIC  9(03).
                      07  QBS008-CRE28                      PIC  9(03).
                      07  QBS008-CRE29                      PIC  9(03).
                      07  QBS008-CRE210                     PIC  9(03).
                  05  QBS008-SHOKAICNT.
                      07  QBS008-INQ1                       PIC  9(03).
                      07  QBS008-INQ21                      PIC  9(03).
                      07  QBS008-INQ22                      PIC  9(03).
                      07  QBS008-INQ23                      PIC  9(03).
                      07  QBS008-INQ24                      PIC  9(03).
                      07  QBS008-INQ25                      PIC  9(03).
                      07  QBS008-INQ26                      PIC  9(03).
                      07  QBS008-INQ27                      PIC  9(03).
                      07  QBS008-INQ28                      PIC  9(03).
                      07  QBS008-INQ29                      PIC  9(03).
                      07  QBS008-INQ210                     PIC  9(03).
                      07  QBS008-RUIJI                      PIC  9(03).
                      07  QBS008-TELS1                      PIC  9(03).
                      07  QBS008-TELS2                      PIC  9(03).
                      07  QBS008-RUIMEI                     PIC  9(03).
