      *****************************************************************
      * Ç`ÇdÇrå≈óLèÓïÒÇs (QBS054)    ÉåÉRÅ[Éhí∑ÅFÇUÇOÇVÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS054-AESSUMMT.
              05  QBS054-SEQNO              PIC  X(019).
              05  QBS054-UKETSUKENO         PIC  X(008).
              05  QBS054-KANKEIKBN          PIC  X(001).
              05  QBS054-KAZOKURBN          PIC  X(001).
              05  QBS054-SOUZANSAI          PIC  X(006).
              05  QBS054-SOUSHOPPING        PIC  X(006).
              05  QBS054-SOUCASHING         PIC  X(006).
              05  QBS054-SOUJUUTAKU         PIC  X(006).
              05  QBS054-SOUSEIKYU          PIC  X(006).
              05  QBS054-SOUBANKZAN         PIC  X(006).
              05  QBS054-SOUMUTANPOZAN      PIC  X(006).
              05  QBS054-SOUYUUTANPOZAN     PIC  X(006).
              05  QBS054-SOUSHIHARAIGAKU    PIC  X(006).
              05  QBS054-CRFILEUM           PIC  X(001).
              05  QBS054-SOUKOBETUCNT       PIC  X(003).
              05  QBS054-SOUJIKKOUCNT       PIC  X(003).
              05  QBS054-JIKKOU01YCNT       PIC  X(003).
              05  QBS054-JIKKOU06MCNT       PIC  X(003).
              05  QBS054-SOUIDOU01CNT       PIC  X(003).
              05  QBS054-SOUIDOU02CNT       PIC  X(003).
              05  QBS054-SOUINQCNT          PIC  X(003).
              05  QBS054-INQ03DCNT          PIC  X(003).
              05  QBS054-INQ01WCNT          PIC  X(003).
              05  QBS054-INQ01MCNT          PIC  X(003).
              05  QBS054-INQ06MCNT          PIC  X(003).
              05  QBS054-SHIRYOCNT          PIC  X(003).
              05  QBS054-SONOTASHIRYO       PIC  X(003).
              05  QBS054-MINYUDBLCNT        PIC  X(003).
              05  QBS054-OKURENYUKIN        PIC  X(003).
              05  QBS054-HONIDOUACNTZ       PIC  X(002).
              05  QBS054-HONIDOUPCNTZ       PIC  X(002).
              05  QBS054-HONIDOUQCNTZ       PIC  X(002).
              05  QBS054-HONIDOURCNTZ       PIC  X(002).
              05  QBS054-HONIDOUDLCNTZ      PIC  X(002).
              05  QBS054-HONSOUIDOCNTZ      PIC  X(002).
              05  QBS054-HONIDOUACNTJ       PIC  X(002).
              05  QBS054-HONIDOUPCNTJ       PIC  X(002).
              05  QBS054-HONIDOUQCNTJ       PIC  X(002).
              05  QBS054-HONIDOURCNTJ       PIC  X(002).
              05  QBS054-HONIDOUDLCNTJ      PIC  X(002).
              05  QBS054-HONSOUIDOCNTJ      PIC  X(002).
              05  QBS054-KOUIDOUACNTZ       PIC  X(002).
              05  QBS054-KOUIDOUPCNTZ       PIC  X(002).
              05  QBS054-KOUIDOUQCNTZ       PIC  X(002).
              05  QBS054-KOUIDOURCNTZ       PIC  X(002).
              05  QBS054-KOUIDOUDLCNTZ      PIC  X(002).
              05  QBS054-KOUSOUIDOCNTZ      PIC  X(002).
              05  QBS054-KOUIDOUACNTJ       PIC  X(002).
              05  QBS054-KOUIDOUPCNTJ       PIC  X(002).
              05  QBS054-KOUIDOUQCNTJ       PIC  X(002).
              05  QBS054-KOUIDOURCNTJ       PIC  X(002).
              05  QBS054-KOUIDOUDLCNTJ      PIC  X(002).
              05  QBS054-KOUSOUIDOCNTJ      PIC  X(002).
              05  QBS054-HON24MRCNTAZ       PIC  X(002).
              05  QBS054-HON24MRCNTPZ       PIC  X(002).
              05  QBS054-HON24MRCNTQZ       PIC  X(002).
              05  QBS054-HON24MRCNTRZ       PIC  X(002).
              05  QBS054-HON24MRCNTDLZ      PIC  X(002).
              05  QBS054-HON24MRCNTAJ       PIC  X(002).
              05  QBS054-HON24MRCNTPJ       PIC  X(002).
              05  QBS054-HON24MRCNTQJ       PIC  X(002).
              05  QBS054-HON24MRCNTRJ       PIC  X(002).
              05  QBS054-HON24MRCNTDLJ      PIC  X(002).
              05  QBS054-KOU24MRCNTAZ       PIC  X(002).
              05  QBS054-KOU24MRCNTPZ       PIC  X(002).
              05  QBS054-KOU24MRCNTQZ       PIC  X(002).
              05  QBS054-KOU24MRCNTRZ       PIC  X(002).
              05  QBS054-KOU24MRCNTDLZ      PIC  X(002).
              05  QBS054-KOU24MRCNTAJ       PIC  X(002).
              05  QBS054-KOU24MRCNTPJ       PIC  X(002).
              05  QBS054-KOU24MRCNTQJ       PIC  X(002).
              05  QBS054-KOU24MRCNTRJ       PIC  X(002).
              05  QBS054-KOU24MRCNTDLJ      PIC  X(002).
              05  QBS054-SOUGOKEIAPRQDL     PIC  X(002).
              05  QBS054-HOSHORIKOCNT       PIC  X(003).
              05  QBS054-MINYUCNT           PIC  X(003).
              05  QBS054-SYOMINYUCNT        PIC  X(003).
              05  QBS054-ZANNASICNT         PIC  X(003).
              05  QBS054-MINYUSTRCNT        PIC  X(003).
              05  QBS054-ENTAICNT           PIC  X(003).
              05  QBS054-HARAINASICNT       PIC  X(003).
              05  QBS054-NMLNYUKINCNT       PIC  X(003).
              05  QBS054-SOUNEARAPCNT       PIC  X(003).
              05  QBS054-SONOTACNT          PIC  X(003).
              05  QBS054-INQKANKINCNT       PIC  X(003).
              05  QBS054-STABANKZANSAI      PIC  X(006).
              05  QBS054-MAXBANKZANSAI      PIC  X(006).
              05  QBS054-STASEIKYU          PIC  X(006).
              05  QBS054-MAXSEIKYU          PIC  X(006).
              05  QBS054-STASHIHARAI        PIC  X(006).
              05  QBS054-MAXSHIHARAI        PIC  X(006).
              05  QBS054-SYUNYUGEN          PIC  X(001).
              05  QBS054-NENSYU             PIC  X(006).
              05  QBS054-SUITEINENSYU       PIC  X(006).
              05  QBS054-SINSASETTOKBN      PIC  X(001).
              05  QBS054-SOUZANSAIHI        PIC  X(003).
              05  QBS054-NYUAGANYURITU      PIC  X(003).
              05  QBS054-NYUADLHIRITU       PIC  X(003).
              05  QBS054-DENSIKICNT         PIC  X(003).
              05  QBS054-TANINDOUUMU        PIC  X(001).
              05  QBS054-ZENKYOJYOUMU       PIC  X(001).
              05  QBS054-SEHONCRKOBETU      PIC  X(003).
              05  QBS054-SEKOUCRKOBETU      PIC  X(003).
              05  QBS054-SEHONSEIZYO1Y      PIC  X(003).
              05  QBS054-SEKOUSEIZYO1Y      PIC  X(003).
              05  QBS054-SEHONSEIZYO6M      PIC  X(003).
              05  QBS054-SEKOUSEIZYO6M      PIC  X(003).
              05  QBS054-SEHONSOUZAN        PIC  X(006).
              05  QBS054-SEHONSOUZANHI      PIC  X(003).
              05  QBS054-SEKOUSOUZANHI      PIC  X(003).
              05  QBS054-SEHONNYUZYORE      PIC  X(002).
              05  QBS054-SEKOUNYUZYORE      PIC  X(002).
              05  QBS054-SEHONSOUZYOU       PIC  X(002).
              05  QBS054-SEKOUSOUZYOU       PIC  X(002).
              05  QBS054-SEHONZYOUKEI       PIC  X(003).
              05  QBS054-SEKOUZYOUKEI       PIC  X(003).
              05  QBS054-SEHONINQ1M         PIC  X(003).
              05  QBS054-SEKOUINQ1M         PIC  X(003).
              05  QBS054-SEHONINQ6M         PIC  X(003).
              05  QBS054-SEKOUINQ6M         PIC  X(003).
              05  QBS054-SEHONSOUINQ        PIC  X(003).
              05  QBS054-SEKOUSOUINQ        PIC  X(003).
              05  QBS054-KEKSIKECD          PIC  X(001).
              05  QBS054-KEKKAKUCHI         PIC  X(003).
              05  QBS054-KEKRUMEI           PIC  X(008).
              05  QBS054-KEKRICD            PIC  X(003).
              05  QBS054-KEKTAICD           PIC  X(003).
              05  QBS054-CICSIKECD          PIC  X(001).
              05  QBS054-CICKAKUCHI         PIC  X(003).
              05  QBS054-CICRUMEI           PIC  X(008).
              05  QBS054-CICRICD            PIC  X(003).
              05  QBS054-CICTAICD           PIC  X(003).
              05  QBS054-SINSIKECD          PIC  X(001).
              05  QBS054-SINKAKUCHI         PIC  X(003).
              05  QBS054-SINRUMEI           PIC  X(008).
              05  QBS054-SINRICD            PIC  X(003).
              05  QBS054-SINTAICD           PIC  X(003).
              05  QBS054-ZANSIKECD          PIC  X(001).
              05  QBS054-ZANKAKUCHI         PIC  X(003).
              05  QBS054-ZANRUMEI           PIC  X(008).
              05  QBS054-ZANRICD            PIC  X(003).
              05  QBS054-ZANTAICD           PIC  X(003).
              05  QBS054-NYUSIKECD          PIC  X(001).
              05  QBS054-NYUKAKUCHI         PIC  X(003).
              05  QBS054-NYURUMEI           PIC  X(008).
              05  QBS054-NYURICD            PIC  X(003).
              05  QBS054-NYUTAICD           PIC  X(003).
              05  QBS054-DENSIKECD          PIC  X(001).
              05  QBS054-DENKAKUCHI         PIC  X(003).
              05  QBS054-DENRUMEI           PIC  X(008).
              05  QBS054-DENRICD            PIC  X(003).
              05  QBS054-DENTAICD           PIC  X(003).
              05  QBS054-KYOIKECD           PIC  X(001).
              05  QBS054-KYOKAKUCHI         PIC  X(003).
              05  QBS054-KYORUMEI           PIC  X(008).
              05  QBS054-KYORICD            PIC  X(003).
              05  QBS054-KYOTAICD           PIC  X(003).
              05  QBS054-KINSIKECD          PIC  X(001).
              05  QBS054-KINKAKUCHI         PIC  X(003).
              05  QBS054-KINRUMEI           PIC  X(008).
              05  QBS054-KINRICD            PIC  X(003).
              05  QBS054-KINTAICD           PIC  X(003).
              05  QBS054-STRDATE            PIC  X(019).
              05  QBS054-UPDDATE            PIC  X(019).
              05  QBS054-DELDATE            PIC  X(019).
              05  QBS054-OPID               PIC  X(008).
              05  QBS054-WSID               PIC  X(020).

