      *****************************************************************
      * êRç∏èÓïÒÉÅÉÇÇs (QBS061)    ÉåÉRÅ[Éhí∑ÅFÇUÇRÇTÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS061-SHINSAMEMOT.
              05  QBS061-UKETSUKENO               PIC  X(008).
              05  QBS061-MAKEDATE                 PIC  X(019).
              05  QBS061-MEMOCD                   PIC  X(008).
              05  QBS061-KINYUMOJIBISHU           PIC  X(001).
              05  QBS061-INKANDAISHO              PIC  X(001).
              05  QBS061-TELOUTAIINSHO            PIC  X(001).
              05  QBS061-MEMO                     PIC  X(512).
              05  QBS061-STRDATE                  PIC  X(019).
              05  QBS061-UPDDATE                  PIC  X(019).
              05  QBS061-DELDATE                  PIC  X(019).
              05  QBS061-OPID                     PIC  X(008).
              05  QBS061-WSID                     PIC  X(020).
              