      *****************************************************************
      * êMópå¬ï èÓïÒÇs (QBS045)    ÉåÉRÅ[Éhí∑ÅFÇTÇPÇUÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS045-SNKOBETSUT.
              05  QBS045-TABANO                   PIC  X(006).
              05  QBS045-UKETSUKENO               PIC  X(008).
              05  QBS045-INQKBN                   PIC  X(001).
              05  QBS045-KAZOKURENBAN             PIC  X(001).
              05  QBS045-SAIIRAIKBN               PIC  X(001).
              05  QBS045-SAIIRAICNT               PIC  X(003).
              05  QBS045-CICINQREQ                PIC  X(001).
              05  QBS045-CICINQRESULT             PIC  X(001).
              05  QBS045-JISHAINQREQ              PIC  X(001).
              05  QBS045-JISHAINQRESULT           PIC  X(001).
              05  QBS045-BLACKINQREQ              PIC  X(001).
              05  QBS045-BLACKINQRESULT           PIC  X(001).
              05  QBS045-NGRIYU                   PIC  X(004).
              05  QBS045-RECORDKBN                PIC  X(001).
              05  QBS045-RECORDSKB1               PIC  X(001).
              05  QBS045-RENBAN1                  PIC  X(002).
              05  QBS045-RECORDSKB2               PIC  X(001).
              05  QBS045-RENBAN2                  PIC  X(002).
              05  QBS045-KAIIN                    PIC  X(009).
              05  QBS045-KYKNO                    PIC  X(020).
              05  QBS045-JYMD                     PIC  X(007).
              05  QBS045-JYOSYU                   PIC  X(002).
              05  QBS045-RIYU                     PIC  X(002).
              05  QBS045-KYMD                     PIC  X(007).
              05  QBS045-KYKBN                    PIC  X(002).
              05  QBS045-TANPO                    PIC  X(001).
              05  QBS045-SYOHIN                   PIC  X(007).
              05  QBS045-YUSHI                    PIC  X(006).
              05  QBS045-HARAI                    PIC  X(003).
              05  QBS045-ZANSAI                   PIC  X(006).
              05  QBS045-ENTAI                    PIC  X(002).
              05  QBS045-ENTAIDO                  PIC  X(002).
              05  QBS045-SUMIYMD                  PIC  X(007).
              05  QBS045-HOKBN                    PIC  X(001).
              05  QBS045-HONEME                   PIC  X(030).
              05  QBS045-TEKIYO                   PIC  X(020).
              05  QBS045-SAIBAN                   PIC  X(020).
              05  QBS045-JIKEN                    PIC  X(008).
              05  QBS045-FNO                      PIC  X(003).
              05  QBS045-FPAGE                    PIC  X(003).
              05  QBS045-JYUNEN                   PIC  X(001).
              05  QBS045-SYOKU                    PIC  X(001).
              05  QBS045-KNMNAME                  PIC  X(030).
              05  QBS045-KNMTEL                   PIC  X(014).
              05  QBS045-KNMTELK                  PIC  X(001).
              05  QBS045-KNMNEN                   PIC  X(002).
              05  QBS045-NENSYU                   PIC  X(001).
              05  QBS045-SYOTOKU1                 PIC  X(001).
              05  QBS045-SYOTOKU2                 PIC  X(001).
              05  QBS045-SYOTOKU3                 PIC  X(001).
              05  QBS045-CMNT                     PIC  X(001).
              05  QBS045-KNPCMNT                  PIC  X(001).
              05  QBS045-TEISHI                   PIC  X(001).
              05  QBS045-RIREKI                   PIC  X(012).
              05  QBS045-RUISUU                   PIC  X(004).
              05  QBS045-KSNYMD                   PIC  X(007).
              05  QBS045-GYOSYU                   PIC  X(002).
              05  QBS045-CMNTUMU                  PIC  X(001).
              05  QBS045-FUKCMNT                  PIC  X(100).
              05  QBS045-KNMNAME2                 PIC  X(030).
              05  QBS045-KNMTEL2                  PIC  X(014).
              05  QBS045-STRDATE                  PIC  X(019).
              05  QBS045-UPDDATE                  PIC  X(019).
              05  QBS045-DELDATE                  PIC  X(019).
              05  QBS045-OPID                     PIC  X(008).
              05  QBS045-WSID                     PIC  X(020).
