      *****************************************************************
      * é©é–ÉuÉâÉbÉNÇs (QBS053)    ÉåÉRÅ[Éhí∑ÅFÇVÇOÇUÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS053-JISHABLKT.
              05  QBS053-TABANO                   PIC  X(006).
              05  QBS053-UKETSUKENO               PIC  X(008).
              05  QBS053-INQKBN                   PIC  X(001).
              05  QBS053-KAZOKURENBAN             PIC  X(001).
              05  QBS053-SAIIRAIKBN               PIC  X(001).
              05  QBS053-SAIIRAICNT               PIC  X(003).
              05  QBS053-CICINQREQ                PIC  X(001).
              05  QBS053-CICINQRESULT             PIC  X(001).
              05  QBS053-JISHAINQREQ              PIC  X(001).
              05  QBS053-JISHAINQRESULT           PIC  X(001).
              05  QBS053-BLACKINQREQ              PIC  X(001).
              05  QBS053-BLACKINQRESULT           PIC  X(001).
              05  QBS053-NGRIYU                   PIC  X(004).
              05  QBS053-RECORDKBN                PIC  X(001).
              05  QBS053-RECORDSKB1               PIC  X(001).
              05  QBS053-RENBAN1                  PIC  X(002).
              05  QBS053-RECORDSKB2               PIC  X(001).
              05  QBS053-RENBAN2                  PIC  X(002).
              05  QBS053-TYPE                     PIC  X(002).
              05  QBS053-KAIINJYOTAI              PIC  X(008).
              05  QBS053-BLACKNO                  PIC  X(008).
              05  QBS053-EIGYOTEN                 PIC  X(002).
              05  QBS053-KAKUTOKUTEN              PIC  X(002).
              05  QBS053-BLKSTRDATE               PIC  X(019).
              05  QBS053-STRKBN                   PIC  X(001).
              05  QBS053-RIYU                     PIC  X(002).
              05  QBS053-RIYUTSUIKI               PIC  X(020).
              05  QBS053-BLKUKETSUKENO            PIC  X(008).
              05  QBS053-KAIINNO                  PIC  X(012).
              05  QBS053-HONKNNAME                PIC  X(030).
              05  QBS053-HONKJNAME                PIC  X(030).
              05  QBS053-HONBIRETHDAY             PIC  X(019).
              05  QBS053-HONSEX                   PIC  X(001).
              05  QBS053-HONYUBINNO               PIC  X(005).
              05  QBS053-HONYUBINYOBI             PIC  X(003).
              05  QBS053-HONCHIBAN                PIC  X(003).
              05  QBS053-HONTEL1                  PIC  X(007).
              05  QBS053-HONTEL2                  PIC  X(004).
              05  QBS053-HONTEL3                  PIC  X(004).
              05  QBS053-KINTEL1                  PIC  X(007).
              05  QBS053-KINTEL2                  PIC  X(004).
              05  QBS053-KINTEL3                  PIC  X(004).
              05  QBS053-HONJUSYOCD               PIC  X(011).
              05  QBS053-HONKNBANCHI              PIC  X(015).
              05  QBS053-HONKNKATAGAKI            PIC  X(032).
              05  QBS053-HONKJBANCHI              PIC  X(030).
              05  QBS053-HONKJKATAGAKI            PIC  X(064).
              05  QBS053-KINKINMUKBN              PIC  X(001).
              05  QBS053-KINKNNAME                PIC  X(030).
              05  QBS053-KINKJNAME                PIC  X(030).
              05  QBS053-KINJOSHOCD               PIC  X(011).
              05  QBS053-KINKNBANCHI              PIC  X(015).
              05  QBS053-KINKNKATAGAKI            PIC  X(032).
              05  QBS053-KINKJBANCHI              PIC  X(030).
              05  QBS053-KINKJKATAGAKI            PIC  X(064).
              05  QBS053-CIFNO                    PIC  X(008).
              05  QBS053-CARDKBN                  PIC  X(006).
              05  QBS053-STRDATE                  PIC  X(019).
              05  QBS053-UPDDATE                  PIC  X(019).
              05  QBS053-DELDATE                  PIC  X(019).
              05  QBS053-OPID                     PIC  X(008).
              05  QBS053-WSID                     PIC  X(020).
