000200******************************************************************
000300*       入会受付手紙Ｉ／Ｆファイル      QAS540-->(QBS077)RL:400  *
000400*                                                                *
000500*                                                 2004.04.01     *
000600******************************************************************
000700     03  QBS077-SEG.                              *>入会受付手紙レコ
000800       05   QBS077-G0010.                         *>ユーザログ共通部
000900         07   QBS077-A0010    PIC    9(04).       *>レコード長
001000         07   QBS077-A0020    PIC    9(04).       *>予備
001100         07   QBS077-A0030    PIC    X(08).       *>端末名
001200         07   QBS077-A0040    PIC    X(01).       *>東西区分
001300         07   QBS077-T0050.                       *>店情報
001300           09   QBS077-A0050  PIC    X(04).       *>企業コード
001400           09   QBS077-A0060  PIC    X(02).       *>事業部コード
001500           09   QBS077-A0070  PIC    X(02).       *>店コード
001600         07   QBS077-A0080    PIC    X(07).       *>担当者コード
001700         07   QBS077-T0090.                       *>業務識別情報
001700           09   QBS077-S0090.                     *>業務コード
001700            11   QBS077-A0090 PIC    X(01).       *>システム区分
001800            11   QBS077-A0100 PIC    X(01).       *>サブシステム区分
001900            11   QBS077-A0110 PIC    X(01).       *>プロセス区分
002000            11   QBS077-A0120 PIC    X(02).       *>プロセス連番
002100            11   QBS077-A0130 PIC    X(02).       *>プログラム連番
002200            11   QBS077-A0140 PIC    X(01).       *>モジュール連番
002300           09   QBS077-A0150  PIC    9(01).       *>処理区分
002400         07   QBS077-T0160.                       *>日時情報
002400           09   QBS077-A0160  PIC    9(08).       *>処理日付
002500           09   QBS077-A0170  PIC    9(01).       *>曜日
002600           09   QBS077-A0180  PIC    9(08).       *>処理時間
002700         07   QBS077-A0190    PIC    9(01).       *>ＬＯＧ種別
002800         07   QBS077-T0200.                       *>処理コード        分
002800           09   QBS077-A0200  PIC    X(01).       *>処理サブシステム区分
002900           09   QBS077-A0210  PIC    9(02).       *>処理連番
003000         07   QBS077-A0220    PIC    X(06).       *>ファイルＩＤ
003100         07   QBS077-A0230    PIC    9(01).       *>登録削除変更区分
003200         07   QBS077-A0240    PIC    9(01).       *>レコード区分
003300         07   QBS077-A0250    PIC    9(01).       *>変更前後区分
003400         07   QBS077-A0260    PIC    9(01).       *>ブラック会員区分
003500         07   QBS077-A0270    PIC    X(08).       *>予備
003600       05   QBS077-G0280.                         *>業務固有データ部
003700         07   QBS077-A0280    PIC    9(08).       *>受付番号
003800         07   QBS077-A0290    PIC    9(06).       *>カード区分
003900         07   QBS077-A0300    PIC    X(30).       *>カナ氏名
004000         07   QBS077-A0310    PIC    9(01).       *>性別
004100         07   QBS077-A0320    PIC    9(08).       *>生年月日
004200         07   QBS077-T0330.                       *>自宅電話番号
004200           09   QBS077-A0330  PIC    X(07).       *>市外局番
004200           09   QBS077-A0340  PIC    X(04).       *>局番
004200           09   QBS077-A0350  PIC    X(04).       *>番号
004300         07   QBS077-T0360.                       *>勤務先電話番号
004200           09   QBS077-A0360  PIC    X(07).       *>市外局番
004200           09   QBS077-A0370  PIC    X(04).       *>局番
004200           09   QBS077-A0380  PIC    X(04).       *>番号
004400         07   QBS077-T0390.                       *>郵便番号
004400           09   QBS077-A0390  PIC    X(03).       *>上３桁　
004400           09   QBS077-A0400  PIC    X(04).       *>下４桁
004500         07   QBS077-A0410    PIC    9(11).       *>住所コード
004600         07   QBS077-T0420.                       *>自宅カナ住所
004700          09    QBS077-A0420  PIC    X(08).       *>県名
004800          09    QBS077-A0430  PIC    X(42).       *>市区郡～字丁目
004900          09    QBS077-A0440  PIC    X(15).       *>番地
005000          09    QBS077-A0450  PIC    X(32).       *>方書
005100         07   QBS077-A0460    PIC    9(08).       *>受付日
005200         07   QBS077-A0470    PIC    9(08).       *>決裁日
005300         07   QBS077-A0480    PIC    9(08).       *>登録日
005400         07   QBS077-A0490    PIC    9(02).       *>営業店
005500         07   QBS077-A0500    PIC    9(02).       *>獲得店
005600        05    FILLER      PIC    X(94).       *>予備
