      *****************************************************************
      * ÉÅÉÇí ímêÊÇs (QBS068)    ÉåÉRÅ[Éhí∑ÅFÇPÇUÇTÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS068-TUUCHIMEMOT.
              05  QBS068-UKETSUKENO               PIC  X(008).
              05  QBS068-MAKEDATE                 PIC  X(019).
              05  QBS068-MEMOCD                   PIC  X(008).
              05  QBS068-TSUUCHICD                PIC  X(005).
              05  QBS068-TSUUCHINM                PIC  X(040).
              05  QBS068-STRDATE                  PIC  X(019).
              05  QBS068-UPDDATE                  PIC  X(019).
              05  QBS068-DELDATE                  PIC  X(019).
              05  QBS068-OPID                     PIC  X(008).
              05  QBS068-WSID                     PIC  X(020).
