      *****************************************************************
      * ÇbÇqäÓñ{óvåè
      *****************************************************************
              03  QBS005-DATA.
                  05  QBS005-TYPE                           PIC  X(02).
                  05  QBS005-ENTRYITEM.
                      07  QBS005-KANANA                     PIC  X(30).
                      07  QBS005-KANJINA                    PIC  X(20).
                      07  QBS005-SYMD                       PIC  9(07).
                      07  QBS005-YUBIN                      PIC  9(05).
                      07  QBS005-CHIBAN                     PIC  X(03).
                      07  QBS005-KANAADD                    PIC  X(60).
                      07  QBS005-KANJIADD                   PIC  X(80).
                      07  QBS005-ADD                        PIC  X(11).
                      07  QBS005-CHIBANKT                   PIC  X(60).
                      07  QBS005-TEL                        PIC  X(14).
                      07  QBS005-TELKBN                     PIC  X(1).
                      07  QBS005-SEX                        PIC  X(1).
                      07  QBS005-HAIGU                      PIC  X(1).
                  05  QBS005-FUKAITEM.
                      07  QBS005-ZANSAI                     PIC  9(06).
                      07  QBS005-KOBETKN                    PIC  9(02).
                      07  QBS005-ZHANFLG1                   PIC  X(01).
                      07  QBS005-ZHANFLG2                   PIC  X(01).
                  05  FILLER                                PIC  X(20).
