      *****************************************************************
      * 委託先金融機関発送者データ・会員取直対象者データ
      *   (QBS073) レコード長：１００ＢＹＴＥ
      *****************************************************************
           03  QBS073-SEG.
               05  QBS073-RECKBN             PIC  X(001).
               05  QBS073-SYORIKBN           PIC  X(001).
               05  QBS073-UKETSUKENO         PIC  X(008).
               05  QBS073-HONKNNAME          PIC  X(020).
               05  QBS073-FUBICD             PIC  X(003).
               05  QBS073-HASOUINYMD         PIC  X(008).
               05  FILLER                    PIC  X(059).
