      *****************************************************************
      * è∆âÔèÓïÒÇs (QBS046)    ÉåÉRÅ[Éhí∑ÅFÇPÇXÇVÇaÇôÇîÇÖ
      *****************************************************************
            03  QBS046-SNINQT.
              05  QBS046-TABANO                   PIC  X(006).
              05  QBS046-UKETSUKENO               PIC  X(008).
              05  QBS046-INQKBN                   PIC  X(001).
              05  QBS046-KAZOKURENBAN             PIC  X(001).
              05  QBS046-SAIIRAIKBN               PIC  X(001).
              05  QBS046-SAIIRAICNT               PIC  X(003).
              05  QBS046-CICINQREQ                PIC  X(001).
              05  QBS046-CICINQRESULT             PIC  X(001).
              05  QBS046-JISHAINQREQ              PIC  X(001).
              05  QBS046-JISHAINQRESULT           PIC  X(001).
              05  QBS046-BLACKINQREQ              PIC  X(001).
              05  QBS046-BLACKINQRESULT           PIC  X(001).
              05  QBS046-NGRIYU                   PIC  X(004).
              05  QBS046-RECORDKBN                PIC  X(001).
              05  QBS046-RECORDSKB1               PIC  X(001).
              05  QBS046-RENBAN1                  PIC  X(002).
              05  QBS046-RECORDSKB2               PIC  X(001).
              05  QBS046-RENBAN2                  PIC  X(002).
              05  QBS046-TYPE                     PIC  X(002).
              05  QBS046-NAME                     PIC  X(030).
              05  QBS046-SYMD                     PIC  X(007).
              05  QBS046-YUBIN                    PIC  X(005).
              05  QBS046-CHIBAN                   PIC  X(003).
              05  QBS046-TEL1                     PIC  X(014).
              05  QBS046-TEL2                     PIC  X(014).
              05  QBS046-STRDATE                  PIC  X(019).
              05  QBS046-UPDDATE                  PIC  X(019).
              05  QBS046-DELDATE                  PIC  X(019).
              05  QBS046-OPID                     PIC  X(008).
              05  QBS046-WSID                     PIC  X(020).
