      *****************************************************************
      * クーリア登録指示ファイル    
      *****************************************************************
           03  QBS103-UKETSUKENO                          PIC X(008).
           03  QBS103-RETURNSTATUS                        PIC X(032).
           03  QBS103-HAKKOUKEITAI                        PIC X(001).
