      *****************************************************************
      * クーリア移動指示    
      *****************************************************************
           03  QBS102-UKETSUKENO                          PIC X(008).
           03  QBS102-COURIERID                           PIC X(015).
           03  QBS102-RETURNSTATUS                        PIC X(032).
