      *****************************************************************         
      * êRç∏àÀóä                                                                
      *****************************************************************         
           03  QBS104-UKETSUKENO                          PIC X(008).           
           03  QBS104-COURIERID                           PIC X(015).           
           03  QBS104-SINSA-IRAI                          PIC X(001).           
           03  QBS104-JCBHANTEI                           PIC X(004).           
