      *****************************************************************         
      * ÉNÉäÅ[ÉAåãâ                                                             
      *****************************************************************         
           03  QBS101-UKETSUKENO                          PIC X(008).           
           03  QBS101-COURIERID                           PIC X(015).           
