      *****************************************************************         
      * ƒŠƒXƒg‚j‚…‚™“o˜^ˆË—Š                                                    
      *****************************************************************         
           03  QBS105-UKETSUKENO                          PIC X(008).           
           03  QBS105-BUNRUI                              PIC X(002).           
