      *****************************************************************
      * 申込書家族Ｔ (QBS302)    レコード長：132Byte
      *****************************************************************
            03  QBS302-FAMILYT.
              05  QBS302-UKETSUKENO               PIC  X(008).
              05  QBS302-SEQ                      PIC  X(001).
              05  QBS302-BIRTHDAY                 PIC  X(019).
              05  QBS302-SEX                      PIC  X(001).
              05  QBS302-ZOKGR                    PIC  X(001).
              05  QBS302-HAKKENUMU                PIC  X(001).
              05  QBS302-CIFNO                    PIC  X(008).
              05  QBS302-CICINQNO                 PIC  X(008).
              05  QBS302-STRDATE                  PIC  X(019).
              05  QBS302-UPDDATE                  PIC  X(019).
              05  QBS302-DELDATE                  PIC  X(019).
              05  QBS302-OPID                     PIC  X(008).
              05  QBS302-WSID                     PIC  X(020).
