      *****************************************************************
      * 類似氏名Ｔ (QBS313)    レコード長：124Byte
      *****************************************************************
            03  QBS313-SNRUIJINAMET.
              05  QBS313-TABANO                   PIC  X(006).
              05  QBS313-UKETSUKENO               PIC  X(008).
              05  QBS313-INQKBN                   PIC  X(001).
              05  QBS313-KAZOKURENBAN             PIC  X(001).
              05  QBS313-SAIIRAIKBN               PIC  X(001).
              05  QBS313-SAIIRAICNT               PIC  X(003).
              05  QBS313-CICINQREQ                PIC  X(001).
              05  QBS313-CICINQRESULT             PIC  X(001).
              05  QBS313-JISHAINQREQ              PIC  X(001).
              05  QBS313-JISHAINQRESULT           PIC  X(001).
              05  QBS313-BLACKINQREQ              PIC  X(001).
              05  QBS313-BLACKINQRESULT           PIC  X(001).
              05  QBS313-NGRIYU                   PIC  X(004).
              05  QBS313-RECORDKBN                PIC  X(001).
              05  QBS313-RECORDSKB1               PIC  X(001).
              05  QBS313-RENBAN1                  PIC  X(002).
              05  QBS313-RECORDSKB2               PIC  X(001).
              05  QBS313-RENBAN2                  PIC  X(002).
              05  QBS313-TYPE                     PIC  X(002).
              05  QBS313-STRDATE                  PIC  X(019).
              05  QBS313-UPDDATE                  PIC  X(019).
              05  QBS313-DELDATE                  PIC  X(019).
              05  QBS313-OPID                     PIC  X(008).
              05  QBS313-WSID                     PIC  X(020).
