      *****************************************************************
      * Ç`ÇdÇrå¬ï Çs (QBS316)    ÉåÉRÅ[Éhí∑ÅF259Byte
      *****************************************************************
            03  QBS316-AESKOBETSUT.
              05  QBS316-SEQNO                    PIC  X(019).
              05  QBS316-UKETSUKENO               PIC  X(008).
              05  QBS316-KANKEIKBN                PIC  X(001).
              05  QBS316-KAZOKURBN                PIC  X(001).
              05  QBS316-ICCHITYPE                PIC  X(002).
              05  QBS316-KAIINGYOSHUKBN           PIC  X(002).
              05  QBS316-KAIINCD                  PIC  X(009).
              05  QBS316-JOUHODATE                PIC  X(007).
              05  QBS316-JOUHOSBT                 PIC  X(002).
              05  QBS316-KEIKACMT                 PIC  X(002).
              05  QBS316-KEIKACMTDATE             PIC  X(007).
              05  QBS316-SHURYOCMT                PIC  X(002).
              05  QBS316-KEIYAKUDATE              PIC  X(007).
              05  QBS316-KEIYAKUKBN               PIC  X(002).
              05  QBS316-TANPOUMU                 PIC  X(001).
              05  QBS316-SHOHINNAME               PIC  X(007).
              05  QBS316-HOUKOKUDATE              PIC  X(008).
              05  QBS316-HOSHODATE                PIC  X(008).
              05  QBS316-SHIHARAICNT              PIC  X(003).
              05  QBS316-YUUSIGAKU                PIC  X(006).
              05  QBS316-KYOKUDOGAKU              PIC  X(006).
              05  QBS316-CASHKYOKUDOGAKU          PIC  X(006).
              05  QBS316-ZAISAI                   PIC  X(006).
              05  QBS316-CASHZANSAI               PIC  X(006).
              05  QBS316-SEIKYUGAKU               PIC  X(006).
              05  QBS316-NYUKINGAKU               PIC  X(006).
              05  QBS316-NYUKINRUIKEI             PIC  X(006).
              05  QBS316-NYUKINRIREKI             PIC  X(024).
              05  QBS316-KYOJUNENSUKBN            PIC  X(001).
              05  QBS316-SHOKUGYOKBN              PIC  X(001).
              05  QBS316-KINZOKUNENSU             PIC  X(002).
              05  QBS316-STRDATE                  PIC  X(019).
              05  QBS316-UPDDATE                  PIC  X(019).
              05  QBS316-DELDATE                  PIC  X(019).
              05  QBS316-OPID                     PIC  X(008).
              05  QBS316-WSID                     PIC  X(020).
