      *****************************************************************
      * 親権者／保証人Ｔ (QBS303)    レコード長：193Byte
      *****************************************************************
            03  QBS303-SHINKENSHAT.
              05  QBS303-UKETSUKENO               PIC  X(008).
              05  QBS303-SINKENSHAKBN             PIC  X(001).
              05  QBS303-BIRTHDAY                 PIC  X(019).
              05  QBS303-SEX                      PIC  X(001).
              05  QBS303-ZOKGR                    PIC  X(001).
              05  QBS303-CHIBAN                   PIC  X(003).
              05  QBS303-HONJUSHOCD               PIC  X(011).
              05  QBS303-HONYUBINNO               PIC  X(007).
              05  QBS303-HONHAIGUUM               PIC  X(001).
              05  QBS303-HONCHILDSU               PIC  X(002).
              05  QBS303-HONDOKYOKBN              PIC  X(001).
              05  QBS303-HONSUMAIKBN              PIC  X(001).
              05  QBS303-HONSUMAINENSU            PIC  X(001).
              05  QBS303-KINJUSHOCD               PIC  X(011).
              05  QBS303-KINYUBINNO               PIC  X(007).
              05  QBS303-NOCICINQNO               PIC  X(008).
              05  QBS303-KINNENSHUKBN             PIC  X(001).
              05  QBS303-KINYAKUSHOKU             PIC  X(020).
              05  QBS303-KINSHIHONKG              PIC  X(001).
              05  QBS303-KINELSENENSHU            PIC  X(001).
              05  QBS303-KINJUGYOCNT              PIC  X(001).
              05  QBS303-SHINHISSUKBN             PIC  X(001).
              05  QBS303-STRDATE                  PIC  X(019).
              05  QBS303-UPDDATE                  PIC  X(019).
              05  QBS303-DELDATE                  PIC  X(019).
              05  QBS303-OPID                     PIC  X(008).
              05  QBS303-WSID                     PIC  X(020).
