      *****************************************************************
      * 自社ブラックＴ (QBS315)    レコード長：274Byte
      *****************************************************************
            03  QBS315-JISHABLKT.
              05  QBS315-TABANO                   PIC  X(006).
              05  QBS315-UKETSUKENO               PIC  X(008).
              05  QBS315-INQKBN                   PIC  X(001).
              05  QBS315-KAZOKURENBAN             PIC  X(001).
              05  QBS315-SAIIRAIKBN               PIC  X(001).
              05  QBS315-SAIIRAICNT               PIC  X(003).
              05  QBS315-CICINQREQ                PIC  X(001).
              05  QBS315-CICINQRESULT             PIC  X(001).
              05  QBS315-JISHAINQREQ              PIC  X(001).
              05  QBS315-JISHAINQRESULT           PIC  X(001).
              05  QBS315-BLACKINQREQ              PIC  X(001).
              05  QBS315-BLACKINQRESULT           PIC  X(001).
              05  QBS315-NGRIYU                   PIC  X(004).
              05  QBS315-RECORDKBN                PIC  X(001).
              05  QBS315-RECORDSKB1               PIC  X(001).
              05  QBS315-RENBAN1                  PIC  X(002).
              05  QBS315-RECORDSKB2               PIC  X(001).
              05  QBS315-RENBAN2                  PIC  X(002).
              05  QBS315-TYPE                     PIC  X(002).
              05  QBS315-KAIINJYOTAI              PIC  X(008).
              05  QBS315-BLACKNO                  PIC  X(008).
              05  QBS315-EIGYOTEN                 PIC  X(002).
              05  QBS315-KAKUTOKUTEN              PIC  X(002).
              05  QBS315-BLKSTRDATE               PIC  X(019).
              05  QBS315-STRKBN                   PIC  X(001).
              05  QBS315-RIYU                     PIC  X(002).
              05  QBS315-RIYUTSUIKI               PIC  X(020).
              05  QBS315-BLKUKETSUKENO            PIC  X(008).
              05  QBS315-KAIINNO                  PIC  X(012).
              05  QBS315-HONBIRETHDAY             PIC  X(019).
              05  QBS315-HONSEX                   PIC  X(001).
              05  QBS315-HONYUBINNO               PIC  X(005).
              05  QBS315-HONYUBINYOBI             PIC  X(003).
              05  QBS315-HONCHIBAN                PIC  X(003).
              05  QBS315-HONJUSYOCD               PIC  X(011).
              05  QBS315-KINKINMUKBN              PIC  X(001).
              05  QBS315-KINJOSHOCD               PIC  X(011).
              05  QBS315-CIFNO                    PIC  X(008).
              05  QBS315-CARDKBN                  PIC  X(006).
              05  QBS315-STRDATE                  PIC  X(019).
              05  QBS315-UPDDATE                  PIC  X(019).
              05  QBS315-DELDATE                  PIC  X(019).
              05  QBS315-OPID                     PIC  X(008).
              05  QBS315-WSID                     PIC  X(020).
