      *****************************************************************
      * 電話番号識別Ｔ (QBS312)    レコード長：135Byte
      *****************************************************************
            03  QBS312-SNTELT.
              05  QBS312-TABANO                   PIC  X(006).
              05  QBS312-UKETSUKENO               PIC  X(008).
              05  QBS312-INQKBN                   PIC  X(001).
              05  QBS312-KAZOKURENBAN             PIC  X(001).
              05  QBS312-SAIIRAIKBN               PIC  X(001).
              05  QBS312-SAIIRAICNT               PIC  X(003).
              05  QBS312-CICINQREQ                PIC  X(001).
              05  QBS312-CICINQRESULT             PIC  X(001).
              05  QBS312-JISHAINQREQ              PIC  X(001).
              05  QBS312-JISHAINQRESULT           PIC  X(001).
              05  QBS312-BLACKINQREQ              PIC  X(001).
              05  QBS312-BLACKINQRESULT           PIC  X(001).
              05  QBS312-NGRIYU                   PIC  X(004).
              05  QBS312-RECORDKBN                PIC  X(001).
              05  QBS312-RECORDSKB1               PIC  X(001).
              05  QBS312-RENBAN1                  PIC  X(002).
              05  QBS312-RECORDSKB2               PIC  X(001).
              05  QBS312-RENBAN2                  PIC  X(002).
              05  QBS312-KUBUN                    PIC  X(002).
              05  QBS312-SYMD                     PIC  X(007).
              05  QBS312-YUBIN                    PIC  X(005).
              05  QBS312-CHIBAN                   PIC  X(003).
              05  QBS312-KRKYM                    PIC  X(004).
              05  QBS312-JYOKBN                   PIC  X(001).
              05  QBS312-STRDATE                  PIC  X(019).
              05  QBS312-UPDDATE                  PIC  X(019).
              05  QBS312-DELDATE                  PIC  X(019).
              05  QBS312-OPID                     PIC  X(008).
              05  QBS312-WSID                     PIC  X(020).
