      *****************************************************************
      * ÇbÇqå¬ï óvåèÇs (QBS306)    ÉåÉRÅ[Éhí∑ÅF421Byte
      *****************************************************************
            03  QBS306-CRKOBETSUYKT.
              05  QBS306-TABANO                   PIC  X(006).
              05  QBS306-UKETSUKENO               PIC  X(008).
              05  QBS306-INQKBN                   PIC  X(001).
              05  QBS306-KAZOKURENBAN             PIC  X(001).
              05  QBS306-SAIIRAIKBN               PIC  X(001).
              05  QBS306-SAIIRAICNT               PIC  X(003).
              05  QBS306-CICINQREQ                PIC  X(001).
              05  QBS306-CICINQRESULT             PIC  X(001).
              05  QBS306-JISHAINQREQ              PIC  X(001).
              05  QBS306-JISHAINQRESULT           PIC  X(001).
              05  QBS306-BLACKINQREQ              PIC  X(001).
              05  QBS306-BLACKINQRESULT           PIC  X(001).
              05  QBS306-NGRIYU                   PIC  X(004).
              05  QBS306-RECORDKBN                PIC  X(001).
              05  QBS306-RECORDSKB1               PIC  X(001).
              05  QBS306-RENBAN1                  PIC  X(002).
              05  QBS306-RECORDSKB2               PIC  X(001).
              05  QBS306-RENBAN2                  PIC  X(002).
              05  QBS306-GYOSYU                   PIC  X(002).
              05  QBS306-KAIIN                    PIC  X(004).
              05  QBS306-KEINO                    PIC  X(020).
              05  QBS306-KEIYMD                   PIC  X(007).
              05  QBS306-KEIKBN                   PIC  X(002).
              05  QBS306-TANPO                    PIC  X(001).
              05  QBS306-SYOHIN                   PIC  X(007).
              05  QBS306-HARAI                    PIC  X(003).
              05  QBS306-KEISYMD                  PIC  X(007).
              05  QBS306-KEIGAKU                  PIC  X(006).
              05  QBS306-KYOKGK                   PIC  X(006).
              05  QBS306-CKYOKGK                  PIC  X(006).
              05  QBS306-HOUYMD                   PIC  X(007).
              05  QBS306-ZANSAI                   PIC  X(006).
              05  QBS306-CZANSAI                  PIC  X(006).
              05  QBS306-SEIGAKU                  PIC  X(006).
              05  QBS306-NYUGAKU                  PIC  X(006).
              05  QBS306-NYURIGK                  PIC  X(006).
              05  QBS306-NYUREKI                  PIC  X(024).
              05  QBS306-KEICMNT                  PIC  X(002).
              05  QBS306-KEICYMD                  PIC  X(007).
              05  QBS306-ENDCMNT                  PIC  X(002).
              05  QBS306-KINGAKU                  PIC  X(006).
              05  QBS306-HRIKGK                   PIC  X(006).
              05  QBS306-HRIKYMD                  PIC  X(007).
              05  QBS306-KAIYMD                   PIC  X(007).
              05  QBS306-HOKBN                    PIC  X(001).
              05  QBS306-JYUKYO                   PIC  X(001).
              05  QBS306-JYUNEN                   PIC  X(001).
              05  QBS306-SYOKU                    PIC  X(001).
              05  QBS306-KMTLKBN                  PIC  X(001).
              05  QBS306-KNMNEN                   PIC  X(002).
              05  QBS306-NENSYU                   PIC  X(001).
              05  QBS306-SYOTOKU1                 PIC  X(001).
              05  QBS306-SYOTOKU2                 PIC  X(001).
              05  QBS306-SYOTOKU3                 PIC  X(001).
              05  QBS306-ZOKCMNT                  PIC  X(002).
              05  QBS306-KNRCMNT                  PIC  X(001).
              05  QBS306-CMNT                     PIC  X(001).
              05  QBS306-ZHFLG1                   PIC  X(001).
              05  QBS306-ZHFLG2                   PIC  X(001).
              05  QBS306-ZHFLG3                   PIC  X(001).
              05  QBS306-ZHFLG4                   PIC  X(001).
              05  QBS306-ZHFLG5                   PIC  X(001).
              05  QBS306-ZHFLG6                   PIC  X(001).
              05  QBS306-ZHFLG7                   PIC  X(001).
              05  QBS306-ZHFLG8                   PIC  X(001).
              05  QBS306-ZHFLG9                   PIC  X(001).
              05  QBS306-ZHFLG10                  PIC  X(001).
              05  QBS306-ZHFLG11                  PIC  X(001).
              05  QBS306-ZHFLG12                  PIC  X(001).
              05  QBS306-ZHFLG13                  PIC  X(001).
              05  QBS306-ZHFLG14                  PIC  X(001).
              05  QBS306-CMNTUMU                  PIC  X(001).
              05  QBS306-FUKCMNT                  PIC  X(100).
              05  QBS306-STRDATE                  PIC  X(019).
              05  QBS306-UPDDATE                  PIC  X(019).
              05  QBS306-DELDATE                  PIC  X(019).
              05  QBS306-OPID                     PIC  X(008).
              05  QBS306-WSID                     PIC  X(020).
