      *****************************************************************
      * ÇbÇqóﬁéóèÓïÒÇs (QBS307)    ÉåÉRÅ[Éhí∑ÅF146Byte
      *****************************************************************
            03  QBS307-CRRUIJIT.
              05  QBS307-TABANO                   PIC  X(006).
              05  QBS307-UKETSUKENO               PIC  X(008).
              05  QBS307-INQKBN                   PIC  X(001).
              05  QBS307-KAZOKURENBAN             PIC  X(001).
              05  QBS307-SAIIRAIKBN               PIC  X(001).
              05  QBS307-SAIIRAICNT               PIC  X(003).
              05  QBS307-CICINQREQ                PIC  X(001).
              05  QBS307-CICINQRESULT             PIC  X(001).
              05  QBS307-JISHAINQREQ              PIC  X(001).
              05  QBS307-JISHAINQRESULT           PIC  X(001).
              05  QBS307-BLACKINQREQ              PIC  X(001).
              05  QBS307-BLACKINQRESULT           PIC  X(001).
              05  QBS307-NGRIYU                   PIC  X(004).
              05  QBS307-RECORDKBN                PIC  X(001).
              05  QBS307-RECORDSKB1               PIC  X(001).
              05  QBS307-RENBAN1                  PIC  X(002).
              05  QBS307-RECORDSKB2               PIC  X(001).
              05  QBS307-RENBAN2                  PIC  X(002).
              05  QBS307-TYPE                     PIC  X(002).
              05  QBS307-SYMD                     PIC  X(007).
              05  QBS307-YUBIN                    PIC  X(005).
              05  QBS307-CHIBAN                   PIC  X(003).
              05  QBS307-SAISHYMD                 PIC  X(007).
              05  QBS307-STRDATE                  PIC  X(019).
              05  QBS307-UPDDATE                  PIC  X(019).
              05  QBS307-DELDATE                  PIC  X(019).
              05  QBS307-OPID                     PIC  X(008).
              05  QBS307-WSID                     PIC  X(020).
