      *****************************************************************
      * Ç`ÇdÇrè∆âÔèÓïÒÇs (QBS317)    ÉåÉRÅ[Éhí∑ÅF167Byte
      *****************************************************************
            03  QBS317-AESINQT.
              05  QBS317-SEQNO                    PIC  X(019).
              05  QBS317-UKETSUKENO               PIC  X(008).
              05  QBS317-KANKEIKBN                PIC  X(001).
              05  QBS317-KAZOKURBN                PIC  X(001).
              05  QBS317-ICCHITYPE                PIC  X(002).
              05  QBS317-BIRTHDAY                 PIC  X(007).
              05  QBS317-YUBINNO                  PIC  X(008).
              05  QBS317-CHIBAN                   PIC  X(003).
              05  QBS317-KAIINNO                  PIC  X(009).
              05  QBS317-INQDATE                  PIC  X(007).
              05  QBS317-HONHOSHOKBN              PIC  X(001).
              05  QBS317-KEIYAKUKBN               PIC  X(002).
              05  QBS317-SHOHINCD                 PIC  X(003).
              05  QBS317-YUSHIGAKU                PIC  X(006).
              05  QBS317-SHIHARAICNT              PIC  X(003).
              05  QBS317-INQGYOSHU                PIC  X(002).
              05  QBS317-STRDATE                  PIC  X(019).
              05  QBS317-UPDDATE                  PIC  X(019).
              05  QBS317-DELDATE                  PIC  X(019).
              05  QBS317-OPID                     PIC  X(008).
              05  QBS317-WSID                     PIC  X(020).
