      *****************************************************************
      * 照会情報Ｔ (QBS310)    レコード長：139Byte
      *****************************************************************
            03  QBS310-SNINQT.
              05  QBS310-TABANO                   PIC  X(006).
              05  QBS310-UKETSUKENO               PIC  X(008).
              05  QBS310-INQKBN                   PIC  X(001).
              05  QBS310-KAZOKURENBAN             PIC  X(001).
              05  QBS310-SAIIRAIKBN               PIC  X(001).
              05  QBS310-SAIIRAICNT               PIC  X(003).
              05  QBS310-CICINQREQ                PIC  X(001).
              05  QBS310-CICINQRESULT             PIC  X(001).
              05  QBS310-JISHAINQREQ              PIC  X(001).
              05  QBS310-JISHAINQRESULT           PIC  X(001).
              05  QBS310-BLACKINQREQ              PIC  X(001).
              05  QBS310-BLACKINQRESULT           PIC  X(001).
              05  QBS310-NGRIYU                   PIC  X(004).
              05  QBS310-RECORDKBN                PIC  X(001).
              05  QBS310-RECORDSKB1               PIC  X(001).
              05  QBS310-RENBAN1                  PIC  X(002).
              05  QBS310-RECORDSKB2               PIC  X(001).
              05  QBS310-RENBAN2                  PIC  X(002).
              05  QBS310-TYPE                     PIC  X(002).
              05  QBS310-SYMD                     PIC  X(007).
              05  QBS310-YUBIN                    PIC  X(005).
              05  QBS310-CHIBAN                   PIC  X(003).
              05  QBS310-STRDATE                  PIC  X(019).
              05  QBS310-UPDDATE                  PIC  X(019).
              05  QBS310-DELDATE                  PIC  X(019).
              05  QBS310-OPID                     PIC  X(008).
              05  QBS310-WSID                     PIC  X(020).
