      *****************************************************************
      * 信用情報Ｔ (QBS308)    レコード長：144Byte
      *****************************************************************
            03  QBS308-SNJOHOT.
              05  QBS308-TABANO                   PIC  X(006).
              05  QBS308-UKETSUKENO               PIC  X(008).
              05  QBS308-INQKBN                   PIC  X(001).
              05  QBS308-KAZOKURENBAN             PIC  X(001).
              05  QBS308-SAIIRAIKBN               PIC  X(001).
              05  QBS308-SAIIRAICNT               PIC  X(003).
              05  QBS308-CICINQREQ                PIC  X(001).
              05  QBS308-CICINQRESULT             PIC  X(001).
              05  QBS308-JISHAINQREQ              PIC  X(001).
              05  QBS308-JISHAINQRESULT           PIC  X(001).
              05  QBS308-BLACKINQREQ              PIC  X(001).
              05  QBS308-BLACKINQRESULT           PIC  X(001).
              05  QBS308-NGRIYU                   PIC  X(004).
              05  QBS308-RECORDKBN                PIC  X(001).
              05  QBS308-RECORDSKB1               PIC  X(001).
              05  QBS308-RENBAN1                  PIC  X(002).
              05  QBS308-RECORDSKB2               PIC  X(001).
              05  QBS308-RENBAN2                  PIC  X(002).
              05  QBS308-TYPE                     PIC  X(002).
              05  QBS308-SYMD                     PIC  X(007).
              05  QBS308-YUBIN                    PIC  X(005).
              05  QBS308-CHIBAN                   PIC  X(003).
              05  QBS308-TELKBN                   PIC  X(001).
              05  QBS308-SEX                      PIC  X(001).
              05  QBS308-HOJIN                    PIC  X(001).
              05  QBS308-JYUKYO                   PIC  X(001).
              05  QBS308-HAIGU                    PIC  X(001).
              05  QBS308-STRDATE                  PIC  X(019).
              05  QBS308-UPDDATE                  PIC  X(019).
              05  QBS308-DELDATE                  PIC  X(019).
              05  QBS308-OPID                     PIC  X(008).
              05  QBS308-WSID                     PIC  X(020).
