      *****************************************************************
      * 回答情報Ｔ (QBS304)    レコード長：577Byte
      *****************************************************************
            03  QBS304-ANSWERT.
              05  QBS304-TABANO                   PIC  X(006).
              05  QBS304-UKETSUKENO               PIC  X(008).
              05  QBS304-INQKBN                   PIC  X(001).
              05  QBS304-KAZOKURENBAN             PIC  X(001).
              05  QBS304-SAIIRAIKBN               PIC  X(001).
              05  QBS304-SAIIRAICNT               PIC  X(003).
              05  QBS304-CICINQREQ                PIC  X(001).
              05  QBS304-CICINQRESULT             PIC  X(001).
              05  QBS304-JISHAINQREQ              PIC  X(001).
              05  QBS304-JISHAINQRESULT           PIC  X(001).
              05  QBS304-BLACKINQREQ              PIC  X(001).
              05  QBS304-BLACKINQRESULT           PIC  X(001).
              05  QBS304-NGRIYU                   PIC  X(004).
              05  QBS304-RECORDKBN                PIC  X(001).
              05  QBS304-RECORDSKB1               PIC  X(001).
              05  QBS304-RENBAN1                  PIC  X(002).
              05  QBS304-RECORDSKB2               PIC  X(001).
              05  QBS304-RENBAN2                  PIC  X(002).
              05  QBS304-INQNO                    PIC  X(006).
              05  QBS304-USER2                    PIC  X(010).
              05  QBS304-KWSID                    PIC  X(008).
              05  QBS304-USER                     PIC  X(019).
              05  QBS304-KAITO                    PIC  X(001).
              05  QBS304-MADCD                    PIC  X(003).
              05  QBS304-KIKAN                    PIC  X(002).
              05  QBS304-CICSRV                   PIC  X(002).
              05  QBS304-NETSRV                   PIC  X(002).
              05  QBS304-SYMD                     PIC  X(007).
              05  QBS304-YUBIN                    PIC  X(005).
              05  QBS304-CHIBAN                   PIC  X(003).
              05  QBS304-HHOSYO                   PIC  X(001).
              05  QBS304-KYKBN                    PIC  X(002).
              05  QBS304-SHOHIN                   PIC  X(003).
              05  QBS304-YUSHI                    PIC  X(006).
              05  QBS304-HARAI                    PIC  X(003).
              05  QBS304-HJCODE                   PIC  X(010).
              05  QBS304-CHIIKI                   PIC  X(005).
              05  QBS304-CHOU                     PIC  X(011).
              05  QBS304-CHIG                     PIC  X(008).
              05  QBS304-HEYAG                    PIC  X(004).
              05  QBS304-MUNEG                    PIC  X(004).
              05  QBS304-DUMMY1                   PIC  X(003).
              05  QBS304-KAIIN                    PIC  X(006).
              05  QBS304-MISIYO                   PIC  X(003).
              05  QBS304-SEQNO                    PIC  X(018).
              05  QBS304-KYOKU1                   PIC  X(020).
              05  QBS304-KYOKU2                   PIC  X(020).
              05  QBS304-CHIKU                    PIC  X(020).
              05  QBS304-HH                       PIC  X(002).
              05  QBS304-MM                       PIC  X(002).
              05  QBS304-SS                       PIC  X(002).
              05  QBS304-ERR                      PIC  X(046).
              05  QBS304-SRERR                    PIC  X(020).
              05  QBS304-SRSBT                    PIC  X(002).
              05  QBS304-DUMMY3                   PIC  X(018).
              05  QBS304-DUMMY4                   PIC  X(040).
              05  QBS304-ANSFLG                   PIC  X(001).
              05  QBS304-KMSFLG                   PIC  X(001).
              05  QBS304-CREFLG                   PIC  X(001).
              05  QBS304-HOJFLG                   PIC  X(001).
              05  QBS304-KSCFLG                   PIC  X(001).
              05  QBS304-JICFLG                   PIC  X(001).
              05  QBS304-TELFLG                   PIC  X(001).
              05  QBS304-MAPFLG                   PIC  X(001).
              05  QBS304-DUMMY5                   PIC  X(004).
              05  QBS304-ANSSBT                   PIC  X(002).
              05  QBS304-KMSSBT                   PIC  X(002).
              05  QBS304-CRESBT                   PIC  X(002).
              05  QBS304-HOJSBT                   PIC  X(002).
              05  QBS304-KSCSBT                   PIC  X(002).
              05  QBS304-JICSBT                   PIC  X(002).
              05  QBS304-TELSBT                   PIC  X(002).
              05  QBS304-MAPSBT                   PIC  X(002).
              05  QBS304-DUMMY6                   PIC  X(008).
              05  QBS304-ANSIX                    PIC  X(006).
              05  QBS304-KMSIX                    PIC  X(006).
              05  QBS304-CREIX                    PIC  X(006).
              05  QBS304-HOJIX                    PIC  X(006).
              05  QBS304-KSCIX                    PIC  X(006).
              05  QBS304-JICIX                    PIC  X(006).
              05  QBS304-TELIX                    PIC  X(006).
              05  QBS304-MAPIX                    PIC  X(006).
              05  QBS304-DUMMY7                   PIC  X(024).
              05  QBS304-STRDATE                  PIC  X(019).
              05  QBS304-UPDDATE                  PIC  X(019).
              05  QBS304-DELDATE                  PIC  X(019).
              05  QBS304-OPID                     PIC  X(008).
              05  QBS304-WSID                     PIC  X(020).
