      *****************************************************************
      * 申込書Ｔ (QBS301)    レコード長：943Byte
      *****************************************************************
            03  QBS301-MOSHIKOMIT.
              05  QBS301-UKETSUKENO               PIC  X(008).
              05  QBS301-COURIERID                PIC  X(015).
              05  QBS301-KAKUTOKUTEN              PIC  X(002).
              05  QBS301-EIGYOTEN                 PIC  X(002).
              05  QBS301-KAKUTOKUROUT             PIC  X(009).
              05  QBS301-INPUTROUTE               PIC  X(001).
              05  QBS301-CARDKBN                  PIC  X(006).
              05  QBS301-CARDSYURUI               PIC  X(001).
              05  QBS301-CARDHAKKOKEITAI          PIC  X(001).
              05  QBS301-IMAGESTRDATE             PIC  X(019).
              05  QBS301-IMAGEFILE                PIC  X(080).
              05  QBS301-HONFACEKBN               PIC  X(001).
              05  QBS301-HONTEIKEIKBN             PIC  X(001).
              05  QBS301-HONJUSHOCD               PIC  X(011).
              05  QBS301-HONCHIBAN                PIC  X(003).
              05  QBS301-HONYUBINNO               PIC  X(007).
              05  QBS301-HONSEX                   PIC  X(001).
              05  QBS301-HONBIRTHDAY              PIC  X(019).
              05  QBS301-HONSUMAIKBN              PIC  X(001).
              05  QBS301-HONSUMAINENSU            PIC  X(001).
              05  QBS301-HONHAIGUUM               PIC  X(001).
              05  QBS301-HONCHILDSU               PIC  X(002).
              05  QBS301-HONDOKYOKBN              PIC  X(001).
              05  QBS301-HONCASHKIBOKG            PIC  X(003).
              05  QBS301-HONZANDAKACNT            PIC  X(002).
              05  QBS301-HONZANDAKAKG             PIC  X(011).
              05  QBS301-HONCALLKBN               PIC  X(001).
              05  QBS301-HONCALLNAME              PIC  X(020).
              05  QBS301-KINSHOKUSHU              PIC  X(001).
              05  QBS301-KINKINMUKBN              PIC  X(001).
              05  QBS301-KINHAIGUZOKGR            PIC  X(001).
              05  QBS301-KINHAIGUBIRTH            PIC  X(019).
              05  QBS301-KINJUSHOCD               PIC  X(011).
              05  QBS301-KINCHIBAN                PIC  X(003).
              05  QBS301-KINYUBINNO               PIC  X(007).
              05  QBS301-KINNENSHUKBN             PIC  X(001).
              05  QBS301-KINSHUNYUKBN             PIC  X(001).
              05  QBS301-KINMAENENSUKBN           PIC  X(001).
              05  QBS301-KINMAERIYU               PIC  X(001).
              05  QBS301-KINSHOZOKUBUKA           PIC  X(030).
              05  QBS301-KINYAKUSHOKU             PIC  X(020).
              05  QBS301-KINNYUSHADATE            PIC  X(006).
              05  QBS301-KINSETSURITSU            PIC  X(006).
              05  QBS301-KINSHIHONKG              PIC  X(001).
              05  QBS301-KINJUGYOCNT              PIC  X(001).
              05  QBS301-KINNENSUKBN              PIC  X(001).
              05  QBS301-KINJIEINAIYO             PIC  X(040).
              05  QBS301-KINELSENENSHU            PIC  X(001).
              05  QBS301-KINELSESHUNYU            PIC  X(040).
              05  QBS301-SKIKACD                  PIC  X(006).
              05  QBS301-SKIKOJINCD               PIC  X(007).
              05  QBS301-SKINAISEN                PIC  X(005).
              05  QBS301-SKIMISECD                PIC  X(002).
              05  QBS301-SKIBUHANCD               PIC  X(004).
              05  QBS301-SKICORNERDATE            PIC  X(019).
              05  QBS301-ELSTOZAIKBN              PIC  X(001).
              05  QBS301-ELSCLABUCD               PIC  X(002).
              05  QBS301-ELSFUNYUSKB              PIC  X(004).
              05  QBS301-ELSHENSAIHOHO            PIC  X(001).
              05  QBS301-ELSCARDSOUFU             PIC  X(001).
              05  QBS301-ELSSEIKYUSOFU            PIC  X(001).
              05  QBS301-ELSCARDHAKKOKBN          PIC  X(001).
              05  QBS301-ELSCARDYUSOKBN           PIC  X(001).
              05  QBS301-ELSBUBIKIKBN             PIC  X(001).
              05  QBS301-ELSYOSINRANK             PIC  X(001).
              05  QBS301-ELSCARDUMUFLG            PIC  X(010).
              05  QBS301-ELSCARDSINPAN            PIC  X(030).
              05  QBS301-ELSCARDSONOTA            PIC  X(030).
              05  QBS301-CTLCANS                  PIC  X(001).
              05  QBS301-CTLCANRIYU               PIC  X(004).
              05  QBS301-CTLCANTUIKI              PIC  X(060).
              05  QBS301-CTLHENKYAKUS             PIC  X(001).
              05  QBS301-CTLCANSOKUJIKBN          PIC  X(001).
              05  QBS301-CTLSEISADATE             PIC  X(019).
              05  QBS301-CTLFSTSGDATE             PIC  X(019).
              05  QBS301-CTLSCDSNSDATE            PIC  X(019).
              05  QBS301-CTLMSTSTRDATE            PIC  X(019).
              05  QBS301-CTLHAKKENDATE            PIC  X(019).
              05  QBS301-CTLRONEDATE              PIC  X(019).
              05  QBS301-CTLKANRITEN              PIC  X(002).
              05  QBS301-CTLKAISHATEN             PIC  X(002).
              05  QBS301-CTLJIGYOTEN              PIC  X(002).
              05  QBS301-CTLDMTEN                 PIC  X(002).
              05  QBS301-CTLFLOKBN                PIC  X(001).
              05  QBS301-NOCIFNO                  PIC  X(008).
              05  QBS301-NOKAIINNO                PIC  X(016).
              05  QBS301-NOBLACKNO                PIC  X(007).
              05  QBS301-NOCICINQNO               PIC  X(008).
              05  QBS301-RONSYURUI                PIC  X(001).
              05  QBS301-RONKNG                   PIC  X(011).
              05  QBS301-RONSHIHARAICNT           PIC  X(003).
              05  QBS301-RONATAMAKNG              PIC  X(009).
              05  QBS301-RONKAIINNO               PIC  X(016).
              05  QBS301-RONSKTKBN                PIC  X(001).
              05  QBS301-RONSKTKESSAICD           PIC  X(008).
              05  QBS301-STRDATE                  PIC  X(019).
              05  QBS301-UPDDATE                  PIC  X(019).
              05  QBS301-DELDATE                  PIC  X(019).
              05  QBS301-OPID                     PIC  X(008).
              05  QBS301-WSID                     PIC  X(020).
