      *****************************************************************
      * 信用個別情報Ｔ (QBS309)    レコード長：370Byte
      *****************************************************************
            03  QBS309-SNKOBETSUT.
              05  QBS309-TABANO                   PIC  X(006).
              05  QBS309-UKETSUKENO               PIC  X(008).
              05  QBS309-INQKBN                   PIC  X(001).
              05  QBS309-KAZOKURENBAN             PIC  X(001).
              05  QBS309-SAIIRAIKBN               PIC  X(001).
              05  QBS309-SAIIRAICNT               PIC  X(003).
              05  QBS309-CICINQREQ                PIC  X(001).
              05  QBS309-CICINQRESULT             PIC  X(001).
              05  QBS309-JISHAINQREQ              PIC  X(001).
              05  QBS309-JISHAINQRESULT           PIC  X(001).
              05  QBS309-BLACKINQREQ              PIC  X(001).
              05  QBS309-BLACKINQRESULT           PIC  X(001).
              05  QBS309-NGRIYU                   PIC  X(004).
              05  QBS309-RECORDKBN                PIC  X(001).
              05  QBS309-RECORDSKB1               PIC  X(001).
              05  QBS309-RENBAN1                  PIC  X(002).
              05  QBS309-RECORDSKB2               PIC  X(001).
              05  QBS309-RENBAN2                  PIC  X(002).
              05  QBS309-KAIIN                    PIC  X(009).
              05  QBS309-KYKNO                    PIC  X(020).
              05  QBS309-JYMD                     PIC  X(007).
              05  QBS309-JYOSYU                   PIC  X(002).
              05  QBS309-RIYU                     PIC  X(002).
              05  QBS309-KYMD                     PIC  X(007).
              05  QBS309-KYKBN                    PIC  X(002).
              05  QBS309-TANPO                    PIC  X(001).
              05  QBS309-SYOHIN                   PIC  X(007).
              05  QBS309-YUSHI                    PIC  X(006).
              05  QBS309-HARAI                    PIC  X(003).
              05  QBS309-ZANSAI                   PIC  X(006).
              05  QBS309-ENTAI                    PIC  X(002).
              05  QBS309-ENTAIDO                  PIC  X(002).
              05  QBS309-SUMIYMD                  PIC  X(007).
              05  QBS309-HOKBN                    PIC  X(001).
              05  QBS309-TEKIYO                   PIC  X(020).
              05  QBS309-FNO                      PIC  X(003).
              05  QBS309-FPAGE                    PIC  X(003).
              05  QBS309-JYUNEN                   PIC  X(001).
              05  QBS309-SYOKU                    PIC  X(001).
              05  QBS309-KNMTELK                  PIC  X(001).
              05  QBS309-KNMNEN                   PIC  X(002).
              05  QBS309-NENSYU                   PIC  X(001).
              05  QBS309-SYOTOKU1                 PIC  X(001).
              05  QBS309-SYOTOKU2                 PIC  X(001).
              05  QBS309-SYOTOKU3                 PIC  X(001).
              05  QBS309-CMNT                     PIC  X(001).
              05  QBS309-KNPCMNT                  PIC  X(001).
              05  QBS309-TEISHI                   PIC  X(001).
              05  QBS309-RIREKI                   PIC  X(012).
              05  QBS309-RUISUU                   PIC  X(004).
              05  QBS309-KSNYMD                   PIC  X(007).
              05  QBS309-GYOSYU                   PIC  X(002).
              05  QBS309-CMNTUMU                  PIC  X(001).
              05  QBS309-FUKCMNT                  PIC  X(100).
              05  QBS309-STRDATE                  PIC  X(019).
              05  QBS309-UPDDATE                  PIC  X(019).
              05  QBS309-DELDATE                  PIC  X(019).
              05  QBS309-OPID                     PIC  X(008).
              05  QBS309-WSID                     PIC  X(020).
