      *****************************************************************
      * Ç`ÇdÇrìdéØèÓïÒÇs (QBS318)    ÉåÉRÅ[Éhí∑ÅF144Byte
      *****************************************************************
            03  QBS318-AESTELT.
              05  QBS318-SEQNO                    PIC  X(019).
              05  QBS318-UKETSUKENO               PIC  X(008).
              05  QBS318-KANKEIKBN                PIC  X(001).
              05  QBS318-KAZOKURBN                PIC  X(001).
              05  QBS318-ICCHITYPE                PIC  X(002).
              05  QBS318-BIRTHDAY                 PIC  X(008).
              05  QBS318-YUBINNO                  PIC  X(008).
              05  QBS318-CHIBAN                   PIC  X(003).
              05  QBS318-JOUHODATE                PIC  X(008).
              05  QBS318-JOUHOGEN                 PIC  X(001).
              05  QBS318-STRDATE                  PIC  X(019).
              05  QBS318-UPDDATE                  PIC  X(019).
              05  QBS318-DELDATE                  PIC  X(019).
              05  QBS318-OPID                     PIC  X(008).
              05  QBS318-WSID                     PIC  X(020).
