      *8...........2.........3.........4.........5........6........7.........8  
      *    QCS080(QTS710(QWS120))
      ****************************************************************
      *                     ƒT[ƒoŒü‚¯Ž–¼õˆøƒ}ƒXƒ^                 *
      *                             DATA-WRITTEN  99.01.29           *
      *--------------------------------------------------------------*
      *                  C  ³  —š  —ð                              *
      *   ŠÇ—NO            C³——R             ’S“–ŽÒ   C³“ú•t   *
      ****************************************************************
           03          ()-SEG.                        *>‚b‚h‚eƒŒƒR[ƒh
             05        ()-A0010    PIC  X(30).        *>ˆ³kƒJƒiŽ–¼
             05        ()-A0020    PIC  X(15).        *>ˆ³kTEL  Ž©‘î
             05        ()-A0030    PIC  9(08).        *>‚b‚h‚e  ‚m‚n
             05        ()-A0040    PIC  9(08) COMP-3. *>¶”NŒŽ“ú
             05        ()-G0050.                      *>”Ô†î•ñ
               07      ()-A0060    PIC  9(08).        *>Žó•t”Ô†
               07      ()-A0070    PIC  X(04).        *>ƒ_ƒ~[€–Ú
               07      ()-A0080    PIC  9(08).        *>“à•”‰ïˆõ”Ô†
               07      ()-A0090    PIC  9(08).        *>ƒuƒ‰ƒbƒN  ‚m‚n
             05        ()-A0100    PIC  X(30).        *>ˆ³k‘OƒJƒiŽ–¼
             05        ()-A0110    PIC  X(15).        *>ˆ³k‘OTEL  Ž©‘î
             05        ()-A0120    PIC  9.            *>«•Ê
             05        ()-A0130    PIC  9.            *>¶°ÄÞÛ°ÝŽg—p‹æ•ª
             05        ()-G0140.                      *>‰ïˆõ‘®«Û¹°¼®Ý·°
               07      ()-A0150    PIC  9(04).        *>Šé‹ÆƒR[ƒh
               07      ()-A0160    PIC  9(04).        *>ƒTƒuƒŒƒ“ƒW‚m‚n
             05        FILLER      PIC  X(09).        *>—\”õ
