      *8...........2.........3.........4.........5........6........7.........8  
      *    QCS081(QTS210)
      ****************************************************************
      *                       氏名索引マスタ                         *
      *                             DATA-WRITTEN  99.01.29           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO   修正理由                      担当者   修正日付   *
      *                                                              *
      ****************************************************************
           03          ()-SEG.                        *>ＣＩＦレコード
             05        ()-CIFNO          PIC  9(08).  *>ＣＩＦ  ＮＯ
             05        ()-SHIMEI         PIC  X(30).  *>圧縮カナ氏名
             05        ()-JITAKU         PIC  X(15).  *>圧縮TEL  自宅
             05        ()-UKETSUKENO     PIC  9(08).  *>受付番号
             05        ()-KAIINNO        PIC  9(08).  *>内部会員番号
             05        ()-BLACKNO        PIC  9(08).  *>ブラック  ＮＯ
             05        ()-SEINENGAPPI    PIC  9(08).  *>生年月日
             05        ()-MAESHIMEI      PIC  X(30).  *>圧縮前カナ氏名
             05        ()-MAEJITAKU      PIC  X(15).  *>圧縮前TEL  自宅
             05        ()-SEX            PIC  9.      *>性別
             05        ()-SHIYOUKUBUN    PIC  9.      *>ｶｰﾄﾞﾛｰﾝ使用区分
             05        ()-KIGYOUNO       PIC  9(04).  *>企業コード
             05        ()-SUBRANJIKEY    PIC  9(04).  *>サブレンジＮＯ
             05        ()-HOSTSHORIYMD   PIC  X(08).  *>ホスト処理日
             05        ()-HOSTSHORITIME  PIC  X(06).  *>ホスト処理時刻
             05        ()-SVRKOUSHINYMD  PIC  9(08).  *>サーバ更新日
