      *8...........2.........3.........4.........5........6........7.........8  
      *    QCS060
      ****************************************************************
      *                請求記載データ                                *
      *                             DATA-WRITTEN  04.08.13           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO   修正理由                      担当者   修正日付   * 
      ****************************************************************
           03          ()-SEG.                           *>利用請求記載
             05        ()-G0010.                         *>キー
               07      ()-T0010.                         *>ロケーションキー
                 09    ()-A0010      PIC S9(004) COMP-3. *>企業コード
                 09    ()-A0020      PIC S9(004) COMP-3. *>サブレンジキー
                 09    ()-A0030      PIC S9(008) COMP-3. *>内部会員番号
               07      ()-G0040.                         *>会員情報
                 09    ()-A0040      PIC  9(006).        *>カード区分
                 09    ()-A0050      PIC  9(001).        *>東西区分
                 09    ()-A0060      PIC  X(002).        *>管理店
                 09    ()-A0070      PIC  X(002).        *>獲得店
                 09    ()-A0080      PIC  X(001).        *>ノンマスタフラグ
                 09    ()-A0090      PIC  X(001).        *>不整合識別フラグ
                 09    ()-A0100      PIC  X(001).        *>請求記載データ識別フラグ
                 09    ()-A0110      PIC S9(011) COMP-3. *>入会時ポイント
                 09    ()-A0120      PIC S9(011) COMP-3. *>ボーナスポイント
                 09    ()-A0130      PIC  X(001).        *>ポイント識別フラグ
                 09    ()-A0140      PIC S9(011) COMP-3. *>請求額（店内）
                 09    ()-A0150      PIC S9(011) COMP-3. *>請求額（CS加盟店）
               07      FILLER        PIC  X(050).        *>予備
             05        ()-G0160.                         *>データレコード
               07      ()-A0160      PIC  X(001).        *>レコード区分
               07      ()-T0170.                         *>キー項目
                 09    ()-A0170      PIC  X(009).        *>高島屋管理番号
                 09    ()-A0180      PIC  X(016).        *>カード番号
               07      ()-G0190.                         *>ポイント情報
                 09    ()-T0190.                         *>高島屋編集項目
                   11  ()-A0190      PIC  9(006).        *>締年月日
                   11  ()-A0200      PIC  9(006).        *>積立期限
                   11  ()-A0210      PIC  9(006).        *>交換期限
                   11  ()-A0220      PIC  9(003).        *>交換枚数（前期）
                   11  ()-A0230      PIC S9(011)         *>前月残ポイント
                                SIGN IS LEADING SEPARATE CHARACTER.
                   11  ()-A0240      PIC S9(011)         *>当月交換ポイント
                               SIGN IS LEADING SEPARATE CHARACTER.
                   11  ()-A0250      PIC S9(011)         *>店内発生ポイント
                               SIGN IS LEADING SEPARATE CHARACTER.
                   11  ()-A0260      PIC  X(002).        *>追加ポイント区分
                   11  ()-A0270      PIC S9(011)         *>追加ポイント
                               SIGN IS LEADING SEPARATE CHARACTER.
                   11  ()-A0280      PIC S9(013)         *>ボーナス累計額
                               SIGN IS LEADING SEPARATE CHARACTER.
                   11  FILLER        PIC  X(027).        *>予備
                 09    ()-G0290.                         *>クレディセゾン編集項目
                   11  ()-A0290      PIC  9(004).        *>交換番号
                   11  ()-A0300      PIC  9(003).        *>交換枚数（合計）
                   11  ()-A0310      PIC S9(011)         *>加盟店発生ポイント
                                SIGN IS LEADING SEPARATE CHARACTER.
                   11  ()-A0320      PIC S9(011)         *>現在保有ポイント
                                SIGN IS LEADING SEPARATE CHARACTER.
                   11  ()-A0330      PIC S9(011)         *>利用金額合計
                                SIGN IS LEADING SEPARATE CHARACTER.
                   11  FILLER        PIC  X(015).        *>予備
               07      ()-G0340.                         *>管理情報
                 09    ()-A0340      PIC  X(002).        *>制度
                 09    ()-A0350      PIC  X(002).        *>顧客区分
               07      FILLER        PIC  X(050).        *>予備
