      *8...........2.........3.........4.........5........6........7.........8  
      *    QCS030(QTS550)
      ****************************************************************
      *                ƒT[ƒoŒü‚¯—˜—p–¾×ƒŒƒR[ƒhi‡Œvsj          *
      *                             DATA-WRITTEN  99.02.16           *
      *--------------------------------------------------------------*
      *                  C  ³  —š  —ð                              *
      *   ŠÇ—NO            C³——R             ’S“–ŽÒ   C³“ú•t   *
      ****************************************************************    
           03          ()-SEG.                        *>—˜—p–¾×
             05        ()-A0010    PIC  X(01).        *>ƒŒƒR[ƒh‹æ•ª
             05        ()-G0020.                      *>ƒL[
               07      ()-T0020.                      *>ƒƒP[ƒVƒ‡ƒ“ƒL[
                 09    ()-A0020    PIC  9(04).        *>Šé‹ÆƒR[ƒh
                 09    ()-A0030    PIC  9(04).        *>ƒTƒuƒŒƒ“ƒWƒL[
               07      ()-A0040    PIC  9(08).        *>“à•”‰ïˆõ”Ô†
               07      ()-A0050    PIC  9(07).        *>Žæˆø’Ê”Ô               
             05        ()-A0051    PIC  X(01).        *>íœ‹æ•ª
             05        ()-A0060    PIC  X(01).        *>Ô•”ñ•\Ž¦‹æ•ª
             05        ()-A0070    PIC  X(01).        *>¿‹•Û—¯‹æ•ª
             05        ()-A0080    PIC  9(04).        *>“`•[Ží•Ê
             05        ()-A0090    PIC  9(04).        *>ƒoƒbƒ`‚m‚n
             05        ()-G0100.                      *>‚f|‚m‚n
               07      ()-A0100    PIC  9(04).        *>‚fƒoƒbƒ`‚m‚n
               07      ()-A0110    PIC  9(03).        *>‚f“`•[ƒV[ƒPƒ“ƒX
             05        ()-A0120    PIC  X(12).        *>“`•[‚m‚n
             05        ()-A0130    PIC  9(16).        *>ƒJ[ƒh”Ô†
             05        ()-A0140    PIC  9(08) COMP-3. *>—˜—p“ú
             05        ()-A0150    PIC  9(08) COMP-3. *>Žó•t“ú
             05        ()-A0160    PIC  9(08) COMP-3. *>Œvã“ú
             05        ()-A0170    PIC  9(02).        *>”­¶“X
             05        ()-A0180    PIC  X(10).        *>‰Á–¿“X‚m‚
             05        ()-G0190.                      *>‚o‚n‚r’[––î•ñ
               07      ()-A0190    PIC  9(04).        *>ƒŒƒW‚m‚
               07      ()-A0200    PIC  9(05).        *>Žæˆø‚m‚
             05        ()-A0201    REDEFINES  ()-G0190
                                   PIC  X(09).        *>‚b‚c’[––î•ñ
             05        ()-G0210.                      *>‰ÛŒW
               07      ()-T0210.                      *>ˆµ‰Û
                 09    ()-A0210    PIC  9(02).        *>ˆµ
                 09    ()-A0220    PIC  9(02).        *>‰Û
               07      ()-A0230    PIC  9(02).        *>ŒW
             05        ()-A0240    PIC  9(03).        *>ÃƒR[ƒh
             05        ()-A0241    PIC  9(13).        *>’ñŒg”„ã’Ê”Ô
             05        ()-A0243    PIC  9(02).        *>s”
             05        ()-A0245    PIC  9(02).        *>s‚m‚
             05        ()-G0250.                      *>‡Œvs
               07      ()-A0250    PIC  9(02).        *>Žx•¥•û–@
               07      ()-A0260    PIC  9(05).        *>ƒ[ƒ“Ží•Ê
               07      ()-A0270    PIC S9(11) COMP-3. *>—˜—p‹àŠz
               07      ()-A0280    PIC S9(11) COMP-3. *>¤•i‘ã‹à
               07      ()-A0290    PIC  9(02).        *>•àˆø—¦
               07      ()-A0300    PIC S9(11) COMP-3. *>•àˆøŠz
               07      ()-A0310    PIC S9(11) COMP-3. *>•àˆø‘ÎÛŠz‡Œv
               07      ()-A0320    PIC S9(11) COMP-3. *>•àˆøœŠOŠz‡Œv
               07      ()-A0330    PIC  9(07).        *>³”F”Ô†
               07      ()-A0350    PIC  9(03).        *>•ªŠ„‰ñ”
               07      ()-A0360    PIC  9(02).        *>ƒ{[ƒiƒX‰ñ”
               07      ()-A0370    PIC S9(11) COMP-3. *>ƒ{[ƒiƒX‰ÁŽZŠz
               07      ()-A0390    PIC S9(09) COMP-3. *>•àˆø‘OÁ”ïÅ  
               07      ()-A0400    PIC S9(09) COMP-3. *>•àˆøŒãÁ”ïÅ  
               07      ()-A0410    PIC S9(11) COMP-3. *>“ª‹à
               07      ()-A0420    PIC  99V99 COMP-3. *>Žè”—¿—¦ 
               07      ()-A0430    PIC S9(09) COMP-3. *>Žè”—¿Šz 
               07      ()-A0440    PIC  X(01).        *>¿‹’ŠoÏƒTƒCƒ“
               07      ()-A0450    PIC  X(01).        *>ƒ{‚PŒvã‹æ•ª
               07      ()-A0460    PIC  X(01).        *>—˜—pŽÒƒR[ƒh
               07      ()-T0470.                      *>‘“àî•ñ
                 09    ()-A0471    PIC  9(13) COMP-3. *>—\”õ
                 09    ()-A0472    PIC S9(13) COMP-3. *>œŠO“à‹à
                 09    ()-A0473    PIC  9(08) COMP-3. *>—\”õ
               07      ()-T0480    REDEFINES  ()-T0470.
                                                      *>ŠCŠOî•ñ
                 09    ()-A0480    PIC  9(10)V9(03)
                                              COMP-3. *>Œ»’n‰¿Ši
                 09    ()-A0481    PIC  9(06)V9(07)
                                              COMP-3. *>Š·ŽZƒŒ[ƒg
                 09    ()-A0482    PIC  9(08) COMP-3. *>Š·ŽZ“ú
               07      ()-A0483    PIC  9(01).        *>‘“àŠCŠOŽ¯•Ê
             05        ()-A0491    PIC  X(01).        *>“ü‹àŽè”—¿ŒvŽZÏƒTƒCƒ“
             05        ()-A0492    PIC  9(16).        *>U‘Ö‰ïˆõ”Ô†
             05        ()-A0493    PIC  9(01).        *>”­¶ƒ‹[ƒg
             05        ()-A0494    PIC S9(09) COMP-3. *>‰Á–¿“XŽè”—¿
             05        ()-A0495    PIC S9(09) COMP-3. *>’cŒ_Žè”—¿
             05        ()-A0496    PIC  X(01).        *>“`•[–³ƒtƒ‰ƒO
             05        ()-A0497    PIC  X(01).        *>ˆÚ“®Œvã‹æ•ª
             05        ()-T0498.                      
               07      ()-A0498    PIC  9(05).        *>ƒLƒƒƒbƒVƒ“ƒO•ª‰ðˆ—’Ê”Ô
             05        ()-A0499    PIC  X(01).        *>U‘Ö‹æ•ª
             05        ()-A049A    PIC  X(01).        *>ŽÐˆõNo—L–³‹æ•ª
             05        ()-A049B    PIC  9(02).        *>“`•[“ü—Í“X
             05        ()-A049G    PIC  X(01).        *>‘ãˆø“`•[‹æ•ª
             05        ()-A049C    PIC  9(01).        *>•àˆø^ƒ|ƒCƒ“ƒgŽ¯•Ê‹æ•ª
             05        ()-T049D.                      *>‡Œvƒ|ƒCƒ“ƒg
               07      ()-A049D    PIC S9(11) COMP-3. *>’Êí‡Œvƒ|ƒCƒ“ƒg
               07      ()-A049E    PIC S9(11) COMP-3. *>ƒ{[ƒiƒX‡Œvƒ|ƒCƒ“ƒg
             05        ()-A049F    PIC  X(02).        *>—l‘ÔƒR[ƒh
             05        ()-A049H    PIC  X(01).        *>ŒWŒvã^”„’ ‹æ•ª
             05        ()-A049I    PIC  X(01).        *>Å—¦‹æ•ª
             05        ()-A049K    PIC  X(03).        *>ISO’Ê‰Ý’PˆÊ
             05        ()-A049L    PIC  X(01).        *>ˆê•”•Ô•i‹æ•ª
             05        ()-A049M    PIC  X(01).        *>Ž©“®U‘Ö‹æ•ª
             05        FILLER      PIC  X(12).        *>—\”õ
