      *8...........2.........3.........4.........5........6........7.........8  
      *    QCS050(QTS560)
      ****************************************************************
      *                ƒT[ƒoŒü‚¯—˜—p–¾×•àˆøƒtƒ@ƒCƒ‹                *
      *                             DATA-WRITTEN  99.02.05           *
      *--------------------------------------------------------------*
      *                  C  ³  —š  —ð                              *
      *   ŠÇ—NO            C³——R             ’S“–ŽÒ   C³“ú•t   * 
      ****************************************************************
           03          ()-SEG.                        *>—˜—p–¾×•àˆø
             05        ()-A0010    PIC  X(01).        *>ƒŒƒR[ƒh‹æ•ª
             05        ()-G0020.                      *>ƒL[
               07      ()-T0020.                      *>ƒƒP[ƒVƒ‡ƒ“ƒL[
                 09    ()-A0020    PIC  9(04).        *>Šé‹ÆƒR[ƒh
                 09    ()-A0030    PIC  9(04).        *>ƒTƒuƒŒƒ“ƒWƒL[
               07      ()-A0040    PIC  9(08).        *>“à•”‰ïˆõ”Ô†
               07      ()-A0050    PIC  9(07).        *>Žæˆø’Ê”Ô
             05        ()-A0051    PIC  X(01).        *>íœ‹æ•ª
             05        FILLER      PIC  X(02).        *>—\”õ
             05        ()-A0060    PIC  9(04).        *>“`•[Ží•Ê
             05        ()-A0070    PIC  9(04).        *>ƒoƒbƒ`‚m‚n
             05        ()-G0080.                      *>‚f|‚m‚n
               07      ()-A0080    PIC  9(04).        *>ƒoƒbƒ`‚m‚n
               07      ()-A0090    PIC  9(03).        *>“`•[ƒV[ƒPƒ“ƒX
             05        ()-A0100    PIC  X(12).        *>“`•[‚m‚n
             05        ()-A0110    PIC  9(16).        *>ƒJ[ƒh”Ô†
             05        ()-A0120    PIC  9(08) COMP-3. *>—˜—p“ú
             05        ()-A0130    PIC  9(08) COMP-3. *>Žó•t“ú
             05        ()-A0140    PIC  9(08) COMP-3. *>Œvã“ú
             05        ()-A0150    PIC  9(02).        *>”­¶“X
             05        ()-A0160    PIC  9(02).        *>Žx•¥•û–@ 
             05        ()-A0170    PIC  N(20).        *>¿‹Š¿Žš
             05        ()-A0180    PIC S9(11) COMP-3. *>•àˆøŠzŽè”—¿C³Šz
             05        ()-A0190    PIC S9(09) COMP-3. *>•àˆøÁ”ïÅ 
             05        ()-A0200    PIC  X(01).        *>Å‹æ•ª
             05        ()-A0210    PIC  X(01).        *>¿‹’ŠoÏƒTƒCƒ“
             05        ()-A0220    PIC  9(01).        *>”­¶ƒ‹[ƒg
             05        ()-A0230    PIC  9(02).        *>“`•[“ü—Í“X
             05        FILLER      PIC  X(15).        *>—\”õ  
