      *8...........2.........3.........4.........5........6........7.........8  
      *    QCS010
      ****************************************************************
      *                ƒT[ƒoŒü‚¯‰ïˆõƒ}ƒXƒ^                          *
      *                             DATA-WRITTEN  04.08.03           *
      *--------------------------------------------------------------*
      *                  C  ³  —š  —ð                              *
      *   ŠÇ—NO   C³——R                      ’S“–ŽÒ   C³“ú•t   * 
      ****************************************************************
           03          ()-SEG.                           *>‚b‚r‰ïˆõƒtƒ@ƒCƒ‹
             05        ()-G0010.                         *>“à•”‰ïˆõ”Ô†
               07      ()-T0010.                         *>ƒƒP[ƒVƒ‡ƒ“
                 09    ()-A0010      PIC S9(004) COMP-3. *>Šé‹ÆƒR[ƒh
                 09    ()-A0020      PIC S9(004) COMP-3. *>ƒTƒuƒŒƒ“ƒWƒL[
               07      ()-A0030      PIC S9(008) COMP-3. *>“à•”‰ïˆõ”Ô†
             05        ()-A0040      PIC  X(016).        *>‚b‚r‚sƒJ[ƒh”Ô†
             05        ()-G0050.                         *>‘¦”­‚b‚r‚sƒJ[ƒh”Ô†
               07      ()-A0050      PIC  X(005).        *>‘¦”­‚a‚h‚m‚TŒ…
               07      ()-A0060      PIC  X(008).        *>Žó•t”Ô†
               07      ()-A0070      PIC  X(001).        *>—\”õ
               07      ()-A0080      PIC  X(001).        *>Ž}”Ô
               07      ()-A0090      PIC  X(001).        *>‚b‚c
             05        ()-A0100      PIC  9(006).        *>ƒJ[ƒh‹æ•ª
             05        ()-G0110.                         *>ŒÚ‹q‘®«î•ñ
               07      ()-A0110      PIC  X(001).        *>–{l^‰Æ‘°Ž¯•Ê
               07      ()-A0120      PIC  N(010).        *>Š¿ŽšŽ–¼
               07      ()-A0130      PIC  X(020).        *>ƒJƒiŽ–¼
               07      ()-A0140      PIC  X(001).        *>«•Ê
               07      ()-A0150      PIC S9(007) COMP-3. *>¶”NŒŽ“ú
               07      ()-A0160      PIC  9(006).        *>—LŒøŠúŒÀ
               07      ()-A0170      PIC S9(007) COMP-3. *>“o˜^”NŒŽ“úi“ü‰ï“új
             05        ()-G0180.                         *>Ž©‘îî•ñ
               07      ()-A0180      PIC  X(008).        *>—X•Ö”Ô†
               07      ()-A0190      PIC S9(011) COMP-3. *>ZŠƒR[ƒh
               07      ()-G0200.                         *>Š¿ŽšZŠ
                 09    ()-A0200      PIC  N(025).        *>“s“¹•{Œ§–¼`Žš’š–Ú
                 09    ()-A0210      PIC  N(015).        *>”Ô’n
                 09    ()-A0220      PIC  N(030).        *>•û‘
               07      ()-G0230.                         *>ƒJƒiZŠ
                 09    ()-A0230      PIC  X(008).        *>“s“¹•{Œ§–¼
                 09    ()-A0240      PIC  X(042).        *>Žs‹æŒS`Žš’š–Ú
                 09    ()-A0250      PIC  X(015).        *>”Ô’n
                 09    ()-A0260      PIC  X(030).        *>•û‘
               07      ()-G0270.                         *>“d˜b”Ô†
                 09    ()-A0270      PIC  X(007).        *>ŽsŠO‹Ç”Ô
                 09    ()-A0280      PIC  X(004).        *>‹Ç”Ô
                 09    ()-A0290      PIC  X(004).        *>”Ô†
               07      ()-A0300      PIC  X(011).        *>Œg‘Ñ“d˜b”Ô†
             05        ()-G0310.                         *>¿‹‘‘—•tæZŠ
               07      ()-A0310      PIC  X(008).        *>—X•Ö”Ô†
               07      ()-A0320      PIC  N(004).        *>“s“¹•{Œ§–¼
               07      ()-A0330      PIC  N(050).        *>Žs‹æŒS`Žš’š–Ú
               07      ()-A0340      PIC  N(030).        *>”Ô’nE•û‘
             05        ()-G0350.                         *>ŒðŠ·”Ô†î•ñ
               07      ()-A0350      PIC  9(004).        *>ŒðŠ·”Ô†
               07      ()-A0360      PIC  9(004).        *>‹ŒŒðŠ·”Ô†
               07      ()-A0370      PIC S9(007) COMP-3. *>ŒðŠ·”Ô†“o˜^^•ÏX“ú
             05        ()-A0380      PIC  X(002).        *>ŠÇ—“X
             05        ()-A0390      PIC  X(002).        *>Šl“¾“X
             05        ()-A0400      PIC  X(002).        *>‚c‚l“X
             05        ()-A0410      PIC  X(001).        *>‚c‚l”­‘—‹‘”Û‹æ•ª
             05        ()-A0420      PIC S9(007) COMP-3. *>DM”­‘—‹‘”Û‹æ•ªÝ’è“ú
             05        ()-G0430.                         *>Šl“¾ŽÒî•ñ
               07      ()-A0430      PIC  X(009).        *>•”‰ÛƒR[ƒh
               07      ()-A0440      PIC  X(008).        *>’S“–ŽÒƒR[ƒh
             05        ()-G0450.                         *>‚b‚rƒXƒe[ƒ^ƒXƒe[ƒuƒ‹
               07      ()-A0450      PIC  9(001).        *>‚b‚rƒXƒe[ƒ^ƒX
               07      ()-A0460      PIC S9(007) COMP-3. *>‚b‚rƒXƒe[ƒ^ƒXÝ’è“ú
             05        ()-A0470      PIC S9(008) COMP-3. *>‚b‚h‚e”Ô†
             05        ()-A0480      PIC  9(009).        *>p~“‡‰®Ž¯•Ê”Ô†
             05        ()-A0490      PIC  X(002).        *>ŒÚ‹q‹æ•ª
             05        ()-A0500      PIC S9(007) COMP-3. *>ì¬“ú
             05        ()-A0510      PIC S9(007) COMP-3. *>XV“ú
             05        FILLER        PIC  X(075).        *>FILLER
