      *8...........2.........3.........4.........5........6........7.........8  
      *    QCS040(QTS555)
      ****************************************************************
      *                ƒT[ƒoŒü‚¯—˜—p–¾×ƒŒƒR[ƒhi–¾×sj          *
      *                             DATA-WRITTEN  99.02.16           *
      *--------------------------------------------------------------*
      *                  C  ³  —š  —ð                              *
      *   ŠÇ—NO            C³——R             ’S“–ŽÒ   C³“ú•t   * 
      ****************************************************************    
           03          ()-SEG.                        *>—˜—p–¾×
             05        ()-A0010    PIC  X(01).        *>ƒŒƒR[ƒh‹æ•ª
             05        ()-G0020.                      *>ƒL[
               07      ()-T0020.                      *>ƒƒP[ƒVƒ‡ƒ“ƒL[
                 09    ()-A0020    PIC  9(04).        *>Šé‹ÆƒR[ƒh
                 09    ()-A0030    PIC  9(04).        *>ƒTƒuƒŒƒ“ƒWƒL[
               07      ()-A0040    PIC  9(08).        *>“à•”‰ïˆõ”Ô†
               07      ()-A0050    PIC  9(07).        *>Žæˆø’Ê”Ô               
             05        ()-A0051    PIC  X(01).        *>íœ‹æ•ª
             05        ()-A0060    PIC  X(01).        *>Ô•”ñ•\Ž¦‹æ•ª
             05        ()-A0070    PIC  X(01).        *>¿‹•Û—¯‹æ•ª
             05        ()-A0080    PIC  9(04).        *>“`•[Ží•Ê
             05        ()-A0090    PIC  9(04).        *>ƒoƒbƒ`‚m‚n
             05        ()-G0100.                      *>‚f|‚m‚n
               07      ()-A0100    PIC  9(04).        *>‚fƒoƒbƒ`‚m‚n
               07      ()-A0110    PIC  9(03).        *>‚f“`•[ƒV[ƒPƒ“ƒX
             05        ()-A0120    PIC  X(12).        *>“`•[‚m‚n
             05        ()-A0130    PIC  9(16).        *>ƒJ[ƒh”Ô†
             05        ()-A0140    PIC  9(08) COMP-3. *>—˜—p“ú
             05        ()-A0150    PIC  9(08) COMP-3. *>Žó•t“ú
             05        ()-A0160    PIC  9(08) COMP-3. *>Œvã“ú
             05        ()-A0170    PIC  9(02).        *>”­¶“X
             05        ()-A0180    PIC  X(10).        *>‰Á–¿“X‚m‚
             05        ()-G0190.                      *>‚o‚n‚r’[––î•ñ
               07      ()-A0190    PIC  9(04).        *>ƒŒƒW‚m‚
               07      ()-A0200    PIC  9(05).        *>Žæˆø‚m‚
             05        ()-A0201    REDEFINES    ()-G0190
                                   PIC  X(09).        *>‚b‚c’[––î•ñ
 	     05        ()-G0210.                      *>‰ÛŒW
 	       07      ()-T0210.                      *>ˆµ‰Û
 	         09    ()-A0210    PIC  9(02).        *>ˆµ
                 09    ()-A0220    PIC  9(02).        *>‰Û
               07      ()-A0230    PIC  9(02).        *>ŒW
             05        ()-A0240    PIC  9(03).        *>ÃƒR[ƒh
             05        ()-A0241    PIC  9(13).        *>’ñŒg”„ã’Ê”Ô
             05        ()-A0243    PIC  9(02).        *>s”
             05        ()-A0245    PIC  9(02).        *>s‚m‚
             05        ()-O0500.                      *>s–¾×
               07      ()-T0500.                      *>•iŒQƒR[ƒh
                 09    ()-A0500    PIC  9(02).        *>•”–å
                 09    ()-A0510    PIC  9(03).        *>•iŒQ
                 09    ()-A0520    PIC  9(01).        *>‚b^‚c
               07      ()-T0530.                      *>•i–¼ƒR[ƒh
                 09    ()-A0530    PIC  9(01).        *>ƒtƒƒA[
                 09    ()-A0540    PIC  9(03).        *>ƒR[ƒh
                 09    ()-A0550    PIC  9(01).        *>‚b^‚c
               07      ()-A0560    PIC  N(20).        *>¿‹Š¿Žš
               07      ()-A0565    PIC  X(04).        *>•i–¼×XƒR[ƒh
               07      ()-A0570    PIC  X(01).        *>¿‹õˆøƒR[ƒh
               07      ()-A0580    PIC  9(07)V9(02)
                                              COMP-3. *>”—Ê
               07      ()-A0590    PIC S9(07) COMP-3. *>’P‰¿ 
               07      ()-A0600    PIC S9(11) COMP-3. *>‹àŠz
               07      ()-A0610    PIC  X(01).        *>•àˆøœŠO‹æ•ª
               07      ()-A0620    PIC S9(09) COMP-3. *>•àˆøŠz
               07      ()-A0630    PIC  X(01).        *>Å‹æ•ª
               07      ()-A0640    PIC  X(01).        *>Š·‹à‹æ•ª
               07      ()-A0650    PIC  X(01).        *>ŒŽ—ßƒR[ƒh
               07      ()-A0660    PIC S9(09) COMP-3. *>•àˆø‘OÁ”ïÅ
               07      ()-T0670.                      *>•àˆø^ƒ|ƒCƒ“ƒgî•ñ
                 09    ()-S0670.                      *>’Êí•ª
                   11  ()-A0670    PIC  99V99 COMP-3. *>•àˆø^ƒ|ƒCƒ“ƒg—¦
                   11  ()-A0680    PIC S9(11) COMP-3. *>•àˆøŠz^ƒ|ƒCƒ“ƒg”
                 09    ()-S0690.                      *>ƒ{[ƒiƒX•ª 
                   11  ()-A0690    PIC  99V99 COMP-3. *>•àˆø^ƒ|ƒCƒ“ƒg—¦ 
                   11  ()-A0700    PIC S9(11) COMP-3. *>•àˆøŠz^ƒ|ƒCƒ“ƒg”
               07      ()-A0710    PIC S9(11) COMP-3. *>œŠOˆÂ•ªŠz
               07      ()-A0720    PIC  9(02).        *>œŠOˆÂ•ª‡ˆÊ
               07      FILLER      PIC  X(07).        *>—\”õ
