000100*       QJA020P           LEVEL=1        DATE=99.01.31
000200******************************************************
000300*            ﾊﾟﾗﾒｰﾀｴﾘｱ                               *
000400*                            DATA-WRITTEN  99/01/31  *
000500*----------------------------------------------------*
000600*             修　正　履　歴                         *
000700*  管理ＮＯ　　　修正理由　　　　　担当者　修正日付　*
000900******************************************************
001000     03  QJA20010-G0010.                     *>入力領域
001100       05  QJA20010-A0010      PIC 9(001).   *>ＡＣＳ／非ＡＣＳ区分
001200       05  QJA20010-A0020      PIC 9(002).   *>処理区分      
001500       05  QJA20010-A0030      PIC X(008).   *>郵便番号  
001700       05  QJA20010-T0040.                   *>漢字住所
001800         07  QJA20010-A0040    PIC N(025).   *>県名～字丁目
001900         07  QJA20010-A0050    PIC N(015).   *>番地
002000         07  QJA20010-A0060    PIC N(032).   *>方書
002100         07  QJA20010-A0070    PIC N(030).   *>勤務先
002200         07  QJA20010-A0080    PIC N(015).   *>所属部課
002300       05  QJA20010-T0090.                   *>カナ住所
002400         07  QJA20010-A0090    PIC X(008).   *>県名
002500         07  QJA20010-A0100    PIC X(042).   *>市区郡～字丁目
002600         07  QJA20010-A0110    PIC X(015).   *>番地
002700         07  QJA20010-A0120    PIC X(032).   *>方書
002800         07  QJA20010-A0130    PIC X(030).   *>勤務先
002900     03  QJA20010-G0140.                     *>出力領域
003000       05  QJA20010-A0140      PIC 9(001).   *>復帰コード
003100       05  QJA20010-A0150      PIC 9(001).   *>留置フラグ
003200       05  QJA20010-A0160      PIC X(009).   *>郵便番号 
003300       05  QJA20010-T0170.                   *>漢字住所
003400         07  QJA20010-A0170    PIC N(014).   *>住所１
003500         07  QJA20010-A0180    PIC N(020).   *>住所２　　　　
003600         07  QJA20010-A0190    PIC N(020).   *>住所３　　　
003700         07  QJA20010-A0200    PIC N(020).   *>住所４　　　
003800       05  QJA20010-T0210.                   *>カナ住所
003900         07  QJA20010-A0210    PIC X(008).   *>住所１
004000         07  QJA20010-A0220    PIC X(026).   *>住所２　　　　
004100         07  QJA20010-A0230    PIC X(032).   *>住所３　　　
004200         07  QJA20010-A0240    PIC X(032).   *>住所４　　　
004300         07  QJA20010-A0250    PIC X(030).   *>住所５