000100*       QJA010P           LEVEL=1        DATE=99.01.31
000200******************************************************
000300*            ﾊﾟﾗﾒｰﾀｴﾘｱ                               *
000400*                            DATA-WRITTEN  99/01/31  *
000500*----------------------------------------------------*
000600*             修　正　履　歴                         *
000700*  管理ＮＯ　　　修正理由　　　　　担当者　修正日付　*
000800******************************************************
000900     03  QJA10010-G0010.
001000       05  QJA10010-A0010        PIC 9(001).   *>ACS/非ACS区分
001100       05  QJA10010-A0020        PIC 9(001).   *>処理区分
001200     03  QJA10010-G0030.
001300       05  QJA10010-A0030        PIC X(008).   *>郵便番号         
001400       05  QJA10010-A0040        PIC X(009).   *>ハイフン付郵便番号
001500     03  QJA10010-G0050.
001600       05  QJA10010-A0050        PIC 9(001).   *>復帰コード