000000*       QJAB040P             LEVEL=1     DATE=99.02.03
000100******************************************************
000200*            Êß×Ò°À´Ø±                               *
000300*                            DATA-WRITTEN  92/9/03   *
000400******************************************************
000500     03  QJAB040P-SEG.
000600       05  QJAB040P-G0010.
000700         07  QJAB040P-A0010   PIC  9(001). *> ‚`‚b‚r^”ñ‚`‚b‚r‹æ•ª
000800         07  QJAB040P-A0020   PIC  9(001). *> ˆ—‹æ•ª
000900         07  QJAB040P-A0030   PIC  X(016). *> ŒûÀ”Ô†
001000         07  QJAB040P-A0040   PIC  X(001). *> Ž}”Ôƒtƒ‰ƒO
001100       05  QJAB040P-G0050.
001200         07  QJAB040P-A0050   PIC  9(001). *> •œ‹AƒR[ƒh
001300         07  QJAB040P-A0060   PIC  9(001). *> Œ‡”Ôƒtƒ‰ƒO
001400         07  QJAB040P-A0070   PIC  9(001). *> ‚XE‚P‚SŒ…‚b^‚c
001500         07  QJAB040P-A0080   PIC  9(001). *> ‚P‚UŒ…‚b^‚c
001600         07  QJAB040P-T0090.               *> Œ‹‰ÊŒûÀ”Ô†
001700           09  QJAB040P-A0090 PIC  X(005). *> ‚P‚OŒ…ŒûÀ”Ô†—\”õ
001800           09  QJAB040P-A0100 PIC  X(010). *> ‚P‚OŒ…ŒûÀ”Ô†
001900           09  QJAB040P-A0110 PIC  X(001). *> ‚P‚OŒ…ŒûÀ”Ô†—\”õ
002000         07  QJAB040P-T0120   REDEFINES    QJAB040P-T0090.
002100           09  QJAB040P-A0120 PIC  X(016). *> ‚P‚UŒ…ŒûÀ”Ô†
