000100*       QJAB030P               LEVEL=1              DATE=99.02.03
000200******************************************************************
000300*            ﾊﾟﾗﾒｰﾀｴﾘｱ                                           *
000400*                                        DATA-WRITTEN  99/02/03  *
000410*----------------------------------------------------------------*
000420*    　　　　　 修　正　履　歴                                   *
000430*  管理NO　　　　　修正理由　　　　　　　　　　担当者　修正日付  *
000450******************************************************************
000600     03  QJAB030P-G0010.                     *>入力領域
000700       05  QJAB030P-A0010      PIC 9(001).   *>ＡＣＳ／非ＡＣＳ区分
000800       05  QJAB030P-A0020      PIC 9(012).   *>会員識別番号
000900       05  QJAB030P-A0030      PIC 9(001).   *>枝番
000910       05  QJAB030P-A0031      PIC 9(006).   *>カード区分
001000     03  QJAB030P-G0040.                     *>出力領域
001100       05  QJAB030P-A0040      PIC 9(001).   *>復帰コード
001200       05  QJAB030P-A0050      PIC 9(016).   *>外部会員番号
