      *8...........2.........3.........4.........5........6........7.........8
      *    QMA009
      ****************************************************************
      *                抽選候補会員ファイル                          *
      *                             DATA-WRITTEN  06.02.07           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO            修正理由             担当者   修正日付   *
      ****************************************************************
            03        ()-SEG.                                *>抽選利用状況
              05      ()-KEY.                                *>キー項目
                07    ()-KIGYOUCD       PIC  9(004).         *>企業コード
                07    ()-SUBRANGEKEY    PIC  9(004).         *>ロケーション
                07    ()-NAIBUKAIINNO   PIC  9(008).         *>内部会員番号
              05      FILLER            PIC  X(003).         *>予備
              05      ()-CR             PIC  X(001).         *>改行コード
