      *8...........2.........3.........4.........5........6........7.........8
      *    QMA005
      ****************************************************************
      *                （ホスト用）キャンペーンマスタファイル        *
      *                             DATA-WRITTEN  06.02.07           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO            修正理由             担当者   修正日付   *
      ****************************************************************
            03        ()-SEG.                               *>
              05      ()-G0010.                             *>キー項目
                07    ()-T0010.                             *>キャンＩＤ
                  09  ()-A0010                PIC  9(002).  *>ＩＤ１
                  09  ()-A0020                PIC  9(003).  *>ＩＤ２
                  09  ()-A0030                PIC  9(001).  *>親子連番
              05      ()-G0040.                             *>ポ付与条件
                07    ()-T0040   OCCURS  15.                *>対象テーブル
                  09  ()-A0040                PIC  X(002).  *>対象カード
                07    ()-A0050                PIC  X(001).  *>抽選有無
                07    ()-T0060   OCCURS   3.                *>抽選テーブル
                  09  ()-A0060                PIC  X(001).  *>抽選区分
                  09  ()-A0070                PIC  9(007).  *>抽選人数
                  09  ()-A0080                PIC  9(009).  *>付与ポイント
              05      ()-G0090.                             *>ポイント情報
                07    ()-A0090                PIC  X(001).  *>ポ負担区分
                07    ()-A0100                PIC  9(002).  *>ポ負担店
                07    ()-A0110                PIC  9(003).  *>ポ負担割合
                07    ()-A0120                PIC  N(020).  *>ポ名称
              05      ()-G0130.                             *>キャン情報
                07    ()-A0130                PIC  9(006).  *>ポ付与月
              05      FILLER                  PIC  X(010).  *>予備
