      *8...........2.........3.........4.........5........6........7.........8
      *    QMA008
      ****************************************************************
      *                ポイント付与会員ファイル                      *
      *                             DATA-WRITTEN  06.02.07           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO            修正理由             担当者   修正日付   *
      ****************************************************************
            03        ()-SEG.                               *>候補会員レコード
              05      ()-G0010.                             *>キー項目
                07    ()-A0010                PIC  9(006).  *>ポイント付与月
                07    ()-T0020.                             *>キャンＩＤ 
                  09  ()-A0020                PIC  9(002).  *>ＩＤ１
                  09  ()-A0030                PIC  9(003).  *>ＩＤ２
                  09  ()-A0040                PIC  9(001).  *>親子連番
                07    ()-A0050                PIC  9(004).  *>企業コード
                07    ()-A0060                PIC  9(004).  *>ロケーション
                07    ()-A0070                PIC  9(008).  *>内部会員番号
                07    ()-A0080                PIC  9(001).  *>利用者コード
              05      ()-G0090.                             *>会員情報
                07    ()-A0090                PIC  X(016).  *>カード番号
                07    ()-G0100.                             *>漢字氏名
                  09  ()-A0100                PIC  N(015).  *>漢字氏名
              05      ()-G0110.                             *>集計情報
                07    ()-A0110                PIC  9(013).  *>利用額
                07    ()-A0120                PIC  9(005).  *>利用回数
                07    ()-A0130                PIC  9(003).  *>利用日数
              05      ()-G0130.                             *>抽選情報
                07    ()-A0140                PIC  X(001).  *>抽選結果
                07    ()-A0150                PIC  X(001).  *>落選理由
                07    ()-A0160                PIC  9(007).  *>乱数
                07    ()-A0170                PIC  9(009).  *>付与ポイント
              05      ()-G0180.                             *>管理情報
                07    ()-A0180                PIC  9(008).  *>集計日
                07    ()-A0190                PIC  9(008).  *>抽選日
                07    ()-A0200                PIC  9(008).  *>ポイント付与日
              05      FILLER                  PIC  X(012).  *>予備
