      *8...........2.........3.........4.........5........6........7.........8
      *    QMA004
      ****************************************************************
      *                キャンペーン更新情報ファイル                  *
      *                             DATA-WRITTEN  06.02.07           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO            修正理由             担当者   修正日付   *
      ****************************************************************
            03        ()-SEG.                               *>レコード
              05      ()-PRMPCANID1           PIC  X(002).  *>キャンID１
              05      ()-PRMPCANID2           PIC  X(003).  *>キャンID１
              05      FILLER                  PIC  X(004).  *>予備
              05      ()-CR                   PIC  X(001).  *>改行コード
