      *8...........2.........3.........4.........5........6........7.........8
      *    QMA006
      ****************************************************************
      *                エントリー会員情報ファイル                    *
      *                             DATA-WRITTEN  06.02.07           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO            修正理由             担当者   修正日付   *
      ****************************************************************
            03        ()-SEG.                               *>
              05      ()-PRMPCANID1           PIC  X(002).  *>キャンペーンID１
              05      ()-PRMPCANID2           PIC  X(003).  *>キャンペーンID２
              05      ()-PRMOYOKORENBAN       PIC  9(001).  *>親子連番
              05      ()-PRMKIGYOUCD          PIC  X(004).  *>企業コード
              05      ()-PRMSUBRANGEKEY       PIC  X(004).  *>サブレンジキー
              05      ()-PRMNAIBUKAIINNO      PIC  X(008).  *>内部会員番号
              05      ()-RIYOUSHACD           PIC  X(001).  *>利用者コード
              05      FILLER                  PIC  X(006).  *>予備
              05      ()-CR                   PIC  X(001).  *>改行コード
