      *8...........2.........3.........4.........5........6........7.........8
      *    QMA001
      ****************************************************************
      *                リボ会員情報削除対象ファイル                  *
      *                             DATA-WRITTEN  06.02.07           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO            修正理由             担当者   修正日付   *
      ****************************************************************
            03        ()-SEG.                               *>レコード
              05      ()-PRMKIGYOUCD          PIC  X(004).  *>企業コード
              05      ()-PRMSUBRANGEKEY       PIC  X(004).  *>サブレンジキー
              05      ()-PRMNAIBUKAIINNO      PIC  X(008).  *>内部会員番号
              05      ()-PRMSEIKYUTSUKI       PIC  X(006).  *>請求年月
              05      ()-RIYOUSHACD           PIC  X(001).  *>利用者コード
              05      ()-REVSMAITSUKI         PIC  X(001).  *>リボS毎月分
              05      ()-STRDATE              PIC  X(014).  *>登録日
              05      ()-CR                   PIC  X(001).  *>改行コード
