      *8...........2.........3.........4.........5........6........7.........8
      *    QMA002
      ****************************************************************
      *                オールリボ会員ファイル                        *
      *                             DATA-WRITTEN  06.02.08           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO            修正理由             担当者   修正日付   *
      ****************************************************************
            03        ()-SEG.                               *>
              05      ()-G0010.                             *>キー項目
                07    ()-A0010      PIC  9(004).            *>企業コード
                07    ()-A0020      PIC  9(004).            *>ロケーション
                07    ()-A0030      PIC  9(008).            *>内部会員番号
                07    ()-A0040      PIC  9(006).            *>請求年月
              05      ()-G0050.                             *>オールリボ情報
                07    ()-A0050      PIC  9(001).            *>利用者コード
                07    ()-A0060      PIC  X(001).            *>リボＳ毎月分
                07    ()-A0070      PIC  9(008).            *>リボ登録日
              05      ()-G0080.                             *>管理情報
                07    ()-A0080      PIC  9(008).            *>作成日
              05       FILLER       PIC  X(010).            *>予備
