      *8...........2.........3.........4.........5........6........7.........8
      *    QMA007
      ****************************************************************
      *                ’Š‘I—˜—pó‹µƒtƒ@ƒCƒ‹                          *
      *                             DATA-WRITTEN  06.02.07           *
      *--------------------------------------------------------------*
      *                  C  ³  —š  —ð                              *
      *   ŠÇ—NO            C³——R             ’S“–ŽÒ   C³“ú•t   *
      ****************************************************************
            03        ()-SEG.                                *>’Š‘I—˜—pó‹µ
              05      ()-KEY.                                *>ƒL[€–Ú
                07    ()-PFUYOTSUKI     PIC  9(006).         *>ƒ|ƒCƒ“ƒg•t—^ŒŽ
                07    ()-PCANID.                             *>ƒLƒƒƒ“‚h‚c
                  09  ()-PCANID1        PIC  9(002).         *>‚h‚c‚P
                  09  ()-PCANID2        PIC  9(003).         *>‚h‚c‚Q
                  09  ()-OYOKORENBAN    PIC  9(001).         *>eŽq˜A”Ô
                07    ()-KIGYOUCD       PIC  9(004).         *>Šé‹ÆƒR[ƒh
                07    ()-SUBRANGEKEY    PIC  9(004).         *>ƒƒP[ƒVƒ‡ƒ“
                07    ()-NAIBUKAIINNO   PIC  9(008).         *>“à•”‰ïˆõ”Ô†
                07    ()-RIYOUSHACD     PIC  X(001).         *>—˜—pŽÒƒR[ƒh
                07    ()-DENPYOUKBN     PIC  X(001).         *>“`•[Ží•Ê‹æ•ª
              05      ()-SYUKEI.                             *>WŒvî•ñ
                07    ()-RIYOUGAKU      PIC  9(011).         *>—˜—pŠz
                07    ()-RIYOUKAISU     PIC  9(007).         *>—˜—p‰ñ”
              05      FILLER            PIC  X(032).         *>—\”õ
