      ****************************************************************
      *    人事マスタファイル             ID:QPS001                  *
      *          RL：120Byte                  DATA-WRITTEN  10.08.11 *
      *--------------------------------------------------------------*
      *            修  正  履  歴                                    *
      *    管理NO            修正理由              担当者  修正日付  *
      *                                                              *
      ****************************************************************
           03  ()-DATA.
               05  FILLER               PIC X(27).
               05  ()-KEY1.
                   07  ()-SYOZOKUTEN    PIC X(03). *>所属店コード
                   07  ()-BUMONCODE     PIC X(06). *>所属部門コード
               05  FILLER               PIC X(28).
               05  ()-KEY2.
                   07  ()-BUMONMEIKANA  PIC X(12). *>部門名カナ
               05  FILLER               PIC X(44).
 