      ****************************************************************
      *    部門マスタファイル             ID:QPS002                  *
      *          RL：33Byte                   DATA-WRITTEN  10.08.11 *
      *--------------------------------------------------------------*
      *            修  正  履  歴                                    *
      *    管理NO            修正理由              担当者  修正日付  *
      *                                                              *
      ****************************************************************
           03  ()-TABLE.
               05  ()-KEY.
                   07  ()-PRMMISECD        PIC X(03). *>店コード
                   07  ()-PRMBUMONCD       PIC X(06). *>部門コード
               05  ()-BUMONNM              PIC X(24). *>部門名称
