      *8...........2.........3.........4.........5........6........7..
      *    QSS010
      ****************************************************************
      *                自振返戻テーブル                              *
      *                             DATA-WRITTEN  99.01.24           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO   修正理由                      担当者   修正日付   *
      *   000001   レイアウト変更の為            FIP      99/03/06   *
      ****************************************************************    
           03    ()-SEG.                           *>自振返戻テーブル
             05  ()-PRMKigyouCd        PIC  X(04). *>企業コード
             05  ()-PRMSubRangeKey     PIC  X(04). *>サブレンジキー
             05  ()-PRMNaibukaiinNo    PIC  X(08). *>内部会員番号
             05  ()-SeikyuNengetsu     PIC  9(06). *>請求年月
             05  ()-GinkouCd           PIC  X(04). *>銀行コード
             05  ()-ShiTenCd           PIC  X(05). *>支店コード
             05  ()-YokinShubetsu      PIC  X(01). *>預金種別
             05  ()-KouzaNo            PIC  X(08). *>口座番号
             05  ()-KouzaMeiginin      PIC  X(30). *>口座名義人
             05  ()-HurikaeKekkaCd     PIC  X(01). *>振替結果コード
             05  ()-YuchoSaiHatu       PIC  X(01). *>郵貯再発行回数
             05  ()-HOSTSHORIYMD       PIC  X(08). *>ホスト処理日
             05  ()-HOSTSHORITIME      PIC  X(06). *>ホスト処理時刻
             05  ()-SVRKOUSHINYMD      PIC  9(08). *>サーバ更新日
