000000*       QSV999              LEVEL=3        DATE=03.05.26
000100******************************************************************
000200*　　　　　　年会費告知マスタ                                    *
000300*----------------------------------------------------------------*
000400*　障害NO　修正履歴（内容）　　　　　　　　　　担当者　修正日付　*
000500*----------------------------------------------------------------*
000600*QXXXXXXX-XXX  ＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸ  XX/XX/XX  *
000700******************************************************************
000800     03  QSV730-SEG.                               *>会員レコード
000900       05  QSV730-G0010.                           *>キー部
001000         07  QSV730-T0010.                         *>ロケーションキー
001100           09  QSV730-A0010    PIC S9(04) COMP-3.  *>企業コード
001200           09  QSV730-A0020    PIC S9(04) COMP-3.  *>サブレンジキー
001300         07  QSV730-A0030      PIC S9(08) COMP-3.  *>内部会員番号
001400       05  QSV730-G0040.                           *>会員情報
001500         07  QSV730-A0040      PIC  9(07) COMP-3.  *>入会日ドＳＥＱ
001600         07  QSV730-A0050      PIC  9(05) COMP-3.  *>有効期限
001700         07  QSV730-A0060      PIC  9(05) COMP-3.  *>初回請求年月（予定）
001800         07  QSV730-A0070      PIC  9(07).         *>退会予定日
001900         07  QSV730-A0080      PIC S9(07) COMP-3.  *>年会費
002000         07  QSV730-A0090      PIC  X(01).         *>利用区分
002100         07  QSV730-A0100      PIC S9(11) COMP-3.  *>年間利用額
002200       05  QSV730-G0110.                           *>案内状情報
002300         07  QSV730-A0110      PIC  9(03) COMP-3.  *>最新ＳＥＱ
002400         07  QSV730-T0120    OCCURS  6.            *>案内状作成テーブル
002500           09  QSV730-A0120    PIC  9(07) COMP-3.  *>作成日
002600       05  QSV730-G0130.                           *>案内状情報
002700         07  QSV730-A0130      PIC  X(01).         *>告知フラグ
002800         07  QSV730-A0140      PIC  X(01).         *>同意フラグ
002900         07  QSV730-A0150      PIC  9(01).         *>有効ＩＤＸ
003000         07  QSV730-T0160    OCCURS  6.            *>返信状況テーブル
003100           09  QSV730-A0160    PIC  X(01).         *>返信内容
003200           09  QSV730-A0170    PIC  9(07) COMP-3.  *>返信日
003300       05  QSV730-G0180.                           *>処理情報
003400         07  QSV730-A0180      PIC  9(01).         *>請求有無フラグ
003500         07  QSV730-A0190      PIC  9(01).         *>期限到来フラグ
003600         07  QSV730-A0200      PIC  9(05) COMP-3.  *>初回請求年月
003700         07  QSV730-A0210      PIC  9(07) COMP-3.  *>拒否退会年月日
003800       05  QSV730-G0220.                           *>レコード情報
003900         07  QSV730-A0220      PIC  9(07) COMP-3.  *>作成日
004000         07  QSV730-A0230      PIC  9(07) COMP-3.  *>更新日
004100         07  QSV730-A0240      PIC  9(04) COMP.    *>セションカウンタ
004200       05  FILLER          PIC  X(13).         *>予備
