      *8...........2.........3.........4.........5........6........7.........8  
      *    QSVX17
      ****************************************************************
      *                     サーバ向け処理コントロールファイル       *
      *                             DATA-WRITTEN  99.01.14           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO            修正理由             担当者   修正日付   * 
      ****************************************************************    
           03            ()-SEG.                         *>処理コントロール
             05          ()-G0010.                       *>請求年月
               07        ()-A0010            PIC  9(04). *>年
               07        ()-A0020            PIC  9(02). *>月
             05          ()-G0030.                       *>締年月日
               07        ()-A0030            PIC  9(04). *>年
               07        ()-A0040            PIC  9(02). *>月
               07        ()-A0050            PIC  9(02). *>日
             05          ()-G0060.                       *>処理年月日
               07        ()-A0060            PIC  9(04). *>年
               07        ()-A0070            PIC  9(02). *>月
               07        ()-A0080            PIC  9(02). *>日
             05          ()-A0090            PIC  9(01). *>処理日曜日
             05          ()-G0090.                       *>計上年月日
               07        ()-A0100            PIC  9(04). *>年
               07        ()-A0110            PIC  9(02). *>月
               07        ()-A0120            PIC  9(02). *>日
             05          ()-G0130.                       *>売掛金締年
               07        ()-A0130            PIC  9(04). *>年
               07        ()-A0140            PIC  9(02). *>月
             05          ()-G0150.                       *>立替締年月日
               07        ()-A0150            PIC  9(04). *>年
               07        ()-A0160            PIC  9(02). *>月
               07        ()-A0170            PIC  9(02). *>日
             05          ()-A0180            PIC  X(01). *>請求状態フラグ
             05          FILLER              PIC  X(34). *>予備 
