      *8...........2.........3.........4.........5........6........7.........8
      *    QTA100
      ****************************************************************
      *                プレミアム会員集計情報                        *
      *                             DATA-WRITTEN  99.01.12           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO            修正理由             担当者   修正日付   *
      ****************************************************************
           03        ()-SEG.                              *>集計レコード
             05      ()-G0010.                            *>キー項目
               07    ()-T0010.                            *>ロケーションキー 
                 09  ()-A0010      PIC  9(004)  COMP-3.   *>企業コード
                 09  ()-A0020      PIC  9(004)  COMP-3.   *>サブレンジキー
               07    ()-A0030      PIC  9(008)  COMP-3.   *>内部会員番号
               07    ()-A0040      PIC  9(005)  COMP-3.   *>集計年月
             05      ()-G0050.                            *>毎月集計情報
               07    ()-A0050      PIC  X(001).           *>状態フラグ
               07    ()-T0060.                            *>累積額内訳
                 09  ()-A0060      PIC S9(013)  COMP-3.   *>総額
                 09  ()-A0070      PIC S9(013)  COMP-3.   *>対象商品
                 09  ()-A0080      PIC S9(013)  COMP-3.   *>対象外商品
                 09  ()-A0090      PIC S9(013)  COMP-3.   *>消費税
                 09  ()-A0100      PIC S9(013)  COMP-3.   *>頭金
               07    ()-A0110      PIC  9(005)  COMP-3.   *>利用件数
               07    ()-A0120      PIC  9(003)  COMP-3.   *>来店日数
               07    ()-T0130.                            *>集計用項目
                 09  ()-A0130      PIC  9(002).           *>発生店
                 09  ()-A0140      PIC  9(007)  COMP-3.   *>計上日
                 09  ()-A0150      PIC  9(002).           *>支払方法
             05      ()-G0200.                            *>管理情報
               07    ()-A0200      PIC  9(007)  COMP-3.   *>作成日
             05      FILLER        PIC  X(013).           *>予備
