      *8...........2.........3.........4.........5........6........7.........8
      *    QTA200
      ****************************************************************
      *                プレミアム会員集計情報                        *
      *                             DATA-WRITTEN  2005.03.17         *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO            修正理由             担当者   修正日付   *
      ****************************************************************
           03        ()-SEG.                                 *>会員レコード
             05      ()-G0010.                               *>キー項目
               07    ()-T0010.                               *>ロケーションキー
                 09  ()-A0010      PIC  9(004)     COMP-3.   *>企業コード
                 09  ()-A0020      PIC  9(004)     COMP-3.   *>サブレンジキー
               07    ()-A0030      PIC  9(008)     COMP-3.   *>内部会員番号
               07    ()-A0040      PIC  9(005)     COMP-3.   *>集計年月
             05      ()-G0050.                               *>会員情報
               07    ()-A0050      PIC  9(002).              *>管理店
               07    ()-A0060      PIC  X(006).              *>カード区分
               07    ()-T0070.                               *>集計中項目
                 09  ()-A0070      PIC  9(003)     COMP-3.   *>集計中年度
                 09  ()-A0080      PIC S9(013)     COMP-3.   *>累積額
                 09  ()-A0090      PIC  9(003)     COMP-3.   *>来店日数
                 09  ()-A0100      PIC  9(005)     COMP-3.   *>利用件数
             05      ()-G0110                      OCCURS 5. *>判定履歴
               07    ()-A0110      PIC  X(001).              *>プレミアム区分
               07    ()-A0120      PIC S9(013)     COMP-3.   *>累積額
               07    ()-A0130      PIC  9(003)     COMP-3.   *>来店日数
               07    ()-A0140      PIC  9(005)     COMP-3.   *>利用件数
               07    ()-A0150      PIC  X(004).              *>判定時ステータス
               07    ()-A0160      PIC  9(007)     COMP-3.   *>判定日
             05      ()-G0200.                               *>管理情報
               07    ()-A0200      PIC  9(007)     COMP-3.   *>作成日
               07    ()-A0210      PIC  9(007)     COMP-3.   *>更新日
             05      FILLER        PIC  X(011).                *>予備
