      *8...........2.........3.........4.........5........6........7.........8
      *    QTS070
      ****************************************************************
      *                ‰Á–¿“XŒ´“`ƒtƒ@ƒCƒ‹                            *
      *                             DATA-WRITTEN  99.02.05           *
      *--------------------------------------------------------------*
      *                  C  ³  —š  —ð                              *
      *   ŠÇ—NO            C³——R             ’S“–ŽÒ   C³“ú•t   *
      *   V0101          ‰Á–¿“XŒ´“`Ú²±³Ä•ÏX     ANX      2000/07/27 *
      *   V0102          ‰Á–¿“XŒ´“`Ú²±³Ä•ÏX     NBC      2002/11/27 *
      ****************************************************************
          03           ()-SEG.                         *>‰Á–¿“XŒ´“`ƒtƒ@ƒCƒ‹
             05        ()-PRM.                         *>ƒL[î•ñ
               07      ()-PRMURITUUBAN     PIC  9(13). *>”„ã’Ê”Ôi‚Tj
             05        ()-URI.                         *>”„ãî•ñ
               07      ()-URITORIHIKIA     PIC  9(02). *>Žæˆø‚`
               07      ()-URITORIHIKIB     PIC  9(01). *>Žæˆø‚a
               07      ()-URITORIHIKIC     PIC  9(01). *>Žæˆø‚b
               07      ()-URICARDNO        PIC  9(16). *>ƒJ[ƒh”Ô†
               07      ()-URIRIYOUBI       PIC  9(08). *>—˜—p“ú
               07      ()-URIUKETSUKEBI    PIC  9(08). *>Žó•t“ú
               07      ()-URIKEIJYOUBI     PIC  9(08). *>Œvã“úi‚Pj
               07      ()-URISHIHARAIHOHO  PIC  9(02). *>Žx•¥•û–@
               07      ()-URIBUNKATSUKAISU PIC  9(03). *>•ªŠ„‰ñ”
               07      ()-URIRIYOUKNG      PIC S9(09)  *>—˜—p‹àŠz
                                           SIGN LEADING SEPARATE.
               07      ()-URIURIAGEKNG     PIC S9(09)  *>”„ã‹àŠz
                                           SIGN LEADING SEPARATE.
               07      ()-URIZEISOURYOU    PIC S9(07)  *>Å‘——¿
                                           SIGN LEADING SEPARATE.
               07      ()-URIURIAGEGOUKEI  PIC S9(09)  *>”„ã‡Œv
                                           SIGN LEADING SEPARATE.
               07      ()-URIWARIBIKIGAKU  PIC S9(07)  *>Š„ˆøŠz
                                           SIGN LEADING SEPARATE.
               07      ()-URIGAITESURYOU   PIC S9(09)  *>ŽžŠÔŠOŽè”—¿
                                           SIGN LEADING SEPARATE.
               07      ()-URISHOUNINNO     PIC  9(07). *>³”F”Ô†
               07      ()-URIKOKUNAIKAIGAI PIC  9(01). *>‘“àŠCŠOŽ¯•Ê‹æ•ª
             05        ()-KAI.                         *>ŠCŠO—˜—pî•ñ
               07      ()-KAITUUKAGAKU     PIC S9(10)V9(03) *>Œ»’n’Ê‰ÝŠz
                                           SIGN LEADING SEPARATE.
               07      ()-KAIKANSANRATE    PIC S9(06)V9(07) *>Š·ŽZƒŒ[ƒg
                                           SIGN LEADING SEPARATE.
               07      ()-KAIKANSANBI      PIC  9(08). *>Š·ŽZ“ú
               07      ()-KAITOSHIMEI      PIC  X(13). *>‰Á–¿“X“sŽs–¼
               07      ()-KAITUUKAKOSHOU   PIC  X(25). *>’Ê‰ÝŒÄÌ
               07      ()-KAITUUKACD       PIC  X(03). *>’Ê‰ÝƒR[ƒh
               07      ()-KAISHUUCD        PIC  X(03). *>BƒR[ƒh
               07      ()-KAIKUNICD        PIC  X(03). *>‘ƒR[ƒh
             05        ()-TKS.                         *>’ñŒgæî•ñ
               07      ()-TKSSHOUKAINO1    PIC  X(23). *>’ñŒgæÆ‰ï”Ô†‚P
               07      ()-TKSSHOUKAINO2    PIC  X(23). *>’ñŒgæÆ‰ï”Ô†‚Q
               07      ()-TKSKAMEITENNO    PIC  X(15). *>‰Á–¿“X”Ô†
               07      ()-TKSKAMEITENMEI1  PIC  X(25). *>‰Á–¿“X–¼Ì‚P
               07      ()-TKSKAMEITENMEI2  PIC  X(25). *>‰Á–¿“X–¼Ì‚Q
               07      ()-TKSGYOUSHUCD     PIC  X(05). *>‹ÆŽíƒR[ƒh
               07      ()-TKSPOSENTRYCD    PIC  X(02). *>‚o‚n‚rƒGƒ“ƒgƒŠ[ƒR[ƒh
               07      ()-TKSBONUSHYOUJI   PIC  X(01). *>ƒ{[ƒiƒX•\Ž¦
             05        ()-KJK.                         *>ŒvãŽž‰ïˆõî•ñ
               07      ()-KJKENTRYKEY.                 *>ƒGƒ“ƒgƒŠ[ƒL[
                 09    ()-KJKLOCATION.                 *>ƒƒP[ƒVƒ‡ƒ“ƒL[
                   11  ()-KJKKIGYOUCD      PIC  9(04). *>Šé‹ÆƒR[ƒhi‚Qj
                   11  ()-KJKSUBRANGEKEY   PIC  9(04). *>ƒTƒuƒŒƒ“ƒWƒL[i‚Rj
                 09    ()-KJKNAIBUKAIINNO  PIC  9(08). *>“à•”‰ïˆõ”Ô†i‚Sj
               07      ()-KJKKANRITEN      PIC  9(02). *>ÂŒ ŠÇ—“X
               07      ()-KJKCARDKBN       PIC  9(06). *>ƒJ[ƒh‹æ•ª
               07      ()-KJKCARDKAIINMEI  PIC  N(15). *>ƒJ[ƒh‰ïˆõŽ–¼
             05        ()-HOSTSHORIYMD     PIC  X(08). *>ƒzƒXƒgˆ—“ú
             05        ()-HOSTSHORITIME    PIC  X(06). *>ƒzƒXƒgˆ—Žž
             05        ()-SVRKOUSHINYMD    PIC  9(08). *>ƒT[ƒoXV“ú
      *--------------------------------------------------------------*
      *-V0101 2000/07/27 ITEM ADD                                   -*
      *--------------------------------------------------------------*
             05        ()-KMTINF.                      *>‰Á–¿“Xî•ñ
               07      ()-KMTCHARGEBACK    PIC  9(01). *>ƒ`ƒƒ[ƒWƒoƒbƒN‹æ•ª
               07      ()-KMTKJYAGOU       PIC  N(20). *>‰Á–¿“XŠ¿Žš‰®†
               07      ()-KMTDENPYOUKI     PIC  X(24). *>“`•[ŒŸõƒL[
               07      ()-KMTSEISANKBN     PIC  X(01). *>¸ŽZ‹æ•ª
      *--------------------------------------------------------------*
      *-V0102 2002/11/27 ITEM ADD                            START  -*
      *--------------------------------------------------------------*
               07      ()-MOTOECINDICATOR    PIC  X(01). *>MO/TO/EC INDICATOR
               07      ()-CHACTTERMINDICATOR PIC  X(01). *>C/H ACT TERM INDICATOR
               07      ()-AUTHSOURCECODE     PIC  X(01). *>AUTH SOURCE CODE
               07      ()-TCQ                PIC  X(01). *>TCQ
      *--------------------------------------------------------------*
      *-V0102 2002/11/27 ITEM ADD                            END    -*
      *--------------------------------------------------------------*
