      *8...........2.........3.........4.........5........6........7.........8  
      *    QTS120(QTA120)
      ****************************************************************
      *                扱者マスタ                                    *
      *                             DATA-WRITTEN  99.01.13           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO   修正理由                      担当者   修正日付   *
      *   000001   レイアウト変更の為            FIP      99/03/06   *
      ****************************************************************    
           03          ()-SEG.                          *>扱者マスタ
             05        ()-G0020.                        *>ＫＥＹ
               07      ()-T0020.                        *>所属店
                 09    ()-SJTMISE     PIC  X(02).       *>店
               07      ()-T0050.                        *>扱いコード
                 09    ()-BU          PIC  X(02).       *>部
                 09    ()-KA          PIC  X(02).       *>課
                 09    ()-KAKARI      PIC  X(02).       *>係
             05        ()-G0010.                        *>
               07      ()-CC          PIC  X(04).       *>Ｃ／Ｃ
             05        ()-G0080.                        *>マスター年・期
               07      ()-MSTNEN      PIC  X(04).       *>年
               07      ()-MSTKI       PIC  X(01).       *>期
             05        ()-G0100.                        *>登録年月日
               07      ()-TRKNEN      PIC  X(04).       *>年
               07      ()-TRKTUKI     PIC  X(02).       *>月
               07      ()-TRKHI       PIC  X(02).       *>日
             05        ()-G0130.                        *>更新年月日
               07      ()-KSNNEN      PIC  X(04).       *>年
               07      ()-KSNTUKI     PIC  X(02).       *>月
               07      ()-KSNHI       PIC  X(02).       *>日
             05        ()-G0160.                        *>勤務店
               07      ()-KMTMISE     PIC  X(02).       *>店
             05        ()-ATUBUMON    PIC  X(02).       *>扱部門
             05        ()-BLOCK       PIC  X(02).       *>ブロック
             05        ()-TOUZAI      PIC  X(01).       *>建装東西区分
             05        ()-TANTOUKANJI PIC  N(06).       *>担当者名漢字
             05        ()-TANTOUKANA  PIC  X(12).       *>担当者名カナ
             05        ()-G0240.                        *>削除年月日
               07      ()-SKJNEN      PIC  X(04).       *>年
               07      ()-SKJTUKI     PIC  X(02).       *>月
               07      ()-SKJHI       PIC  X(02).       *>日
             05        ()-ATUBU       PIC  N(12).       *>扱部名
             05        ()-ATUBUKA     PIC  N(12).       *>扱部課名
             05        ()-HOSTSHORIYMD         PIC  X(08).  *>ホスト処理日
             05        ()-HOSTSHORITIME        PIC  X(06).  *>ホスト処理時刻
             05        ()-SVRKOUSHINYMD        PIC  9(08).  *>サーバ更新日
