      *8...........2.........3.........4.........5........6........7.........8  
      *    QTS220
      ****************************************************************
      *                会員変更履歴テーブル                          *
      *                             DATA-WRITTEN  99.04.28           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO   修正理由                      担当者   修正日付   *
      ****************************************************************    
           03          ()-SEG.                              *>会員変更履歴
             05        ()-PRM.                              *>エントリーキー
               07      ()-PRMKIGYOUCD          PIC 9(004).  *>企業コード
               07      ()-PRMSUBRANGEKEY       PIC 9(004).  *>サブレンジキー
               07      ()-PRMNAIBUKAIINNO      PIC 9(008).  *>内部会員番号  
               07      ()-PRMSYORIYMD          PIC 9(008).  *>処理日付
               07      ()-PRMSYORITIME         PIC 9(008).  *>処理時刻
               07      ()-PRMSEQ               PIC 9(003).  *>処理時刻内通番
             05        ()-KOUMOKUNO            PIC 9(003).  *>項目番号
             05        ()-TANTCD               PIC X(007).  *>担当者コード
             05        ()-HENKOURIREKI         PIC X(127).  *>変更履歴情報
             05        ()-SVRKOUSHINYMD        PIC 9(008).  *>サーバ更新日
