      *8.1....+....2....+....3....+....4....+....5....+....6....+....7....+....8
      ****************************************************************
      *    WEB“ü‰ï\žR¸Œ‹‰ÊƒŒƒR[ƒh        ID:QTS511              *
      *          RLF27Byte                   DATA-WRITTEN  02.07.03 *
      *--------------------------------------------------------------*
      *            C  ³  —š  —ð                                    *
      *    ŠÇ—NO            C³——R              ’S“–ŽÒ  C³“ú•t  *
      *    XX-XXX  ‚m‚m‚m‚m‚m‚m‚m‚m‚m‚m‚m‚m‚m‚m‚m  ‚m‚m‚m 9999.99.99 *
      ****************************************************************
            03  QTS511-TABLE.
              05  QTS511-SEQ           PIC  9(005).
              05  QTS511-KAIINID       PIC  X(010).
              05  QTS511-ERRCODE       PIC  9(002).
              05  QTS511-KAIINKEY      PIC  X(009).
              05  QTS511-HONKAZKBN     PIC  9(001).
