      *8.1....+....2....+....3....+....4....+....5....+....6....+....7....+....8
      ****************************************************************
      *    WEBÇ≤óòópóöóÉåÉRÅ[Éh              ID:QTS532              *
      *          RLÅF171Byte                  DATA-WRITTEN  02.07.03 *
      *--------------------------------------------------------------*
      *            èC  ê≥  óö  ó                                    *
      *    ä«óùNO            èCê≥óùóR              íSìñé“  èCê≥ì˙ït  *
      *    XX-XXX  ÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇm  ÇmÇmÇm 9999.99.99 *
      ****************************************************************
            03  QTS532-TABLE.
              05  QTS532-KAIINKEY      PIC  9(009).
              05  QTS532-GROUPNO       PIC  9(007).
              05  QTS532-GRPSEQ        PIC  9(003).
              05  QTS532-RIYOUYMD      PIC  9(004).
              05  QTS532-HONNINKBN     PIC  9(001).
              05  QTS532-HARAIHOHO     PIC  N(015).
              05  QTS532-TENMEI        PIC  N(004).
              05  QTS532-SHOHINMEI     PIC  N(040).
              05  QTS532-SURYO         PIC  X(010).
              05  QTS532-RIYOUGAKU     PIC  X(012).
              05  QTS532-RIYOUYM       PIC  9(006).
              05  QTS532-MISEKBN       PIC  X(001).
