      *8.1....+....2....+....3....+....4....+....5....+....6....+....7....+....8
      ****************************************************************
      *    WEBêøãÅämîFÉåÉRÅ[Éh                ID:QTS520              *
      *          RLÅF32Byte                   DATA-WRITTEN  02.07.03 *
      *--------------------------------------------------------------*
      *            èC  ê≥  óö  ó                                    *
      *    ä«óùNO            èCê≥óùóR              íSìñé“  èCê≥ì˙ït  *
      *    XX-XXX  ÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇm  ÇmÇmÇm 9999.99.99 *
      ****************************************************************
            03  QTS520-TABLE1.
              05  QTS520-KAIINID       PIC  X(010).
              05  QTS520-KAIINKEY      PIC  9(009).
              05  QTS520-PASSWORD      PIC  9(004).
              05  QTS520-ERRCODE       PIC  X(002).
            03  QTS520-TABLE2.
              05  QTS520-KIGYOUCD      PIC  X(004).
              05  QTS520-SUBRANGEKEY   PIC  X(004).
              05  QTS520-RIYOUSHACD    PIC  X(001).
