      *8.1....+....2....+....3....+....4....+....5....+....6....+....7....+....8
      ****************************************************************
      *    WEBçáåvÉ|ÉCÉìÉgÉåÉRÅ[Éh            ID:QTS531              *
      *          RLÅF103Byte                  DATA-WRITTEN  02.07.03 *
      *--------------------------------------------------------------*
      *            èC  ê≥  óö  ó                                    *
      *    ä«óùNO            èCê≥óùóR              íSìñé“  èCê≥ì˙ït  *
      *    XX-XXX  ÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇm  ÇmÇmÇm 9999.99.99 *
      ****************************************************************
            03  QTS531-TABLE.
              05  QTS531-KAIINKEY      PIC  9(009).
              05  QTS531-SEIKYUGAKU    PIC S9(009)
                                       SIGN LEADING SEPARATE.
              05  QTS531-HIKIOTOSHIYMD PIC  X(010).
              05  QTS531-KURIKOSHIP    PIC S9(011)
                                       SIGN LEADING SEPARATE.
              05  QTS531-KAKUTOKUP     PIC S9(011)
                                       SIGN LEADING SEPARATE.
              05  QTS531-HOYUP         PIC S9(011)
                                       SIGN LEADING SEPARATE.
              05  QTS531-TUMIKIGEN     PIC  X(008).
              05  QTS531-KOUKIGENMM    PIC  X(002).
              05  QTS531-HIKIKIGEN     PIC  X(008).
              05  QTS531-KIGENGIREP    PIC S9(011)
                                       SIGN LEADING SEPARATE.
              05  QTS531-TOMEOKIFLG    PIC  9(001).
              05  QTS531-PBKUBUN       PIC  X(001).
              05  QTS531-RIYOUYM       PIC  9(006).
