      *8...........2.........3.........4.........5........6........7.........8
      *    QTS570
      ****************************************************************
      *                ƒT[ƒoŒü‚¯‰Á–¿“XŒ´“`ƒtƒ@ƒCƒ‹                  *
      *                             DATA-WRITTEN  99.02.05           *
      *--------------------------------------------------------------*
      *                  C  ³  —š  —ð                              *
      *   ŠÇ—NO            C³——R             ’S“–ŽÒ   C³“ú•t   *
      *   V0101          ‰Á–¿“XŒ´“`Ú²±³Ä•ÏX     ANX      2000/07/27 *
      *   V0102          ‰Á–¿“XŒ´“`Ú²±³Ä•ÏX     NBC      2002/11/27 *
      ****************************************************************
          03           ()-SEG.                       *>”„ãƒŒƒR[ƒh
             05        ()-G0010.                     *>ƒL[î•ñ
               07      ()-A0010   PIC  9(13).        *>”„ã’Ê”Ôi‚Tj
             05        ()-G0020.                     *>”„ãî•ñ
               07      ()-A0020   PIC  9(02).        *>Žæˆø‚`
               07      ()-A0030   PIC  9(01).        *>Žæˆø‚a
               07      ()-A0040   PIC  9(01).        *>Žæˆø‚b
               07      ()-A0050   PIC  9(16).        *>ƒJ[ƒh”Ô†
               07      ()-A0060   PIC  9(08) COMP-3. *>—˜—p“ú
               07      ()-A0070   PIC  9(08) COMP-3. *>Žó•t“ú
               07      ()-A0080   PIC  9(08) COMP-3. *>Œvã“úi‚Pj
               07      ()-A0090   PIC  9(02).        *>Žx•¥•û–@
               07      ()-A0100   PIC  9(03).        *>•ªŠ„‰ñ”
               07      ()-A0110   PIC S9(09) COMP-3. *>—˜—p‹àŠz
               07      ()-A0120   PIC S9(09) COMP-3. *>”„ã‹àŠz
               07      ()-A0130   PIC S9(07) COMP-3. *>Å‘——¿
               07      ()-A0140   PIC S9(09) COMP-3. *>”„ã‡Œv
               07      ()-A0150   PIC S9(07) COMP-3. *>Š„ˆøŠz
               07      ()-A0160   PIC S9(09) COMP-3. *>ŽžŠÔŠOŽè”—¿
               07      ()-A0170   PIC  9(07).        *>³”F”Ô†
               07      ()-A0180   PIC  9(01).        *>‘“àŠCŠOŽ¯•Ê‹æ•ª
             05        ()-G0190.                     *>ŠCŠO—˜—pî•ñ
               07      ()-A0190   PIC S9(10)V9(03)
                                             COMP-3. *>Œ»’n’Ê‰ÝŠz
               07      ()-A0200   PIC S9(06)V9(07)
                                             COMP-3. *>Š·ŽZƒŒ[ƒg
               07      ()-A0210   PIC  9(08) COMP-3. *>Š·ŽZ“ú
               07      ()-A0220   PIC  X(13).        *>‰Á–¿“X“sŽs–¼
               07      ()-A0230   PIC  X(25).        *>’Ê‰ÝŒÄÌ
               07      ()-A0240   PIC  X(03).        *>’Ê‰ÝƒR[ƒh
               07      ()-A0250   PIC  X(03).        *>BƒR[ƒh
               07      ()-A0260   PIC  X(03).        *>‘ƒR[ƒh
             05        ()-G0270.                     *>’ñŒgæî•ñ
               07      ()-A0270   PIC  X(23).        *>’ñŒgæÆ‰ï”Ô†‚P
               07      ()-A0280   PIC  X(23).        *>’ñŒgæÆ‰ï”Ô†‚Q
               07      ()-A0290   PIC  X(15).        *>‰Á–¿“X”Ô†
               07      ()-A0300   PIC  X(25).        *>‰Á–¿“X–¼Ì‚P
               07      ()-A0310   PIC  X(25).        *>‰Á–¿“X–¼Ì‚Q
               07      ()-A0320   PIC  X(05).        *>‹ÆŽíƒR[ƒh
               07      ()-A0330   PIC  X(02).        *>‚o‚n‚rƒGƒ“ƒgƒŠ[ƒR[ƒh
               07      ()-A0340   PIC  X(01).        *>ƒ{[ƒiƒX•\Ž¦
             05        ()-G0350.                     *>ŒvãŽž‰ïˆõî•ñ
               07      ()-T0350.                     *>ƒGƒ“ƒgƒŠ[ƒL[
                 09    ()-S0350.                     *>ƒƒP[ƒVƒ‡ƒ“ƒL[
                   11  ()-A0350   PIC  9(04).        *>Šé‹ÆƒR[ƒhi‚Qj
                   11  ()-A0360   PIC  9(04).        *>ƒTƒuƒŒƒ“ƒWƒL[i‚Rj
                 09    ()-A0370   PIC  9(08).        *>“à•”‰ïˆõ”Ô†i‚Sj
               07      ()-A0380   PIC  9(02).        *>ÂŒ ŠÇ—“X
               07      ()-A0390   PIC  9(06).        *>ƒJ[ƒh‹æ•ª
               07      ()-A0400   PIC  N(15).        *>ƒJ[ƒh‰ïˆõŽ–¼
      *--------------------------------------------------------------*
      *-V0101  2000/07/27 ITEM ADD                             START-*
      *--------------------------------------------------------------*
             05        ()-G0420.                     *>‰Á–¿“Xî•ñ
               07      ()-A0420   PIC  9(01).        *>ƒ`ƒƒ[ƒWƒoƒbƒN‹æ•ª
               07      ()-A0430   PIC  N(20).        *>‰Á–¿“XŠ¿Žš‰®†
               07      ()-A0440   PIC  X(24).        *>“`•[ŒŸõƒL[
               07      ()-A0450   PIC  X(01).        *>¸ŽZ‹æ•ª
      *--------------------------------------------------------------*
      *-V0101  2000/07/27 ITEM ADD                             END  -*
      *--------------------------------------------------------------*
      *--------------------------------------------------------------*
      *-V0102  2002/11/27 ITEM ADD                            START -*
      *--------------------------------------------------------------*
               07      ()-A0460   PIC  X(01).      *>MO/TO/EC INDICATOR
               07      ()-A0470   PIC  X(01).      *>C/H ACT TERM INDICATOR
               07      ()-A0480   PIC  X(01).      *>AUTH SOURCE CODE
               07      ()-A0490   PIC  X(01).      *>TCQ
             05        FILLER     PIC  X(02).      *>—\”õ
      *--------------------------------------------------------------*
      *-V0102  2002/11/27 ITEM ADD                            END   -*
      *--------------------------------------------------------------*
      *D     05        FILLER     PIC  X(06).        *>—\”õ
      *D     05        FILLER     PIC  X(12).        *>—\”õ
