      *8.1....+....2....+....3....+....4....+....5....+....6....+....7....+....8
      ****************************************************************
      *    WEB’ŠoƒL[ƒŒƒR[ƒh                ID:QTS530              *
      *          RLF25Byte                   DATA-WRITTEN  02.07.03 *
      *--------------------------------------------------------------*
      *            C  ³  —š  —ð                                    *
      *    ŠÇ—NO            C³——R              ’S“–ŽÒ  C³“ú•t  *
      *    XX-XXX  ‚m‚m‚m‚m‚m‚m‚m‚m‚m‚m‚m‚m‚m‚m‚m  ‚m‚m‚m 9999.99.99 *
      ****************************************************************
            03  QTS530-TABLE.
              05  QTS530-KIGYOUCD      PIC  X(004).
              05  QTS530-SUBRANGEKEY   PIC  X(004).
              05  QTS530-NAIBUKAIINNO  PIC  X(008).
              05  QTS530-KAIINKEY      PIC  X(009).
