      *8.1....+....2....+....3....+....4....+....5....+....6....+....7....+....8
      ****************************************************************
      *    WEB¿‹Šm”FR¸Œ‹‰ÊƒŒƒR[ƒh        ID:QTS521              *
      *          RLF21Byte                   DATA-WRITTEN  02.07.03 *
      *--------------------------------------------------------------*
      *            C  ³  —š  —ð                                    *
      *    ŠÇ—NO            C³——R              ’S“–ŽÒ  C³“ú•t  *
      *    XX-XXX  ‚m‚m‚m‚m‚m‚m‚m‚m‚m‚m‚m‚m‚m‚m‚m  ‚m‚m‚m 9999.99.99 *
      ****************************************************************
            03  QTS521-TABLE.
              05  QTS521-KAIINID       PIC  X(010).
              05  QTS521-KAIINKEY      PIC  9(009).
              05  QTS521-ERRCODE       PIC  9(002).
