      *8.1....+....2....+....3....+....4....+....5....+....6....+....7....+....8
      ****************************************************************
      *    WEBì¸âÔê\çûêRç∏ÉåÉRÅ[Éh            ID:QTS510              *
      *          RLÅF114Byte                  DATA-WRITTEN  02.07.03 *
      *--------------------------------------------------------------*
      *            èC  ê≥  óö  ó                                    *
      *    ä«óùNO            èCê≥óùóR              íSìñé“  èCê≥ì˙ït  *
      *    XX-XXX  ÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇm  ÇmÇmÇm 9999.99.99 *
      ****************************************************************
            03  QTS510-TABLE1.
              05  QTS510-SEQ           PIC  9(005).
              05  QTS510-KAIINID       PIC  X(010).
              05  QTS510-CREDITNO      PIC  9(016).
              05  QTS510-KAIINKANA     PIC  X(030).
              05  QTS510-KAIINBIRTH    PIC  X(010).
              05  QTS510-KAIINSEX      PIC  9(001).
              05  QTS510-KAIINYUBIN    PIC  X(007).
              05  QTS510-KAIINTEL1     PIC  X(007).
              05  QTS510-KAIINTEL2     PIC  X(004).
              05  QTS510-KAIINTEL3     PIC  X(004).
              05  QTS510-ERRCODE       PIC  X(002).
            03  QTS510-TABLE2.
              05  QTS510-KIGYOUCD      PIC  X(004).
              05  QTS510-SUBRANGEKEY   PIC  X(004).
              05  QTS510-NAIBUKAIINNO  PIC  X(008).
              05  QTS510-RIYOUSHACD    PIC  X(001).
              05  QTS510-CD            PIC  X(001).
