      *8...........2.........3.........4.........5........6........7.........8  
      *    QTS640
      ****************************************************************
      *                     ƒT[ƒoŒü‚¯‹âsƒ}ƒXƒ^                     *
      *                             DATA-WRITTEN  99.02.15           *
      *--------------------------------------------------------------*
      *                  C  ³  —š  —ð                              *
      *   ŠÇ—NO            C³——R             ’S“–ŽÒ   C³“ú•t   *
      ****************************************************************
           03        ()-SEG.                  *>‹âsƒ}ƒXƒ^
             05      ()-G0010.                *>‹âsŽx“XƒR[ƒh
               07    ()-A0010    PIC  9(04).  *>‹à—Z‹@ŠÖƒR[ƒh
               07    ()-A0020    PIC  9(03).  *>Žx“XƒR[ƒh
               07    ()-A0030    PIC  X(01).  *>•t‰ÁƒR[ƒh
             05      ()-G0040.                *>‹âs–¼ÌƒJƒi
               07    ()-A0040    PIC  X(15).  *>‹à—Z‹@ŠÖ–¼ƒJƒi
               07    ()-A0050    PIC  X(15).  *>Žx“X–¼ƒJƒi
             05      ()-G0060.                *>—X•Ö”Ô†
      *********07    ()-A0060    PIC  X(03).  *>e”Ô†
      *********07    ()-A0070    PIC  X(01).  *>ƒnƒCƒtƒ“
      *********07    ()-A0080    PIC  X(02).  *>Žq”Ô
               07    ()-A0060    PIC  X(05).  *>e”Ô†
               07    ()-A0080    PIC  X(03).  *>Žq”Ô
             05      ()-A0090    PIC  9(03).  *>‹à—Z‹@ŠÖŽí•Ê
             05      ()-G0100.                *>“X•ÜŠÝ’n‚`ƒJƒi
               07    ()-A0100    PIC  X(08).  *>ƒJƒi“s“¹•{Œ§–¼
               07    ()-A0110    PIC  X(52).  *>ƒJƒiŽs‹æŒSˆÈ~
             05      ()-G0120.                *>“X•ÜŠÝ’n•û‘ƒJƒi
               07    ()-A0120    PIC  X(15).  *>ƒJƒi•û‘‚P
               07    ()-A0130    PIC  X(25).  *>ƒJƒi•û‘‚Q
             05      ()-A0140    PIC  9(02).  *>•û‘Œ…”
             05      ()-A0150    PIC  9(09).  *>‘“ys­‹æ‰æƒR[ƒh
             05      ()-A0160    PIC  X(01).  *>ƒ}ƒXƒ^‚b‚g
             05      ()-A0170    PIC  9(06).  *>‚i‚h‚rZŠƒR[ƒh
             05      ()-A0180    PIC  X(12).  *>“d˜b”Ô†
             05      ()-A0190    PIC  9(04).  *>ŽèŒ`ŒðŠ·Š
             05      ()-G0200.                *>‹âs–¼ÌŠ¿Žš
               07    ()-A0200    PIC  N(15).  *>‹à—Z‹@ŠÖ–¼Š¿Žš
               07    ()-A0210    PIC  N(15).  *>Žx“X–¼Š¿Žš
             05      ()-G0220.                *>“X•ÜŠÝ’n‚`Š¿ŽšŒ…”
               07    ()-A0220    PIC  9(02).  *>‚`Š¿Žš‘SŒ…”
               07    ()-A0230    PIC  9(01).  *>‚`Š¿Žš“s“¹•{Œ§Œ…”
               07    ()-A0240    PIC  9(02).  *>‚`Š¿ŽšŽs‹æŒSŒ…”
               07    ()-A0250    PIC  9(02).  *>‚`Š¿Žš’¬‘ºŒ…”
             05      ()-A0260    PIC  9(02).  *>“X•ÜŠÝ’n‚aŠ¿ŽšŒ…”
             05      ()-A0270    PIC  X(01).  *>—\”õ
             05      ()-A0280    PIC  N(25).  *>“X•ÜŠÝ’n‚`Š¿Žš
             05      ()-G0290.                *>“X•ÜŠÝ’n‚a•û‘Š¿Žš
               07    ()-A0290    PIC  N(15).  *>‚a•û‘Š¿Žš‚P
               07    ()-A0300    PIC  N(25).  *>‚a•û‘Š¿Žš‚Q
             05      ()-A0310    PIC  9(01).  *>‘S‹â‰Á–¿‚b‚g
             05      ()-G0320.                *>C³—š—ð
      *********07    ()-A0320    PIC  9(06).  *>ƒf[ƒ^“o˜^”NŒŽ“ú
               07    ()-A0320    PIC  9(08) COMP-3. *>ƒf[ƒ^“o˜^”NŒŽ“ú
 	       07    ()-A0330    PIC  9(08) COMP-3. *>‹Ù‹}C³”NŒŽ“ú
             05      ()-A0340    PIC  9(01).  *>ƒf[ƒ^Ží•Ê
      *******05      ()-A0350    PIC  X(03).  *>—X•Ö”Ô†—\”õ
      *******05      FILLER      PIC  X(112). *>—\”õ
             05      FILLER      PIC  X(25).  *>—\”õ
