      *8...........2.........3.........4.........5........6........7.........8  
      *    QTS700
      ****************************************************************
      *                サーバ向けローン種別テーブル                  *
      *                             DATA-WRITTEN  99.02.16           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO            修正理由             担当者   修正日付   * 
      ****************************************************************
           03          ()-SEG.                         *>ローン種別テーブル 
             05        ()-G0010.                       *>キー
               07      ()-A0010    PIC  9(05).         *>ローン種別
             05        ()-A0020    PIC  X(01).         *>商品ランクコード
             05        ()-G0030    OCCURS 5.           *>取扱店情報
               07      ()-A0030    PIC  X(01).         *>取扱店ランクコード
               07      ()-A0040    PIC  99V99 COMP-3.  *>販売手数料率
               07      ()-A0050    PIC  99V99 COMP-3.  *>受注手数料率
             05        ()-G0060.                       *>商品種別情報
               07      ()-A0060    PIC  9(02).         *>支払方法
               07      ()-A0070    PIC  99V99 COMP-3.  *>約定利率
               07      ()-A0080    PIC  99V99 COMP-3.  *>延滞利率
               07      ()-A0090    PIC  N(20).         *>ローン名称
               07      ()-A0100    PIC  9(03).         *>支払回数下限
               07      ()-A0110    PIC  9(03).         *>支払回数上限
               07      ()-A0120    PIC S9(05) COMP-3.  *>融資額単位
               07      ()-A0130    PIC S9(05) COMP-3.  *>返済額単位
               07      ()-A0140    PIC S9(05) COMP-3.  *>融資額上限
               07      ()-A0150    PIC  9(03) COMP-3.  *>ボーナス併用割合 
               07      ()-A0160    PIC  9(08) COMP-3.  *>取扱開始日
             05        FILLER      PIC  X(19).         *>予備
