      ****************************************************************
      *    —˜—p–¾×“`•[ƒtƒ@ƒCƒ‹               ID:QTS830              *
      *          RLF220Byte                  DATA-WRITTEN  03.01.10 *
      *--------------------------------------------------------------*
      *            C  ³  —š  —ð                                    *
      *   ŠÇ—NO    C³——R                    ’S“–ŽÒ    C³“ú•t   *
      *   000001    o—Í•ÒW‚Ì€–Ú’Ç‰Á‚Ì‚½‚ß    Hasegawa  03/12/09   *
      *                                                              *
      ****************************************************************
           03  QTS830-REC.
               05  QTS830-PRMNAIBUKAIINNO             PIC  X(016).
               05  QTS830-PRMTORIHIKINO               PIC  9(007).
               05  QTS830-RECKBN                      PIC  X(001).
               05  QTS830-AKAKUROKBN                  PIC  X(001).
               05  QTS830-SEIKYUHORYUKBN              PIC  X(001).
               05  QTS830-CARDKBN                     PIC  X(006).
               05  QTS830-ICMSKBN                     PIC  X(001).
               05  QTS830-PNTTEIKEIKBN                PIC  X(001).
               05  QTS830-PNTKBN                      PIC  X(001).
               05  QTS830-WEBKAIINKBN                 PIC  X(001).
               05  QTS830-REVHURIKAEKAIINKBN          PIC  X(001).
               05  QTS830-DENPYOUSHUBETSU             PIC  X(004).
               05  QTS830-RIYOUBI                     PIC  X(010).
               05  QTS830-KEIJYOUBI                   PIC  X(010).
               05  QTS830-HASSEITEN                   PIC  X(002).
               05  QTS830-HYAKATENKAMEITENKBN         PIC  X(001).
               05  QTS830-KAMEITENNO                  PIC  X(010).
               05  QTS830-GYOUSHUCD                   PIC  X(005).
               05  QTS830-POSENTRYCD                  PIC  X(002).
               05  QTS830-POSREGNO                    PIC  X(004).
               05  QTS830-POSTORIHIKINO               PIC  X(005).
               05  QTS830-TANMATSU                    PIC  X(009).
               05  QTS830-SAICD                       PIC  X(003).
               05  QTS830-TKURIAGETUUBAN              PIC  X(013).
               05  QTS830-GKGSHIHARAIHOHO             PIC  X(002).
               05  QTS830-GKGHASSEIROUTO              PIC  X(001).
               05  QTS830-GKGLOANSHUBETSU             PIC  X(005).
               05  QTS830-GKGRIYOUKNG                 PIC S9(011)
                                       	        SIGN LEADING SEPARATE.
               05  QTS830-GKGSHOUHINDAIKIN            PIC S9(011)
                                                SIGN LEADING SEPARATE.
               05  QTS830-GKGBUNKATSUKAISU            PIC  9(003).
               05  QTS830-GKGRIYOUSHACD               PIC  X(001).
               05  QTS830-GKGKOKUNAIKAIGAI            PIC  X(001).
               05  QTS830-GKGGENTIKAKAKU              PIC S9(10)V9(03)
                                                SIGN LEADING SEPARATE.
               05  QTS830-GKGKANSANRATE               PIC S9(06)V9(07)
                                                SIGN LEADING SEPARATE.
               05  QTS830-GKGKANSANBI                 PIC  X(010).
               05  QTS830-GKGISOTUUKATANI             PIC  X(003).
               05  QTS830-RIYOUDUKI                   PIC  X(006).
               05  QTS830-MAKEDATE                    PIC  X(010).
      * 2003/12/9  €–Ú’Ç‰Á -->
               05  QTS830-HURIKAEKBN                  PIC  X(001).
      * 2003/12/9 <--
