      ****************************************************************
      *    会員基本属性ファイル暴追用ﾚｲｱｳﾄ    ID:QTS890              *
      *                                       DATA-WRITTEN  14.09.16 *
      *--------------------------------------------------------------*
      *            修  正  履  歴                                    *
      *   管理NO    修正理由                    担当者    修正日付   *
      *                                                              *
      *                                                              *
      ****************************************************************
            03  QTS890-REC.
                05  QTS890-CARDKBN                PIC  X(006).
                05  QTS890-TENSAIKENKANRI         PIC  X(002).
                05  QTS890-GKNSHIKIBETSUNO        PIC  X(016).
                05  QTS890-HONSHIMEIKAN           PIC  N(015).
                05  QTS890-YUKOKIGEN              PIC  9(006).
                05  QTS890-POSSTS                 PIC  X(002).
                05  QTS890-STS.
                    07  QTS890-DAISTSKOZA         PIC  X(004).
                05  QTS890-JTKJUSHOKAN            PIC  N(025).
                05  QTS890-JTKBANCHIKAN           PIC  N(015).
                05  QTS890-JTKKATAKAN             PIC  N(032).
                05  QTS890-HONSEINENGAPPI         PIC  X(010).
                05  QTS890-NYKKESSAIYMD           PIC  X(010).
              