      ****************************************************************
      *    âÔàıì¸âÔèÓïÒÉtÉ@ÉCÉã               ID:QTS820              *
      *          RLÅF240Byte                  DATA-WRITTEN  03.01.10 *
      *--------------------------------------------------------------*
      *            èC  ê≥  óö  ó                                    *
      *    ä«óùNO            èCê≥óùóR              íSìñé“  èCê≥ì˙ït  *
      *    XX-XXX  ÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇm  ÇmÇmÇm 9999.99.99 *
      ****************************************************************
           03  QTS820-REC.
               05  QTS820-UKETSUKENO                  PIC  X(008).
               05  QTS820-CARDHAKKOKEITAI             PIC  9(001).
               05  QTS820-SUMAIKBN                    PIC  X(001).
               05  QTS820-SUMAINENSU                  PIC  X(001).
               05  QTS820-KZKHAIGUUM                  PIC  X(001).
               05  QTS820-KZKCHILDSU                  PIC  9(002).
               05  QTS820-KZKDOKYOKBN                 PIC  X(001).
               05  QTS820-CASHKIDOKG                  PIC  9(003).
               05  QTS820-ZANDAKACNT                  PIC  9(002).
               05  QTS820-ZANDAKAKG                   PIC  9(011).
               05  QTS820-NENSHUKBN                   PIC  X(001).
               05  QTS820-SHUNYUKBN                   PIC  X(001).
               05  QTS820-ELSENENSHU                  PIC  X(001).
               05  QTS820-ELSESHUNYU                  PIC  N(020).
               05  QTS820-SHOKUSHU                    PIC  X(001).
               05  QTS820-KINMUKBN                    PIC  X(001).
               05  QTS820-KINNYUSHADATE               PIC  X(006).
               05  QTS820-KINSETSURITSU               PIC  X(006).
               05  QTS820-NENSUKBN                    PIC  X(001).
               05  QTS820-TEL1                        PIC  X(007).
               05  QTS820-TEL2                        PIC  X(004).
               05  QTS820-TEL3                        PIC  X(004).
               05  QTS820-KEITAITEL1                  PIC  X(007).
               05  QTS820-KEITAITEL2                  PIC  X(004).
               05  QTS820-KEITAITEL3                  PIC  X(004).
               05  QTS820-ADDRESS                     PIC  X(100).
               05  QTS820-MIRAIDATE                   PIC  X(010).
               05  QTS820-KOUDAKUDATE                 PIC  X(010).
               05  QTS820-MAKEDATE                    PIC  X(010).
