      ****************************************************************
      *    óòópñæç◊çsÉtÉ@ÉCÉãÅ@               ID:QTS840              *
      *          RLÅF160Byte                  DATA-WRITTEN  03.01.10 *
      *--------------------------------------------------------------*
      *            èC  ê≥  óö  ó                                    *
      *    ä«óùNO            èCê≥óùóR              íSìñé“  èCê≥ì˙ït  *
      *    XX-XXX  ÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇmÇm  ÇmÇmÇm 9999.99.99 *
      ****************************************************************
           03  QTS840-REC.
               05  QTS840-PRMNAIBUKAIINNO             PIC  X(016).
               05  QTS840-PRMTORIHIKINO               PIC  9(007).
               05  QTS840-PRMGYOUNO                   PIC  9(002).
               05  QTS840-GMSSYOHIN                   PIC  N(020).
               05  QTS840-GMSSURYOU                   PIC S9(09)V9(02)
                                       	        SIGN LEADING SEPARATE.
               05  QTS840-GMSTANKA                    PIC  9(007).
               05  QTS840-GMSKNG                      PIC S9(011)
                                                SIGN LEADING SEPARATE.
               05  QTS840-GMSJYOGAIKBN                PIC  X(001).
               05  QTS840-GMSPOINTRITSU               PIC S9(05)V9(02)
                                                SIGN LEADING SEPARATE.
               05  QTS840-GMSGAKUPOINTSU              PIC S9(011)
                                                SIGN LEADING SEPARATE.
               05  QTS840-GMSBOPOINTRITSU             PIC S9(05)V9(02)
                                                SIGN LEADING SEPARATE.
               05  QTS840-GMSBOGAKUPOINTSU            PIC S9(011)
                                                SIGN LEADING SEPARATE.
               05  QTS840-MAKEDATE                    PIC  X(010).
