         02  QVY1-REC.
           03  QVY1-PRMKIKANFROM                 PIC  X(008).
           03  QVY1-PRMNYUKAITUKI                PIC  9(002).
           03  QVY1-PRMHASSEINENGET              PIC  9(006).
           03  QVY1-PRMKIGYOUCD                  PIC  X(004).
           03  QVY1-PRMSUBRANGEKEY               PIC  X(004).
           03  QVY1-PRMNAIBUKAIINNO              PIC  X(008).
           03  QVY1-TENSAIKENKANRI               PIC  X(002).
           03  QVY1-TENKAKUTOKU                  PIC  X(002).
           03  QVY1-CARDKBN                      PIC  X(006).
           03  QVY1-IPPANSEIKYUKENSU             PIC S9(006)
                                                 SIGN LEADING SEPARATE.
           03  QVY1-IPPANSEIKYUKINGAKU           PIC S9(011)
                                                 SIGN LEADING SEPARATE.
           03  QVY1-KAIMONODOUIKENSU             PIC S9(006)
                                                 SIGN LEADING SEPARATE.
           03  QVY1-KAIMONODOUIKINGAKU           PIC S9(011)
                                                 SIGN LEADING SEPARATE.
           03  QVY1-JIFURISYUSEIKENSU            PIC S9(006)
                                                 SIGN LEADING SEPARATE.
           03  QVY1-JIFURISYUSEIKINGAKU          PIC S9(011)
                                                 SIGN LEADING SEPARATE.
           03  QVY1-SEIKYUGOTAIKENSU             PIC S9(006)
                                                 SIGN LEADING SEPARATE.
           03  QVY1-SEIKYUGOTAIKINGAKU           PIC S9(011)
                                                 SIGN LEADING SEPARATE.
           03  QVY1-SEIKYUHOUKIKENSU             PIC S9(006)
                                                 SIGN LEADING SEPARATE.
           03  QVY1-SEIKYUHOUKIKINGAKU           PIC S9(011)
                                                 SIGN LEADING SEPARATE.
           03  QVY1-HIKIOTOSIKENSU               PIC S9(006)
                                                 SIGN LEADING SEPARATE.
           03  QVY1-HIKIOTOSIKINGAKU             PIC S9(011)
                                                 SIGN LEADING SEPARATE.
           03  QVY1-HIKIOTOSIGAIKENSU            PIC S9(006)
                                                 SIGN LEADING SEPARATE.
           03  QVY1-HIKIOTOSIGAIKINGAKU          PIC S9(011)
                                                 SIGN LEADING SEPARATE.
           03  QVY1-NYUKINKESIKENSU              PIC S9(006)
                                                 SIGN LEADING SEPARATE.
           03  QVY1-NYUKINKESIKINGAKU            PIC S9(011)
                                                 SIGN LEADING SEPARATE.
           03  QVY1-HOSTSHORIYMD                 PIC  X(008).
           03  QVY1-SVRSHORIYMD                  PIC  X(014).
