         02  QVY2-REC.
           03  QVY2-PRMHASSEINENGET              PIC  9(006).
           03  QVY2-PRMSIKIKBN                   PIC  X(001).
           03  QVY2-PRMKIKANFROM                 PIC  X(008).
           03  QVY2-PRMNYUKAITUKI                PIC  9(002).
           03  QVY2-PRMKIGYOUCD                  PIC  X(004).
           03  QVY2-PRMSUBRANGEKEY               PIC  X(004).
           03  QVY2-PRMNAIBUKAIINNO              PIC  X(008).
           03  QVY2-KIKANTO                      PIC  X(008).
           03  QVY2-TENSAIKENKANRI               PIC  X(002).
           03  QVY2-KANRITENMEI                  PIC  X(040).
           03  QVY2-TENKAKUTOKU                  PIC  X(002).
           03  QVY2-CARDKBN                      PIC  X(006).
           03  QVY2-KOZABAN                      PIC  X(019).
           03  QVY2-HONSHIMEIKAN                 PIC  X(030).
           03  QVY2-NYUKAINENGETU                PIC  X(006).
           03  QVY2-YUKOKIGEN                    PIC  9(006).
           03  QVY2-NENKAIHIBETU                 PIC S9(006)
                                                 SIGN LEADING SEPARATE.
           03  QVY2-NENKAIHIZEI                  PIC S9(006)
                                                 SIGN LEADING SEPARATE.
           03  QVY2-NENKAIHI                     PIC S9(006)
                                                 SIGN LEADING SEPARATE.
           03  QVY2-NYUKINDATE                   PIC  X(014).
           03  QVY2-NYUKINKESIDATE               PIC  X(014).
           03  QVY2-TAIKAIDATE                   PIC  X(014).
           03  QVY2-HOSTSHORIYMD                 PIC  X(008).
           03  QVY2-SVRSHORIYMD                  PIC  X(014).
