      *8...........2.........3.........4.........5........6........7.........8  
      *    QWS080
      ****************************************************************
      *                ƒT[ƒoŒü‚¯ƒR[ƒhƒe[ƒuƒ‹                      *
      *                             DATA-WRITTEN  99.01.13           *
      *--------------------------------------------------------------*
      *                  C  ³  —š  —ð                              *
      *   ŠÇ—NO            C³——R             ’S“–ŽÒ   C³“ú•t   *
      *   XXXXX1 ŒÀ“xŠz¸~ƒVƒXƒeƒ€‘Î‰ž@@@@@ŽR@“c   03.03.15   *
      ****************************************************************    
           03          ()-SEG.                           *>ƒR[ƒhƒe[ƒuƒ‹
             05        ()-G0010.                         *>ƒGƒ“ƒgƒŠ[ƒL[
               07      ()-A0010      PIC  X(03).         *>ƒR[ƒh‹æ•ª
               07      ()-A0020      PIC  X(04).         *>ƒR[ƒh”Ô†
             05        ()-A0030      PIC  N(40).         *>–¼Ìi“ú–{Œêj 
             05        ()-A0040      PIC  X(40).         *>”’l•”
             05        ()-G0050      REDEFINES 
                                     ()-A0040.           *>ƒR[ƒh–¼Ì’·
               07      ()-A0050      PIC  9(03).         *>–¼Ì—LŒøŒ…”
               07      ()-A0060      PIC  X(37).         *>—\”õ
             05        ()-G0070      REDEFINES 
                                     ()-A0040.           *>ŒÀ“xŠzƒe[ƒuƒ‹ 
               07      ()-A0070      PIC  9(05).         *>‘ŒÀ“xŠz
               07      ()-A0080      PIC  9(05).         *>q‚×•¥‚¢ŒÀ“xŠz  
               07      ()-A0090      PIC  9(05).         *>—\”õ
               07      ()-A0100      PIC  9(05).         *>‚p¶°ÄÞŠúŠÔ—^M 
               07      ()-A0110      PIC  9(05).         *>‚p¶°ÄÞŒŽŠÔ—^M
      * 2003.03.15 -->
      *        07      ()-A0120      PIC  9(05).         *>—\”õ
      *        07      ()-A0130      PIC  9(05).         *>—\”õ
      *        07      ()-A0140      PIC  9(05).         *>—\”õ
               07      ()-A0120      PIC  9(05).         *>ƒLƒƒƒbƒVƒ“ƒOŒÀ“x
               07      ()-A0130      PIC  9(01).         *>ŒÀ“xŠz‚e‚k‚f
               07      ()-A0140      PIC  9(09).         *>—\”õ
      * 2003.03.15 <--
             05        ()-G0150      REDEFINES 
                                     ()-A0040.           *>ŠúŒÀƒe[ƒuƒ‹
               07      ()-A0150      PIC  9(08).         *>ŠúŒÀ”NŒŽ“ú
               07      ()-A0160      PIC  X(32).         *>—\”õ
             05        ()-G0170      REDEFINES 
                                     ()-A0040.           *>ƒXƒe[ƒ^ƒXî•ñ
               07      ()-A0170      PIC  X(01).         *>ŠÇ—’PˆÊ
               07      ()-T0180.                         *>ƒXƒe[ƒ^ƒX
                 09    ()-A0180      PIC  9(02).         *>Ží—Þ
                 09    ()-A0190      PIC  9(02).         *>Ú×
                 09    ()-A0200      PIC  9(04).         *>d—v“x
                 09    ()-A0210      PIC  9(02).         *>‚o‚n‚rƒR[ƒh
                 09    ()-A0220      PIC  9(02).         *>“YŽšiŒûÀj
                 09    ()-A0230      PIC  9(02).         *>“YŽšiƒJ[ƒhj
               07      ()-T0240.                         *>•\Ž¦Ò¯¾°¼Þî•ñ
                 09    ()-A0240      PIC  N(05).         *>ƒzƒXƒg
               07      ()-A0250      PIC  X(15).         *>—\”õ
             05        ()-G0260      REDEFINES 
                                     ()-A0040.           *>ŒÚ‹qŽè”—¿—¦
               07      ()-T0260.                         *>‰„‘Ø—˜‘§
                 09    ()-A0260      PIC  99V99 COMP-3.  *>‚r‚P‰ñ
                 09    ()-A0270      PIC  99V99 COMP-3.  *>‚r‚Q‰ñ
                 09    ()-A0280      PIC  99V99 COMP-3.  *>‚rƒ{‚P
                 09    ()-A0290      PIC  99V99 COMP-3.  *>‚rƒ{‚Q
                 09    ()-A0300      PIC  99V99 COMP-3.  *>‚rŠ„•Š
                 09    ()-A0310      PIC  99V99 COMP-3.  *>‚rƒŠƒ{
                 09    ()-A0320      PIC  99V99 COMP-3.  *>‚b‚P‰ñ
                 09    ()-A0330      PIC  99V99 COMP-3.  *>‚bƒŠƒ{
               07      ()-A0340      PIC  X(16).         *>—\”õ
             05        ()-G0350      REDEFINES 
                                     ()-A0040.           *>ØÎÞ¥Ê²ÊÞ×Ý½î•ñ
               07      ()-T0350      OCCURS  6.          *>Ê²ÊÞ×Ý½Ã°ÌÞÙ
                 09    ()-A0350      PIC  9(05) COMP-3.  *>ƒŠƒ{Žc‚ãŒÀ
                 09    ()-A0360      PIC  9(05) COMP-3.  *>–ñ’è•ÔÏŠz
               07      ()-A0370      PIC  X(04).         *>—\”õ
             05        ()-G0380      REDEFINES 
                                     ()-A0040.           *>“`•[Ží•Êî•ñ
               07      ()-A0380      PIC  X(01).         *>“`•[‘n¬‹æ•ª
               07      ()-A0381      PIC  X(01).         *>“úŒv•\WŒv‹æ•ª
               07      ()-A0390      PIC  X(38).         *>—\”õ
             05        ()-G0400      REDEFINES 
                                     ()-A0040.           *>“XŠÔŒˆÏî•ñ
               07      ()-A0400      PIC  99V99 COMP-3   *>Žè”—¿—¦ 
                                     OCCURS 10.         
               07      ()-A0410      PIC  X(10).         *>—\”õ
             05        ()-G0420      REDEFINES 
                                     ()-A0040.           *>·¬¯¼Ý¸Þ—§‘Ö
               07      ()-A0420      PIC  99V99 COMP-3.  *>Žè”—¿—¦
               07      ()-A0430      PIC  X(37).         *>—\”õ
             05        ()-G0440      REDEFINES 
                                     ()-A0040.           *>·¬¯¼Ý¸Þ¸ŽZî•ñ
               07      ()-A0440      PIC  9(02).         *>¸ŽZ’÷‚ß“ú
               07      ()-A0450      PIC  9(05) COMP-3.  *>—˜—pŽè”—¿’P‰¿
               07      ()-A0460      PIC  9(05) COMP-3.  *>ŽžŠÔŠOŽè”—¿’P‰¿
               07      ()-A0470      PIC  99V99 COMP-3.  *>ŽæˆµŽè”—¿—¦
               07      ()-A0480      PIC  X(29).         *>—\”õ
             05        ()-G0490      REDEFINES 
                                     ()-A0040.           *>Á”ïÅî•ñ
               07      ()-A0490      PIC  99V99 COMP-3.  *>Á”ïÅ
               07      ()-A0500      PIC  X(37).         *>—\”õ
