      *8...........2.........3.........4.........5........6........7.........8  
      *    QWS020
      ****************************************************************
      *                会員家族ファイル                              *
      *                             DATA-WRITTEN  99.01.13           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO            修正理由             担当者   修正日付   * 
      ****************************************************************    
           03          ()-SEG.                             *>会員家族 
             05        ()-G0010.                           *>エントリーキー
               07      ()-A0010         PIC  9(04).        *>企業コード
               07      ()-A0020         PIC  9(04).        *>サブレンジキー
               07      ()-A0030         PIC  9(08).        *>内部会員番号  
             05        ()-G0040.                           *>家族基本情報
               07      ()-A0040         PIC  9(01).        *>利用者コード 
               07      ()-A0050         PIC  9(08) COMP-3. *>入会年月日
               07      ()-T0060.                           *>氏名 
                 09    ()-A0060         PIC  X(15).        *>カナ
                 09    ()-A0070         PIC  X(30).        *>ローマ字
                 09    ()-A0080         PIC  N(15).        *>漢字
               07      ()-A0090         PIC  9(08) COMP-3. *>生年月日
               07      ()-A0100         PIC  9(01).        *>性別
               07      ()-A0110         PIC  9(01).        *>続柄
               07      ()-A0120         PIC  9(01).        *>カード発行区分
               07      ()-A0130         PIC  9(08) COMP-3. *>カード発券日
             05        ()-G0140.                           *>番号情報
               07      ()-A0140         PIC  9(08).        *>ＣＩＦ番号
               07      ()-A0150         PIC  9(01).        *>枝番
             05        ()-G0160.                           *>提携先情報
               07      ()-A0160         PIC  9(08) COMP-3. *>返戻日
               07      ()-A0170         PIC  X(03).        *>理由コード
               07      ()-A0180         PIC  9(16).        *>カード番号
             05        ()-G0190.                           *>暗証番号情報
               07      ()-A0190         PIC  9(04).        *>暗証番号
               07      ()-A0200         PIC  9(04).        *>旧暗証番号
               07      ()-A0210         PIC  9(08) COMP-3. *>変更日
             05        ()-A0220         PIC  9(02).        *>クラブコード
             05        ()-G0230.                           *>ステータス情報
               07      ()-A0230         PIC  9(08) COMP-3. *>登録日
               07      ()-A0240         PIC  9(04).        *>ステータス
             05        FILLER           PIC  X(13).        *>予備
