      *8...........2.........3.........4.........5........6........7.........8  
      *    QWS090
      ****************************************************************
      *                ƒT[ƒoŒü‚¯“Xƒe[ƒuƒ‹                          *
      *                             DATA-WRITTEN  99.01.13           *
      *--------------------------------------------------------------*
      *                  C  ³  —š  —ð                              *
      *   ŠÇ—NO            C³——R             ’S“–ŽÒ   C³“ú•t   *
      *   000001   ƒŒƒCƒAƒEƒg•ÏX‚Ìˆ×            IMZ      02/08/20   *
      *            (QTAB_SHJMISERYAKU N(3) ¨ N(4))                  *
      ****************************************************************
           03            ()-SEG.                        *>“Xƒe[ƒuƒ‹
             05          ()-G0010.                      *>“Xƒe[ƒuƒ‹ƒL[
               07        ()-A0010          PIC  9(04).  *>Šé‹ÆƒR[ƒh
               07        ()-A0020          PIC  9(02).  *>‰c‹Æ“XƒR[ƒh
               07        ()-T0030.                      *>—LŒøŠúŠÔ
                 09      ()-A0030          PIC  9(08).  *>ŠJŽn“ú
                 09      ()-A0040          PIC  9(08).  *>I—¹“ú
             05          ()-G0050.                      *>“Xƒe[ƒuƒ‹î•ñ—Ìˆæ
               07        ()-T0050.                      *>‰c‹Æ“X–¼Ì
                 09      ()-A0050          PIC  X(20).  *>ƒJƒi
                 09      ()-A0060          PIC  N(20).  *>Š¿Žš
               07        ()-P0070          OCCURS 10.   *>ƒJ[ƒh‹æ•ªî•ñ
                 09      ()-S0070.                      *>‰ïŽÐ“Xî•ñ
                   11    ()-A0070          PIC  9(02).  *>‰ïŽÐ“XƒR[ƒh
                   11    ()-Y0080.                      *>‰ïŽÐ“X–¼Ì
                     13  ()-A0080          PIC  X(20).  *>ƒJƒi
                     13  ()-A0090          PIC  N(20).  *>Š¿Žš
                 09      ()-S0100.                      *>ŠÇ—“Xî•ñ
                   11    ()-A0100          PIC  9(02).  *>ŠÇ—“XƒR[ƒh
                   11    ()-Y0110.                      *>ŠÇ—“X–¼Ì
                     13  ()-A0110          PIC  X(20).  *>ƒJƒi
                     13  ()-A0120          PIC  N(20).  *>Š¿Žš
                 09      ()-S0130.                      *>Ž–‹Æ–{•”
                   11    ()-A0130          PIC  9(02).  *>Ž–‹Æ–{•”ƒR[ƒh
                   11    ()-Y0140.                      *>Ž–‹Æ–{•”–¼Ì
                     13  ()-A0140          PIC  X(20).  *>ƒJƒi
                     13  ()-A0150          PIC  N(20).  *>Š¿Žš
               07        ()-T0160.                      *>W–ñŒûÀî•ñ
                 09      ()-A0160          PIC  9(16).  *>W–ñŒûÀ”Ô†‚P
                 09      ()-A0170          PIC  9(16).  *>W–ñŒûÀ”Ô†‚Q
                 09      ()-A0180          PIC  9(16).  *>W–ñŒûÀ”Ô†‚R
                 09      ()-A0190          PIC  9(16).  *>W–ñŒûÀ”Ô†‚S
                 09      ()-A0200          PIC  9(16).  *>W–ñŒûÀ”Ô†‚T
                 09      ()-A0210          PIC  9(16).  *>W–ñŒûÀ”Ô†‚U
                 09      ()-A0220          PIC  9(16).  *>W–ñŒûÀ”Ô†‚V
                 09      ()-A0230          PIC  9(16).  *>W–ñŒûÀ”Ô†‚W
                 09      ()-A0240          PIC  9(16).  *>W–ñŒûÀ”Ô†‚X
                 09      ()-A0250          PIC  9(16).  *>W–ñŒûÀ”Ô†‚P‚O
             05          ()-A0260          PIC  X(01).  *>“Œ¼‹æ•ª
             05          ()-G0270.                      *>Šé‹ÆƒR[ƒhî•ñ—Ìˆæ
               07        ()-A0270          PIC  9(04)   *>Šé‹ÆƒR[ƒh
                                           OCCURS  6.   *>(Ì”Ô—p:¶°ÄÞ‹æ•ª–ˆ)
             05          ()-A0280          PIC  9(02).  *>EˆõÌ”Ô—p‹æ•ª
             05          ()-G0290.                      *>ZŠ
               07        ()-A0290          PIC  9(11).  *>ZŠƒR[ƒh
               07        ()-A0300          PIC  X(05).  *>—X•Ö”Ô†
               07        ()-A0310          PIC  X(03).  *>—X•Ö”Ô†—\”õ
               07        ()-T0320.                      *>ƒJƒi
                 09      ()-S0320.                      *>ZŠ
                   11    ()-A0320          PIC  X(08).  *>Œ§–¼
                   11    ()-A0330          PIC  X(42).  *>Žs‹æŒS`Žš’š–Ú
                   11    ()-A0340          PIC  X(15).  *>”Ô’n
                   11    ()-A0350          PIC  X(32).  *>•û‘
               07        ()-T0360.                      *>Š¿Žš
                 09      ()-S0360.                      *>ZŠ
                   11    ()-A0360          PIC  N(25).  *>Œ§–¼`Žš’š–Ú
                   11    ()-A0370          PIC  N(15).  *>”Ô’n
                   11    ()-A0380          PIC  N(32).  *>•û‘
             05          ()-G0390.                      *>“d˜b”Ô†
               07        ()-A0390          PIC  X(07).  *>ŽsŠO‹Ç”Ô
               07        ()-A0400          PIC  X(04).  *>‹Ç”Ô
               07        ()-A0410          PIC  X(04).  *>”Ô†
               07        ()-A0420          PIC  X(01).  *>’¼’Ê‹æ•ª
               07        ()-A0430          PIC  X(01).  *>“XŽí•Ê
               07        ()-A0440          PIC  N(10).  *>Žc‚Šm”F‘‘—•tæ
             05          ()-G0450.                      *>‹–‰Â”Ô†
               07        ()-A0450          PIC  N(02).  *>à–±‹Ç–¼
               07        ()-A0460          PIC  9(01).  *>XV‰ñ”
               07        ()-A0470          PIC  9(05).  *>”Ô†
             05          ()-G0480.                      *>Û°ÝŽè”—¿ŠÖ˜Aî•ñ
               07        ()-A0480          PIC  X(01).  *>Žè”—pŠî–{—¿‹àŽx•¥‹æ•ª
             05          ()-G0490.                      *>¿‹‘•\Ž¦î•ñ
               07        ()-A0490          PIC  N(12).  *>“X–¼
      *---2002.08.20 IMZ kikuchi ===>
      *       05          ()-A0500          PIC  N(03).  *>“X—ªÌ
      *       05          FILLER            PIC  X(13).  *>—\”õ
             05          ()-A0500          PIC  N(04).  *>“X—ªÌ
             05          FILLER            PIC  X(11).  *>—\”õ
      *---2002.08.20 IMZ kikuchi <===
