      *8...........2.........3.........4.........5........6........7.........8  
      *    QWS060
      ****************************************************************
      *                Ž©U•Ô–ßƒtƒ@ƒCƒ‹                              *
      *                             DATA-WRITTEN  99.01.12           *
      *--------------------------------------------------------------*
      *                  C  ³  —š  —ð                              *
      *   ŠÇ—NO            C³——R             ’S“–ŽÒ   C³“ú•t   * 
      ****************************************************************    
           03  ()-SEG.                                      *>Ž©U•Ô–ßŒ‹‰Êî•ñ
             05  ()-A0010              PIC  9(004).         *>Šé‹ÆƒR[ƒh
             05  ()-A0020              PIC  9(004).         *>ƒTƒuƒŒƒ“ƒWƒL[
             05  ()-A0030              PIC  9(008).         *>“à•”‰ïˆõ”Ô†
             05  ()-A0040              PIC  9(006) COMP-3.  *>¿‹”NŒŽ
             05  ()-G0050.                                  *>uÀî•ñ
               07  ()-A0050            PIC  9(004).         *>‹âsƒR[ƒh
               07  ()-A0060            PIC  9(005).         *>Žx“XƒR[ƒh
               07  ()-A0070            PIC  9(001).         *>—a‹àŽí•Ê
               07  ()-A0080            PIC  9(008).         *>ŒûÀ”Ô†
               07  ()-A0090            PIC  X(030).         *>ŒûÀ–¼‹`l
               07  ()-A0100            PIC  X(001).         *>U‘ÖŒ‹‰ÊƒR[ƒh
               07  ()-A0110            PIC  X(001).         *>—X’™Ä”­s‰ñ”
             05  FILLER                PIC  X(010).         *>—\”õ
