      *8...........2.........3.........4.........5........6........7.........8  
      *    QWS030
      ****************************************************************
      *                      外内変換ファイル                        *
      *                             DATA-WRITTEN  99.01.12           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO            修正理由             担当者   修正日付   * 
      ****************************************************************    
           03  ()-SEG.                                         *>外内変換レコード
             05  ()-G0010.                                     *>エントリーキー
               07  ()-A0010            PIC  9(016).            *>外部会員番号
             05  ()-G0020.                                     *>移管情報
               07  ()-A0020            PIC  9(001).            *>区分
               07  ()-A0030            PIC  9(016).            *>移管先会員番号
               07  ()-A0040            PIC  9(008) COMP-3.     *>口座移管日
               07  ()-A0050            PIC  9(006) COMP-3.     *>有効期限
               07  ()-A0060            OCCURS 9 TIMES PIC  9.  *>移管元利用者コード
             05  ()-G0070.                                     *>内部会員番号
               07  ()-T0070.                                   *>ロケーションキー
                 09  ()-A0070          PIC  9(004).            *>企業コード
                 09  ()-A0080          PIC  9(004).            *>サブレンジキー
               07  ()-A0090            PIC  9(008).            *>内部会員番号
             05  FILLER                PIC  X(013).            *>予備
