      *8...........2.........3.........4.........5........6........7.........8  
      *    QWS012
      ****************************************************************
      *                サーバ向けカード更新インターフェース（家族）  *
      *                             DATA-WRITTEN  99.01.16           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO            修正理由             担当者   修正日付   *
      ****************************************************************
           03          ()-SEG.                           *>カード更新
             05        ()-G0010.                         *>エントリーキー
               07      ()-T0010.                         *>ロケーションキー
                 09    ()-A0010      PIC  9(04).         *>企業コード
                 09    ()-A0020      PIC  9(04).         *>サブレンジキー
               07      ()-A0030      PIC  9(08).         *>内部会員番号
             05        ()-G0040.                         *>家族情報テーブル
               07      ()-T0040.                         *>家族基本情報
                 09    ()-A0040      PIC  9(01).         *>利用者コード
                 09    ()-A0050      PIC  9(08) COMP-3.  *>入会年月日
                 09    ()-T0060.                         *>氏名
                   11  ()-A0060      PIC  X(15).         *>カナ
                   11  ()-A0070      PIC  X(30).         *>ローマ字
                   11  ()-A0080      PIC  N(15).         *>漢字
                 09    ()-A0090      PIC  9(08) COMP-3.  *>生年月日
                 09    ()-A0100      PIC  9(01).         *>性別
                 09    ()-T0110.                         *>暗証番号情報
                   11  ()-A0110      PIC  9(04).         *>暗証番号
                   11  ()-A0120      PIC  9(04).         *>旧暗証番号
                   11  ()-A0130      PIC  9(08) COMP-3.  *>変更日
               07      ()-G0140.                         *>家族ステータス
                 09    ()-T0140.                         *>ステータス情報
                   11  ()-A0150      PIC  9(08) COMP-3.  *>登録日
                   11  ()-A0160      PIC  9(04).         *>ステータス
               07      FILLER        PIC  X(15).         *>予備
