      *8...........2.........3.........4.........5........6........7.........8  
      *    QWS050
      ****************************************************************
      *                入金分解ファイル                              *
      *                             DATA-WRITTEN  99.01.12           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO   修正理由                      担当者   修正日付   * 
      *   000001   レイアウト変更の為            FIP      99/03/06   *
      ****************************************************************    
           03  ()-SEG.                                      *>入金ログレコード
             05  ()-G0010.                                  *>入金業務共通情報
               07  ()-A0010            PIC  9(002).         *>入金ログ種別
               07  ()-A0020            PIC S9(003) COMP-3.  *>ログシーケンス
               07  ()-A0030            PIC  X(001).         *>東西区分
               07  ()-A0040            PIC  X(002).         *>事業本部コード
               07  ()-A0050            PIC  X(002).         *>債権管理店
               07  ()-A0060            PIC  X(002).         *>入金発生店
               07  ()-A0070            PIC  9(006).         *>カード区分
               07  ()-A0080            PIC  X(006).         *>扱部課係
               07  ()-A0090            PIC  9(016).         *>外部会員番号
               07  ()-T0100.                                *>ロケーションキー
                 09  ()-A0100          PIC  9(004).         *>企業コード
                 09  ()-A0110          PIC  9(004).         *>サブレンジキー
               07  ()-A0120            PIC  9(008).         *>内部会員番号
               07  ()-A0140            PIC  9(007).         *>入金明細番号
               07  ()-A0150            PIC  9(008) COMP-3.  *>分解日
               07  ()-A0160            PIC  9(008) COMP-3.  *>計上日
               07  ()-A0170            PIC  9(008) COMP-3.  *>入金日
               07  ()-A0180            PIC  X(001).         *>与信ランク
               07  ()-A0190            PIC  X(001).         *>見なしフラグ
               07  ()-A0200            PIC  9(004).         *>有効期限
               07  ()-A0220            PIC  9(008) COMP-3.  *>処理日
               07  ()-A0230            PIC  X(007).         *>予備
               07  ()-A0240            PIC  X(002).         *>入力店
               07  ()-A0250            PIC  9(009).         *>入金分解通番
               07  ()-T0260.                                *>入金分解・戻し情報
                 09  ()-A0260          PIC  9(002).         *>分解区分
                 09  ()-A0270          PIC  N(004).         *>分解区分翻訳値
                 09  ()-A0280          PIC  9(006) COMP-3.  *>請求年月
                 09  ()-A0290          PIC  9(002).         *>支払方法
                 09  ()-A0300          PIC  9(007).         *>残明細伝票番号
                 09  ()-S0310.                              *>充当前情報
                   11  ()-A0310        PIC S9(011) COMP-3.  *>元本
                   11  ()-A0320        PIC S9(009) COMP-3.  *>手数料
                   11  ()-A0330        PIC S9(009) COMP-3.  *>事務手数料
                   11  ()-A0340        PIC S9(009) COMP-3.  *>未充当利息
                   11  ()-A0350        PIC  9(008) COMP-3.  *>最新入金日
                 09  ()-S0360.                              *>充当情報
                   11  ()-A0360        PIC S9(011) COMP-3.  *>元本
                   11  ()-A0370        PIC S9(009) COMP-3.  *>手数料7-6
                   11  ()-A0380        PIC S9(009) COMP-3.  *>手数料1-6
                   11  ()-A0390        PIC S9(009) COMP-3.  *>事務手数料
                   11  ()-A0400        PIC S9(009) COMP-3.  *>遅延損害金
                   11  ()-A0410        PIC S9(007) COMP-3.  *>戻し利息
                 09  ()-A0420          PIC  9(008) COMP-3.  *>利息計算基準日
                 09  ()-A0430          PIC  9(001).          *>ローン完済区分
                 09  ()-S0460.                              *>相殺情報
                   11  ()-A0460        PIC  9(003).         *>相殺科目
                   11  ()-A0470        PIC S9(009) COMP-3.  *>相殺金額
                 09  ()-A0480          PIC  X(004).         *>伝票種別
                 09  ()-A0490          PIC  N(006).         *>支払方法翻訳値
                 09  ()-A0500          PIC  9(005).         *>ローン種別
                 09  ()-A0510          PIC  9(001).         *>月令コード
                 09  FILLER            PIC  X(009).         *>予備
