      *8...........2.........3.........4.........5........6........7.........8  
      *    QWS040
      ****************************************************************
      *                入金計上ファイル                              *
      *                             DATA-WRITTEN  99.01.12           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO   修正理由                      担当者   修正日付   * 
      *   000001   レイアウト変更の為            FIP      99/03/06   *
      ****************************************************************    
           03          ()-SEG.                              *>入金ログレコード
             05        ()-G0010.                            *>入金業務共通情報
               07      ()-A0010        PIC  9(002).         *>入金ログ種別
               07      ()-A0020        PIC S9(003) COMP-3.  *>ログシーケンス
               07      ()-A0030        PIC  X(001).         *>東西区分
               07      ()-A0040        PIC  X(002).         *>事業本部コード
               07      ()-A0050        PIC  X(002).         *>債権管理店
               07      ()-A0060        PIC  X(002).         *>入金発生店
               07      ()-A0070        PIC  9(006).         *>カード区分
               07      ()-A0080        PIC  X(006).         *>扱部課係
               07      ()-A0090        PIC  9(016).         *>外部会員番号
               07      ()-T0100.                            *>ロケーションキー
                 09    ()-A0100        PIC  9(004).         *>企業コード
                 09    ()-A0110        PIC  9(004).         *>サブレンジキー
               07      ()-A0120        PIC  9(008).         *>内部会員番号
               07      ()-A0140        PIC  9(007).         *>入金明細番号
               07      ()-A0150        PIC  9(008) COMP-3.  *>分解日
               07      ()-A0160        PIC  9(008) COMP-3.  *>計上日
               07      ()-A0170        PIC  9(008) COMP-3.  *>入金日
               07      ()-A0180        PIC  X(001).         *>与信ランク
               07      ()-A0190        PIC  X(001).         *>見なしフラグ
               07      ()-A0200        PIC  9(004).         *>有効期限
               07      ()-A0220        PIC  9(008) COMP-3.  *>処理日
               07      ()-A0230        PIC  X(007).         *>予備
               07      ()-A0240        PIC  X(002).         *>入力店
               07      ()-A0245        PIC  9(009).         *>入金計上通番
               07      ()-T0250.                            *>入金・返金計上情報
                 09    ()-A0250        PIC  X(001).         *>入金発生理由
                 09    ()-A0260        PIC  X(001).         *>入金経路
                 09    ()-A0270        PIC  X(004).         *>伝票種別
                 09    ()-A0280        PIC  9(004).         *>バッチ№
                 09    ()-S0290.                            *>Ｇ－№
                   11  ()-A0290        PIC  9(004).         *>バッチ№
                   11  ()-A0300        PIC  9(003).         *>伝票シーケンス
                 09    ()-A0310        PIC  9(011).         *>伝票番号
                 09    ()-A0320        PIC  X(001).         *>預り金種別
                 09    ()-A0330        PIC S9(011) COMP-3.  *>金額
                 09    ()-A0340        PIC  9(003).         *>相殺科目
                 09    ()-S0350.                            *>他口座預り金振替情報
                   11  ()-A0350        PIC  9(002).         *>事業本部コード
                   11  ()-A0360        PIC  9(002).         *>債権管理店
                   11  ()-A0370        PIC  9(002).         *>獲得店
                   11  ()-A0380        PIC  9(006).         *>カード区分
                   11  ()-A0390        PIC  9(016).         *>外部会員番号
                 09    ()-S0410.                            *>入金計上エラー情報
                   11  ()-A0410        PIC  N(010).         *>エラー理由
                   11  ()-A0420        PIC  9(016).         *>入力時会員番号
                 09  ()-A0430          PIC  9(002).         *>伝票送付先留置区分
                 09  ()-A0440          PIC  N(005).         *>入金経路翻訳値
                 09  FILLER            PIC  X(010).         *>予備
