      *8...........2.........3.........4.........5........6........7.........8  
      *    QWS100
      ****************************************************************
      *                ƒT[ƒoŒü‚¯ZŠƒ}ƒXƒ^                          *
      *                             DATA-WRITTEN  99.01.13           *
      *--------------------------------------------------------------*
      *                  C  ³  —š  —ð                              *
      *   ŠÇ—NO            C³——R             ’S“–ŽÒ   C³“ú•t   * 
      ****************************************************************    
           03          ()-SEG.                        *>ZŠƒ}ƒXƒ^
             05        ()-G0010.                      *>ZŠƒR[ƒh
               07      ()-A0010          PIC  X(02).  *>“s“¹•{Œ§
               07      ()-A0020          PIC  X(02).  *>Žs‹æŒS
               07      ()-A0030          PIC  X(03).  *>’¬‘º
               07      ()-A0040          PIC  X(02).  *>ŽšE’š–Ú
             05        ()-A0050          PIC  X(01).  *>‚b^‚c
             05        ()-A0060          PIC  X(07).  *>—X•Ö”Ô†
             05        ()-G0070.                      *>ƒJƒiZŠ
               07      ()-A0070          PIC  X(08).  *>Œ§–¼
               07      ()-A0080          PIC  X(52).  *>ƒJƒiZŠ–¼
             05        ()-G0090.                      *>Š¿ŽšZŠ
               07      ()-A0090          PIC  9(02).  *>—LŒø‘SŒ…
               07      ()-A0100          PIC  9(01).  *>“s“¹•{Œ§Œ…
               07      ()-A0110          PIC  9(02).  *>Žs‹æŒSŒ…
               07      ()-A0120          PIC  9(02).  *>’¬‘ºŒ…
               07      ()-A0130          PIC  N(25).  *>Š¿ŽšZŠ–¼
             05        ()-A0140          PIC  X(01).  *>—X•Öƒ}[ƒN
             05        ()-G0150.                      *>“o˜^”NŒŽ“ú
               07      ()-A0150          PIC  X(04).  *>ƒJƒi“o˜^”NŒŽ
               07      ()-A0160          PIC  X(04).  *>Š¿Žš“o˜^”NŒŽ
             05        ()-A0170          PIC  9(01).  *>‚b^‚g
             05        FILLER            PIC  X(56).  *>—\”õ
