000000*       QWS780              LEVEL=2        DATE=03.09.01
000100******************************************************************
000200*@@@@@@”N‰ï”ï’ •\ƒf[ƒ^@@@@@@@@@‚q‚kF‚P‚Q‚P      *
000300*----------------------------------------------------------------*
000400*@áŠQNO@C³—š—ði“à—ej@@@@@@@@@@’S“–ŽÒ@C³“ú•t@*
000500*----------------------------------------------------------------*
000600*QXXXXXXX-XXX  ‚w‚w‚w‚w‚w‚w‚w‚w‚w‚w‚w‚w‚w‚w‚w‚w‚w‚w‚w  XX/XX/XX  *
000700******************************************************************
000800     03  QWS780-SEG.                           *>”N‰ï”ï’ •\ƒf[ƒ^
000900       05  QWS780-G0010.                       *>WŒvˆ—î•ñ
001000         07  QWS780-T0010.                     *>‚r‚n‚q‚s€–Ú
001100           09  QWS780-A0010    PIC  9(006).    *>”­¶”NŒŽ
001200           09  QWS780-A0020    PIC  9(008).    *>‘ÎÛŠúŠÔ‚e‚n‚q‚l
001300           09  QWS780-A0030    PIC  9(008).    *>‘ÎÛŠúŠÔ‚s‚n
001400           09  QWS780-A0040    PIC  9(002).    *>“ü‰ïŒŽ
001500         07  QWS780-G0050.                     *>ƒƒP[ƒVƒ‡ƒ“ƒL[
001600           09  QWS780-A0050    PIC  9(004).    *>Šé‹ÆƒR[ƒh
001700           09  QWS780-A0060    PIC  9(004).    *>ƒTƒuƒŒƒ“ƒWƒL[
001800         07  QWS780-A0070      PIC  9(008).    *>“à•”‰ïˆõ”Ô†
001900         07  QWS780-A0080      PIC  9(002).    *>ŠÇ—“X
002000         07  QWS780-A0090      PIC  9(002).    *>Šl“¾“X
002100         07  QWS780-A0100      PIC  9(006).    *>ƒJ[ƒh‹æ•ª
002200       05  QWS780-G0110.                       *>ƒŠƒXƒg—p€–Ú
002300         07  QWS780-A0110      PIC  9(006).    *>”N‰ï”ïiÅ•Êj
002400         07  QWS780-A0120      PIC  9(006).    *>”N‰ï”ïiÁ”ïÅj
002500         07  QWS780-A0130      PIC  9(008).    *>‰ñŽû”NŒŽ“úi•ª‰ð“új
002600         07  QWS780-A0140      PIC  9(008).    *>‰ñŽûŽæÁ”NŒŽ“úi•ª‰ð“új
002700         07  QWS780-A0150      PIC  9(008).    *>‘Þ‰ï“úi‚r‚s‚r“o˜^“új
002800       05  QWS780-G0160.                       *>ŠY“–ƒtƒ‰ƒO
002900         07  QWS780-A0160      PIC  9(001).    *>ˆê”Ê¿‹
003000         07  QWS780-A0170      PIC  9(001).    *>’Ç‰Á“¯ˆÓ
003100         07  QWS780-A0180      PIC  9(001).    *>Ž©U‹àŠzC³
003200         07  QWS780-A0190      PIC  9(001).    *>¿‹Œã‘Þ‰ï
003300         07  QWS780-A0200      PIC  9(001).    *>¿‹•úŠü
003400         07  QWS780-A0210      PIC  9(001).    *>‹âsˆø—Ž
003500         07  QWS780-A0220      PIC  9(001).    *>‹âsˆø—ŽˆÈŠO
003600         07  QWS780-A0230      PIC  9(001).    *>“ü‹àŽæÁ
003700       05  QWS780-A0240        PIC  9(008).    *>ƒzƒXƒgì¬“ú
003800       05  FILLER          PIC  X(018).        *>—\”õ
