      *8...........2.........3.........4.........5........6........7.........8  
      *    QXB200
      ****************************************************************
      *                ƒT[ƒoŒü‚¯ŒvãƒXƒe|ƒ^ƒXƒŒƒR[ƒh@@          *
      *                             DATA-WRITTEN  05.05.01           *
      *--------------------------------------------------------------*
      *                  C  ³  —š  —ð                              *
      *   ŠÇ—NO            C³——R             ’S“–ŽÒ   C³“ú•t   * 
      ****************************************************************    
           03          ()-SEG.                        *>ŒvãŽžƒXƒe|ƒ^ƒXƒŒƒR|ƒh
             05        ()-G0010.                      *>ƒL|€–Ú
               07      ()-T0010.                      *>ƒƒP|ƒVƒ‡ƒ“ƒL|
                 09    ()-A0010    PIC  9(04) COMP-3. *>Šé‹ÆƒR|ƒh
                 09    ()-A0020    PIC  9(04) COMP-3. *>ƒTƒuƒŒƒ“ƒWƒL|
               07      ()-A0030    PIC  9(08) COMP-3. *>“à•”‰ïˆõ”Ô†
               07      ()-A0040    PIC  9(07) COMP-3. *>Žæˆø’Ê”Ô
             05        ()-G0050.                      *>‰ïˆõî•ñ
               07      ()-A0050    PIC  9(02).        *>‚o‚n‚rƒXƒe|ƒ^ƒX
               07      ()-A0060    PIC  9(04).        *>‘ã•\ƒXƒe|ƒ^ƒX
               07      ()-T0070.                      *>ŒûÀƒXƒe|ƒ^ƒXƒe|ƒuƒ‹
                 09    ()-P0070    OCCURS  20  TIMES. *>ƒXƒe|ƒ^ƒXî•ñ
                   11  ()-A0070    PIC S9(07) COMP-3. *>“o˜^“ú
                   11  ()-A0080    PIC  9(02).        *>ƒXƒe|À½
               07      ()-T0090.                      *>ƒJ|ƒhƒXƒe|ƒ^ƒXƒe|ƒuƒ‹
                 09    ()-P0090    OCCURS  10  TIMES. *>ƒXƒe|ƒ^ƒXî•ñ
                   11  ()-A0090    PIC S9(07) COMP-3. *>“o˜^“ú
                   11  ()-A0100    PIC  9(02).        *>ƒXƒe|À½
             05        ()-G0110.                      *>ƒlƒKî•ñ
               07      ()-A0110    PIC  9(04).        *>ƒlƒKƒR|ƒh
               07      ()-A0120    PIC  9(07) COMP-3. *>Ž–ŒÌ“ú
             05        ()-G0130.                      *>§Œäî•ñ
               07      ()-A0130    PIC  X(01).        *>Ž¯•Ê‹æ•ª
               07      ()-A0140    PIC  9(13) COMP-3. *>’ñŒgŽæˆø’Ê”Ô
               07      ()-A0150    PIC  9(07) COMP-3. *>Œvãˆ—“ú
               07      ()-A0160    PIC  9(08) COMP-3. *>Œvãˆ—Žž
             05        FILLER      PIC  X(14).        *>—\”õ
             
