      *8...........2.........3.........4.........5........6........7.........8
      *    QXCS02
      ****************************************************************
      *                ホスト審査年月ファイル                        *
      *                             DATA-WRITTEN  05.09.30           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO            修正理由             担当者   修正日付   *
      ****************************************************************
            03        ()-SHINSAYMC.                        *>審査年月キャラ
              05      ()-SHINSAYM   PIC  9(006).           *>審査年月
            03        FILLER        PIC  X(073).           *>改行コード
            03        ()-CR         PIC  X(001).           *>改行コード
