      *8...........2.........3.........4.........5........6........7.........8
      *    QXCS09
      ****************************************************************
      *                削除データキーファイル                        *
      *                             DATA-WRITTEN  05.09.30           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO            修正理由             担当者   修正日付   *
      ****************************************************************
            03        ()-SEG.                              *>集計マスタ
              05      ()-PRM.                              *>エントリーキー
                07    ()-PRMSHINSAYM         PIC  X(06).   *>審査年月
                07    ()-PRMKIGYOUCD         PIC  X(04).   *>企業コード
                07    ()-PRMSUBRANGEKEY      PIC  X(04).   *>サブレンジ
                07    ()-PRMNAIBUKAIINNO     PIC  X(08).   *>内部会員番号
              05      FILLER                 PIC  X(17).   *>改行コード
              05      ()-CR                  PIC  X(01).   *>改行コード

