      *8...........2.........3.........4.........5........6........7.........8
      *    QXCS12
      ****************************************************************
      *                利用可能額更新依頼データファイル              *
      *                             DATA-WRITTEN  05.09.30           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO            修正理由             担当者   修正日付   *
      ****************************************************************
            03        ()-SEG.                              *>更新依頼
              05      ()-G0010.                            *>キー項目
                07    ()-T0010.                            *>ロケーションキー
                  09  ()-A0010      PIC  9(004)  COMP-3.   *>企業コード
                  09  ()-A0020      PIC  9(004)  COMP-3.   *>サブレンジキー
                07    ()-A0030      PIC  9(008)  COMP-3.   *>内部会員番号
                07    ()-A0040      PIC  9(006)  COMP-3.   *>審査年月
              05      ()-G0050.                            *>会員情報
                07    ()-A0050      PIC  9(002).           *>管理店
                07    ()-A0060      PIC  X(006).           *>カード区分
                07    ()-A0070      PIC  9(016)  COMP-3.   *>カード番号
                07    ()-A0080      PIC  9(006)  COMP-3.   *>有効期限
                07    ()-T0090.                            *>改定前
                  09  ()-A0090      PIC  X(001).           *>与信ランク
                  09  ()-A0100      PIC  S9(005) COMP-3.   *>総限度額
                  09  ()-A0110      PIC  S9(005) COMP-3.   *>延べ払い限度額
                  09  ()-A0120      PIC  S9(005) COMP-3.   *>キャッシ限度額
              05      ()-G0130.                            *>更新情報
                07    ()-A0130      PIC  X(001).           *>審査結果
                07    ()-T0140.                            *>最終審査
                  09  ()-A0140      PIC  X(001).           *>与信ランク
                  09  ()-A0150      PIC  S9(005) COMP-3.   *>総限度額
                  09  ()-A0160      PIC  S9(005) COMP-3.   *>延べ払い限度額
                  09  ()-A0170      PIC  S9(005) COMP-3.   *>キャッシ限度額
                07    ()-A0180      PIC  X(001).           *>更新結果
              05      ()-T0190.                            *>管理情報
                07    ()-A0190      PIC  9(007)  COMP-3.   *>作成日
                07    ()-A0200      PIC  9(007)  COMP-3.   *>更新日
                07    ()-A0210      PIC  X(008).           *>更新担当者
                07    ()-A0220      PIC  X(020).           *>更新端末
              05      FILLER      PIC  X(006).             *>予備
