      *8...........2.........3.........4.........5........6........7.........8
      *    QXCS05
      ****************************************************************
      *                ホスト審査情報ファイル                        *
      *                             DATA-WRITTEN  05.09.30           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO            修正理由             担当者   修正日付   *
      ****************************************************************
            03        ()-SEG.                              *>集計マスタ
              05      ()-PRM.                              *>エントリーキー
                07    ()-PRMSHINSAYM         PIC  9(06).   *>審査年月
                07    ()-KUGIRI01            PIC  X(01).   *>項目区切用エリア
                07    ()-PRMKIGYOUCD         PIC  9(04).   *>企業コード
                07    ()-KUGIRI02            PIC  X(01).   *>項目区切用エリア
                07    ()-PRMSUBRANGEKEY      PIC  9(04).   *>サブレンジ
                07    ()-KUGIRI03            PIC  X(01).   *>項目区切用エリア
                07    ()-PRMNAIBUKAIINNO     PIC  9(08).   *>内部会員番号
                07    ()-KUGIRI04            PIC  X(01).   *>項目区切用エリア
              05      ()-PARTITIONNO         PIC  9(02).   *>パーテーション番号
              05      ()-KUGIRI05            PIC  X(01).   *>項目区切用エリア
              05      ()-SHINSAGK01          PIC  9(05).   *>審査金額０１
              05      ()-KUGIRI06            PIC  X(01).   *>項目区切用エリア                    
              05      ()-SHINSAGK02          PIC  9(05).   *>審査金額０２
              05      ()-KUGIRI07            PIC  X(01).   *>項目区切用エリア                    
              05      ()-SHINSAGK03          PIC  9(05).   *>審査金額０３
              05      ()-KUGIRI08            PIC  X(01).   *>項目区切用エリア                    
              05      ()-SHINSAGK04          PIC  9(05).   *>審査金額０４
              05      ()-KUGIRI09            PIC  X(01).   *>項目区切用エリア                    
              05      ()-SHINSAGK05          PIC  9(05).   *>審査金額０５
              05      ()-KUGIRI10            PIC  X(01).   *>項目区切用エリア                    
              05      ()-SHINSAGK06          PIC  9(05).   *>審査金額０６
              05      ()-KUGIRI11            PIC  X(01).   *>項目区切用エリア                    
              05      ()-SHINSAGK07          PIC  9(05).   *>審査金額０７
              05      ()-KUGIRI12            PIC  X(01).   *>項目区切用エリア                    
              05      ()-SHINSAGK08          PIC  9(05).   *>審査金額０８
              05      ()-KUGIRI13            PIC  X(01).   *>項目区切用エリア                    
              05      ()-SHINSAGK09          PIC  9(05).   *>審査金額０９
              05      ()-KUGIRI14            PIC  X(01).   *>項目区切用エリア                    
              05      ()-SHINSAGK10          PIC  9(05).   *>審査金額１０
              05      ()-KUGIRI15            PIC  X(01).   *>項目区切用エリア                    
              05      ()-SVTOUROKUDATE       PIC  9(14).   *>作成日時    
              05      ()-KUGIRI16            PIC  X(01).   *>項目区切用エリア                    
              05      FILLER                 PIC  X(15).   *>
              05      ()-CR                  PIC  X(01).   *>改行コード
      
