      *8...........2.........3.........4.........5........6........7.........8
      *    QXCS07
      ****************************************************************
      *                審査結果ファイル                              *
      *                             DATA-WRITTEN  05.09.30           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO            修正理由             担当者   修正日付   *
      ****************************************************************
            03        ()-SEG.                              *>集計マスタ
              05      ()-PRM.                              *>エントリーキー
                07    ()-PRMSHINSAYM         PIC  9(06).   *>審査年月
                07    ()-KUGIRI01            PIC  X(01).   *>項目区切用エリア
                07    ()-PRMKIGYOUCD         PIC  9(04).   *>企業コード
                07    ()-KUGIRI02            PIC  X(01).   *>項目区切用エリア
                07    ()-PRMSUBRANGEKEY      PIC  9(04).   *>サブレンジ
                07    ()-KUGIRI03            PIC  X(01).   *>項目区切用エリア
                07    ()-PRMNAIBUKAIINNO     PIC  9(08).   *>内部会員番号
                07    ()-KUGIRI04            PIC  X(01).   *>項目区切用エリア
              05      ()-PARTITIONNO         PIC  9(02).   *>パーテーション番号
              05      ()-KUGIRI05            PIC  X(01).   *>項目区切用エリア
              05      ()-LSTSHINSA           PIC  X(01).   *>最終審査結果
              05      ()-KUGIRI06            PIC  X(01).   *>項目区切用エリア
              05      ()-LSTRANK             PIC  X(01).   *>最終与信ランク
              05      ()-KUGIRI07            PIC  X(01).   *>項目区切用エリア
              05      ()-LSTSOUGENDO         PIC  9(05).   *>最終総限度額
              05      ()-KUGIRI08            PIC  X(01).   *>項目区切用エリア
              05      ()-LSTNOBEGENDO        PIC  9(05).   *>最終延払限度額
              05      ()-KUGIRI09            PIC  X(01).   *>項目区切用エリア
              05      ()-LSTCASHGENDO        PIC  9(05).   *>最終キャッシ限度額
              05      ()-KUGIRI10            PIC  X(01).   *>項目区切用エリア
              05      ()-JTIKBN              PIC  X(01).   *>状態区分
              05      ()-KUGIRI11            PIC  X(01).   *>項目区切用エリア
              05      ()-HOSTKEKKA           PIC  X(01).   *>更新不可理由
              05      ()-KUGIRI12            PIC  X(01).   *>項目区切用エリア
              05      ()-OPID                PIC  X(08).   *>更新担当者
              05      ()-KUGIRI13            PIC  X(01).   *>項目区切用エリア
              05      ()-WSID                PIC  X(20).   *>更新端末
              05      ()-KUGIRI14            PIC  X(01).   *>項目区切用エリア
              05      ()-SVTOUROKUDATE       PIC  9(14).   *>作成日時
              05      ()-KUGIRI15            PIC  X(01).   *>項目区切用エリア
              05      ()-SVKOUSHINDATE       PIC  9(14).   *>更新日時
              05      ()-KUGIRI16            PIC  X(01).   *>項目区切用エリア
              05      FILLER                 PIC  X(14).   *>
              05      ()-CR                  PIC  X(01).   *>改行コード
