      *8...........2.........3.........4.........5........6........7.........8
      *    QXCS10
      ****************************************************************
      *                集計削除データキーファイル                    *
      *                             DATA-WRITTEN  05.09.30           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO            修正理由             担当者   修正日付   *
      ****************************************************************
            03        ()-SEG.                              *>
              05      ()-PRM.                              *>エントリーキー
                07    ()-PRMSHINSAYM         PIC  X(06).   *>審査年月
                07    ()-PRMHSTSHINSA        PIC  X(01).   *>ホスト審査結果
              05      FILLER                 PIC  X(12).   *>
              05      ()-CR                  PIC  X(01).   *>改行コード
