      *8...........2.........3.........4.........5........6........7.........8
      *    QXCS14
      ****************************************************************
      *                結果集計更新ファイル                          *
      *                             DATA-WRITTEN  05.09.30           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO            修正理由             担当者   修正日付   *
      ****************************************************************
            03        ()-SEG.                              *>
              05      ()-PRM.                              *>エントリーキー
                07    ()-PRMSHINSAYM         PIC  X(06).   *>審査年月
                07    ()-PRMKIGYOUCD         PIC  X(04).   *>企業コード
                07    ()-PRMSUBRANGEKEY      PIC  X(04).   *>サブレンジキー
                07    ()-PRMNAIBUKAIINNO     PIC  X(08).   *>内部会員番号
              05      ()-KOUSINKEKKA         PIC  X(01).   *>更新結果
              05      ()-YSNRANK             PIC  X(01).   *>審査前与信ランク
              05      ()-LSTRANK             PIC  X(01).   *>最終与信ランク
              05      FILLER                 PIC  X(14).
              05      ()-CR                  PIC  X(01).   *>改行コード
