      *8...........2.........3.........4.........5........6........7.........8
      *    QXCS08
      ****************************************************************
      *                利用可能額改訂集計ファイル                    *
      *                             DATA-WRITTEN  05.09.30           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO            修正理由             担当者   修正日付   *
      ****************************************************************
            03        ()-SEG.                              *>
              05      ()-PRM.                              *>エントリーキー
                07    ()-PRMSHINSAYM         PIC  X(06).   *>主キー・審査年月
                07    ()-KUGIRI01            PIC  X(01).   *>項目区切用エリア
                07    ()-PRMHSTSHINSA        PIC  X(01).   *>ホスト審査結果
                07    ()-KUGIRI02            PIC  X(01).   *>項目区切用エリア
              05      ()-TOTALCOUNT          PIC  9(09).   *>総件数
              05      ()-KUGIRI03            PIC  X(01).   *>項目区切用エリア
              05      ()-HORYUCOUNT          PIC  9(09).   *>保留件数
              05      ()-KUGIRI04            PIC  X(01).   *>項目区切用エリア
              05      ()-KAKUAGECOUNT        PIC  9(09).   *>格上げ件数
              05      ()-KUGIRI05            PIC  X(01).   *>項目区切用エリア
              05      ()-UPCOUNT             PIC  9(09).   *>更新件数
              05      ()-KUGIRI06            PIC  X(01).   *>項目区切用エリア
              05      ()-SVTOUROKUDATE       PIC  9(14).   *>作成日時
              05      ()-KUGIRI07            PIC  X(01).   *>項目区切用エリア
              05      ()-SVKOUSHINDATE       PIC  9(14).   *>更新日時
              05      ()-KUGIRI08            PIC  X(01).   *>項目区切用エリア
              05      FILLER                 PIC  X(20).   *>
              05      ()-CR                  PIC  X(01).   *>改行コード
