      *8...........2.........3.........4.........5........6........7.........8
      *    QXCS11
      ****************************************************************
      *                結果集計削除データキーファイル                *
      *                             DATA-WRITTEN  05.09.30           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO            修正理由             担当者   修正日付   *
      ****************************************************************
            03        ()-SEG.                              *>
              05      ()-PRM.                              *>エントリーキー
                07    ()-PRMSHINSAYM         PIC  X(06).   *>審査年月
                07    ()-PRMYSNRANK          PIC  X(01).   *>審査前与信ランク
                07    ()-PRMLSTRANK          PIC  X(01).   *>最終審査与信ランク
              05      FILLER                 PIC  X(18).   *>
              05      ()-CR                  PIC  X(01).   *>改行コード
