      *8...........2.........3.........4.........5........6........7.........8
      *    QXCS06
      ****************************************************************
      *                利用可能額改訂実行可否ファイル                *
      *                             DATA-WRITTEN  05.09.30           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO            修正理由             担当者   修正日付   *
      ****************************************************************
            03        ()-SEG.                              *>集計マスタ
              05      ()-PRM.                              *>エントリーキー
                07    ()-PRMSHINSAYM         PIC  9(06).   *>主キー・審査年月
                07    ()-KUGIRI01            PIC  X(01).   *>項目区切用エリア
                07    ()-PRMKIGYOUCD         PIC  9(04).   *>主キー・企業コード
                07    ()-KUGIRI02            PIC  X(01).   *>項目区切用エリア
                07    ()-PRMSUBRANGEKEY      PIC  9(04).   *>主キー・サブレンジ
                07    ()-KUGIRI03            PIC  X(01).   *>項目区切用エリア
                07    ()-PRMNAIBUKAIINNO     PIC  9(08).   *>主キー・内部会員番号
                07    ()-KUGIRI04            PIC  X(01).   *>項目区切用エリア
              05      ()-PARTITIONNO         PIC  9(02).   *>パーテーション番号
              05      ()-KUGIRI05            PIC  X(01).   *>項目区切用エリア
              05      ()-KAHI01              PIC  X(01).   *>実行可否０１
              05      ()-KUGIRI06            PIC  X(01).   *>項目区切用エリア
              05      ()-KAHI02              PIC  X(01).   *>実行可否０２
              05      ()-KUGIRI07            PIC  X(01).   *>項目区切用エリア
              05      ()-KAHI03              PIC  X(01).   *>実行可否０３
              05      ()-KUGIRI08            PIC  X(01).   *>項目区切用エリア
              05      ()-KAHI04              PIC  X(01).   *>実行可否０４
              05      ()-KUGIRI09            PIC  X(01).   *>項目区切用エリア
              05      ()-KAHI05              PIC  X(01).   *>実行可否０５
              05      ()-KUGIRI10            PIC  X(01).   *>項目区切用エリア
              05      ()-KAHI06              PIC  X(01).   *>実行可否０６
              05      ()-KUGIRI11            PIC  X(01).   *>項目区切用エリア
              05      ()-KAHI07              PIC  X(01).   *>実行可否０７
              05      ()-KUGIRI12            PIC  X(01).   *>項目区切用エリア
              05      ()-KAHI08              PIC  X(01).   *>実行可否０８
              05      ()-KUGIRI13            PIC  X(01).   *>項目区切用エリア
              05      ()-KAHI09              PIC  X(01).   *>実行可否０９
              05      ()-KUGIRI14            PIC  X(01).   *>項目区切用エリア
              05      ()-KAHI10              PIC  X(01).   *>実行可否１０
              05      ()-KUGIRI15            PIC  X(01).   *>項目区切用エリア
              05      ()-KAHI11              PIC  X(01).   *>実行可否１１
              05      ()-KUGIRI16            PIC  X(01).   *>項目区切用エリア
              05      ()-KAHI12              PIC  X(01).   *>実行可否１２
              05      ()-KUGIRI17            PIC  X(01).   *>項目区切用エリア
              05      ()-KAHI13              PIC  X(01).   *>実行可否１３
              05      ()-KUGIRI18            PIC  X(01).   *>項目区切用エリア
              05      ()-KAHI14              PIC  X(01).   *>実行可否１４
              05      ()-KUGIRI19            PIC  X(01).   *>項目区切用エリア
              05      ()-KAHI15              PIC  X(01).   *>実行可否１５
              05      ()-KUGIRI20            PIC  X(01).   *>項目区切用エリア
              05      ()-KAHI16              PIC  X(01).   *>実行可否１６
              05      ()-KUGIRI21            PIC  X(01).   *>項目区切用エリア
              05      ()-KAHI17              PIC  X(01).   *>実行可否１７
              05      ()-KUGIRI22            PIC  X(01).   *>項目区切用エリア
              05      ()-KAHI18              PIC  X(01).   *>実行可否１８
              05      ()-KUGIRI23            PIC  X(01).   *>項目区切用エリア
              05      ()-KAHI19              PIC  X(01).   *>実行可否１９
              05      ()-KUGIRI24            PIC  X(01).   *>項目区切用エリア
              05      ()-KAHI20              PIC  X(01).   *>実行可否２０
              05      ()-KUGIRI25            PIC  X(01).   *>項目区切用エリア
              05      ()-SVTOUROKUDATE       PIC  9(14).   *>作成日時
              05      ()-KUGIRI26            PIC  X(01).   *>項目区切用エリア
              05      FILLER                 PIC  X(15).   *>
              05      ()-CR                  PIC  X(01).   *>改行コード
        
