      *8...........2.........3.........4.........5........6........7.........8
      *    QXCS01
      ****************************************************************
      *                利用可能額審査ファイル                        *
      *                             DATA-WRITTEN  05.09.30           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO            修正理由             担当者   修正日付   *
      ****************************************************************
            03        ()-SEG.                               *>審査レコード
              05      ()-G0010.                             *>キー項目
                07    ()-T0010.                             *>ロケーションキー
                  09  ()-A0010      PIC  9(004)  COMP-3.    *>企業コード
                  09  ()-A0020      PIC  9(004)  COMP-3.    *>サブレンジキー
                07    ()-A0030      PIC  9(008)  COMP-3.    *>内部会員番号
                07    ()-A0040      PIC  9(006)  COMP-3.    *>審査年月
              05      ()-G0050.                             *>会員情報
                07    ()-A0050      PIC  9(002).            *>管理店
                07    ()-A0060      PIC  X(006).            *>カード区分
                07    ()-A0070      PIC  9(016)  COMP-3.    *>カード番号
                07    ()-T0080.                             *>漢字氏名キャラ
                  09  ()-A0080      PIC  N(015).            *>漢字氏名
                07    ()-A0120      PIC  9(004)  COMP-3.    *>代表ステータス
                07    ()-T0130.                             *>改定前
                  09  ()-A0130      PIC  X(001).            *>与信ランク
                  09  ()-A0140      PIC  S9(005) COMP-3.    *>総限度額
                  09  ()-A0150      PIC  S9(005) COMP-3.    *>延べ払い限度額
                  09  ()-A0160      PIC  S9(005) COMP-3.    *>キャッシング限度額
              05      ()-G0170.                             *>審査結果
                07    ()-T0170.                             *>審査結果区分
                  09  ()-A0170      PIC  X(001).            *>自動審査結果
                07    ()-T0190.                             *>自動審査
                  09  ()-A0190      PIC  X(001).            *>与信ランク
                  09  ()-A0200      PIC  S9(005) COMP-3.    *>総限度額
                  09  ()-A0210      PIC  S9(005) COMP-3.    *>延べ払い限度額
                  09  ()-A0220      PIC  S9(005) COMP-3.    *>キャッシング限度額
                07    ()-T0270      OCCURS 8.               *>審査結果テーブル
                  09  ()-A0270      PIC  S9(005) COMP-3.    *>利用可能額候補
                07    ()-T0280.                             *>改定条件テーブル
                  09  ()-A0280      PIC  X(001).            *>実行可否・代表
                  09  ()-A0290      PIC  X(001) OCCURS 20.  *>実行可否
              05      ()-G0300.                             *>審査項目
                07    ()-T0300.                             *>会員情報
                  09  ()-A0300      PIC  9(006)  COMP-3.    *>入会年月
                  09  ()-A0310      PIC  9(001).            *>リボ定・ショ
                  09  ()-A0320      PIC  9(001).            *>リボ定・キャ
                  09  ()-A0330      PIC  9(002).            *>ＰＯＳステータス
                  09  ()-A0340      PIC  9(006)  COMP-3.    *>有効期限
                  09  ()-A0350      PIC  9(004)  COMP-3.    *>その他ステータス
                  09  ()-A0360      PIC  X(001).            *>年会費同意フラグ
                07    ()-T0370.                             *>利用情報
                  09  ()-A0370      PIC  9(006)  COMP-3.    *>最新利用年月
                  09  ()-A0380      PIC  9(002).            *>１回払利用月数
                  09  ()-A0390      PIC  S9(007) COMP-3.    *>１回払利用平均１
                  09  ()-A0400      PIC  S9(007) COMP-3.    *>１回払利用平均２
                  09  ()-A0410      PIC  S9(007) COMP-3.    *>全利用額
                  09  ()-A0420      PIC  S9(007) COMP-3.    *>延払い利用額
                  09  ()-A0430      PIC  S9(007) COMP-3.    *>キャッシング利用額
                07    ()-T0440.                             *>入金情報
                  09  ()-A0440      PIC  9(002).            *>自振引落直近１２ヶ月
                  09  ()-A0450      PIC  9(002).            *>引落不能直近１２回
                  09  ()-A0460      PIC  9(002).            *>引落不能直近６ヶ月
                  09  ()-A0470      PIC  S9(007) COMP-3.    *>全入金額
                  09  ()-A0480      PIC  S9(007) COMP-3.    *>引落以外入金額
                  09  ()-A0490      PIC  9(002).            *>高額入金回数引落以外
                07    ()-T0500.                             *>残高情報
                  09  ()-A0500      PIC  S9(007) COMP-3.    *>全残高
                  09  ()-A0510      PIC  S9(007) COMP-3.    *>延払い残高
                  09  ()-A0520      PIC  S9(007) COMP-3.    *>Ｓリボ払い残高
                  09  ()-A0530      PIC  S9(007) COMP-3.    *>Ｃリボ払い残高
              05      ()-G0540.                             *>管理情報
                07    ()-A0540      PIC  9(007)  COMP-3.    *>作成日
              05       FILLER       PIC  X(011).            *>予備
