      *8...........2.........3.........4.........5........6........7.........8
      *    QXCS13
      ****************************************************************
      *                審査結果更新ファイル                          *
      *                             DATA-WRITTEN  05.09.30           *
      *--------------------------------------------------------------*
      *                  修  正  履  歴                              *
      *   管理NO            修正理由             担当者   修正日付   *
      ****************************************************************
            03        ()-SEG.                              *>
              05      ()-PRM.                              *>キー項目
                07    ()-PRMSHINSAYM         PIC  X(06).   *>審査年月
                07    ()-PRMKIGYOUCD         PIC  X(04).   *>企業コード
                07    ()-PRMSUBRANGEKEY      PIC  X(04).   *>サブレンジ
                07    ()-PRMNAIBUKAIINNO     PIC  X(08).   *>内部会員番号
                07    ()-KOUSINKEKKA         PIC  X(01).   *>更新結果
                07    ()-JTIKBN              PIC  X(01).   *>状態区分
                07    FILLER                 PIC  X(15).   *>状態区分
              05      ()-CR                  PIC  X(01).   *>改行コード
