      *****************************************************************
      * モニタリング監視統計資料テーブルローダー用ファイル
      *****************************************************************
           03  QXS005-MONTOKEI.
               05  QXS005-SYUKEIYMD                   PIC X(010).
               05  QXS005-SUMTORIHIKIKBN              PIC X(001).
               05  QXS005-SUMKBN                      PIC X(001).
               05  QXS005-SUMTAISHOFROM               PIC X(004).
               05  QXS005-SUMTAISHOTO                 PIC X(004).
               05  QXS005-KENSU                       PIC 9(011).
               05  QXS005-KINGAKU                     PIC 9(011).
