      *****************************************************************
      * â¡ñøìXèÓïÒÉtÉ@ÉCÉã
      *****************************************************************
           03  QXS007-HOSTKAMEITENDATA.
               05  QXS007-TANMATUNO.
                   07  QXS007-CREDITKAISHACD          PIC X(005).
                   07  QXS007-MAKERCD                 PIC X(002).
                   07  QXS007-KISHUCD                 PIC X(001).
                   07  QXS007-TERMTUBAN               PIC X(005).
               05  QXS007-KAMEITENITEM.
                   07  QXS007-KANAMEI                 PIC X(030).
                   07  QXS007-KANJIMEI                PIC X(040).
                   07  QXS007-ADDRCD                  PIC X(010).
                   07  QXS007-ZIPCD.
                       09  QXS007-ZIPCD1              PIC X(003).
                       09  QXS007-ZIPCD2              PIC X(004).
                   07  QXS007-ADDR.
                       09  QXS007-ADDR1               PIC X(040).
                       09  QXS007-ADDR2               PIC X(040).
                       09  QXS007-BANCHI              PIC X(020).
                       09  QXS007-KATAGAKI            PIC X(040).
                   07  QXS007-TELNO                   PIC X(015).
                   07  QXS007-UPDKBN                  PIC X(001).
                   07  QXS007-CREATEDATE              PIC X(006).
