      *****************************************************************
      * 加盟店情報マスタ更新用ファイル
      *****************************************************************
           03  QXS008-HOSTKAMEITENDATA.
               05  QXS008-TANMATUNO                   PIC X(013).
               05  QXS008-KAMEITENITEM.
                   07  QXS008-KANAMEI                 PIC X(030).
                   07  QXS008-KANJIMEI                PIC X(040).
                   07  QXS008-ADDRCD                  PIC X(010).
                   07  QXS008-TELNO                   PIC X(015).
                   07  QXS008-ZIPCD                   PIC X(007).
                   07  QXS008-ADDR                    PIC X(255).
                   07  QXS008-GYOUSHU                 PIC X(001).
                   07  QXS008-TORISHOHIN              PIC X(003).
                   07  QXS008-SAKUSEIMOTO             PIC X(001).
                   07  QXS008-UPDDATE                 PIC X(010).
                   07  QXS008-UPDKBN                  PIC X(001).
