      *****************************************************************
      * 受信済更新用ファイル
      *****************************************************************
           03  QXS013-MONITORINGDATA.
               05  QXS013-CAFISKEY.
                   07  QXS013-CENTERID                PIC X(002).
                   07  QXS013-CAFISTUBAN              PIC X(006).
                   07  QXS013-CENTERSKB               PIC X(002).
                   07  QXS013-TORIHIKIKBN             PIC X(001).
                   07  QXS013-SHORIYMD                PIC X(006).
                   07  QXS013-JYUSHINTIME             PIC X(006).
               05  QXS013-KAIINM-KEY.
                   07  QXS013-KIGYOUCD                PIC X(004).
                   07  QXS013-SUBRANGEKEY             PIC X(004).
                   07  QXS013-NAIBUKAIINNO            PIC X(008).
               05  QXS013-RECVSEQNO                   PIC 9(008).
