           03  CNS-HAKKENARI            PIC X(001)  VALUE  '1'.
           03  CNS-HAKKENNASI           PIC X(001)  VALUE  '2'.
           03  CNS-NYUUKAIARI           PIC X(001)  VALUE  '1'.
           03  CNS-NYUUKAINASI          PIC X(001)  VALUE  '2'.

           03  CNS-YUUCHOKOZA           PIC X(004)  VALUE  '9900'.

           03  CNS-KINMUHONNIN          PIC X(001)  VALUE  '1'.
           03  CNS-KINMUKAZOKUA         PIC X(001)  VALUE  '2'.
           03  CNS-KINMUKAZOKUN         PIC X(001)  VALUE  '3'.
           03  CNS-KINMUHOSYONIN        PIC X(001)  VALUE  '4'.
           03  CNS-KINMUSINKENSYA       PIC X(001)  VALUE  '5'.
           03  CNS-KINMUKINMUSYA        PIC X(001)  VALUE  '6'.

           03  CNS-SINKKBNSINKEN        PIC X(001)  VALUE  '1'.
           03  CNS-SINKKBNHOSYO         PIC X(001)  VALUE  '2'.

           03  CNS-BIRTHDAYBASE         PIC 9(008)  VALUE  19000000.
           03  CNS-90NENDAI             PIC 9(002)  VALUE  99.
           03  CNS-1900NENDAI           PIC 9(001)  VALUE  0.
           03  CNS-2000NENDAI           PIC 9(001)  VALUE  1.
           03  CNS-1900NEN              PIC 9(004)  VALUE  1900.
           03  CNS-2000NEN              PIC 9(004)  VALUE  2000.

           03  CNS-IRAIARI              PIC X(001)  VALUE  '1'.
           03  CNS-NONE                 PIC X(001)  VALUE  '0'.
           03  CNS-SYOKAI               PIC X(001)  VALUE  '0'.
           03  CNS-SAIIRAI              PIC X(001)  VALUE  '1'.
           
           03  CNS-REQKAZOKUHAKKEN      PIC X(001)  VALUE  '2'.
           03  CNS-REQKAZOKUHAKKENNASI  PIC X(001)  VALUE  '3'.
           03  CNS-KINMUSINKEN          PIC X(001)  VALUE  '5'.

           03  CNS-CARDTC               PIC X(001)  VALUE  '1'.
           03  CNS-CARDTG               PIC X(001)  VALUE  '2'.
           03  CNS-CARDROAN             PIC X(001)  VALUE  '3'.

           03  CNS-MSGINFO              PIC X(001)  VALUE 'I'.
           03  CNS-MSGWARN              PIC X(001)  VALUE 'W'.
           03  CNS-MSGERR               PIC X(001)  VALUE 'E'.

           03  CNS-NOTNULL              PIC S9(004) VALUE  0.

           03  CNS-SKINMUKBNHONNIN      PIC X(001)  VALUE  '1'.
           03  CNS-SKINMUKBNHAIGUUSYA   PIC X(001)  VALUE  '2'.
           03  CNS-SKINMUKBNSONOTA      PIC X(001)  VALUE  '3'.
           03  CNS-HSKINMUKBNHONNIN     PIC X(001)  VALUE  '1'.
           03  CNS-HKINMUKBNKINMUSAKI   PIC X(001)  VALUE  '2'.

           03  CNS-HAIGUSYAARI          PIC X(001)  VALUE  '1'.
           03  CNS-HAIGUSYANASI         PIC X(001)  VALUE  '2'.

           03  CNS-DOKYOKBNDOKYO        PIC X(001)  VALUE  '1'.
           03  CNS-DOKYOKBNBEKKYO       PIC X(001)  VALUE  '2'.

           03  CNS-HKAZOKUHAIGUAKODOMOA PIC X(001)  VALUE  'A'.
           03  CNS-HKAZOKUHAIGUA        PIC X(001)  VALUE  'B'.
           03  CNS-HKAZOKUHAIGUNRYOSIND PIC X(001)  VALUE  'C'.
           03  CNS-HKAZOKUHAIGUNRYOSINB PIC X(001)  VALUE  'D'.
 
           03  CNS-JYUUKYOJIKO          PIC X(001)  VALUE  '1'.
           03  CNS-JYUUKYOKAZOKU        PIC X(001)  VALUE  '2'.
           03  CNS-JYUUKYOKOEI          PIC X(001)  VALUE  '3'.
           03  CNS-JYUUKYOMANSYON       PIC X(001)  VALUE  '4'.
           03  CNS-JYUUKYOSYAKUYA       PIC X(001)  VALUE  '5'.
           03  CNS-JYUUKYOAPART         PIC X(001)  VALUE  '6'.
           03  CNS-JYUUKYOSYATAKU       PIC X(001)  VALUE  '7'.
           03  CNS-JYUUKYOSONOTA        PIC X(001)  VALUE  '8'.

           03  QXA1-HJYUUKYOMOCHIIE     PIC X(001)  VALUE  'A'.
           03  QXA1-HJYUUKYOSYATAKU     PIC X(001)  VALUE  'B'.
           03  QXA1-HJYUUKYOMANSYON     PIC X(001)  VALUE  'C'.
           03  QXA1-HJYUUKYOSYAKUYA     PIC X(001)  VALUE  'D'.
           03  QXA1-HJYUUKYOKARIMA      PIC X(001)  VALUE  'E'.
 
           03  CNS-NENSYU1000I          PIC X(001)  VALUE  '1'.
           03  CNS-NENSYU1000M          PIC X(001)  VALUE  '2'.
           03  CNS-NENSYU800M           PIC X(001)  VALUE  '3'.
           03  CNS-NENSYU500M           PIC X(001)  VALUE  '4'.
           03  CNS-NENSYU300M           PIC X(001)  VALUE  '5'.
           03  CNS-NENSYU100M           PIC X(001)  VALUE  '6'.

           03  CNS-HNENSYU800I          PIC X(001)  VALUE  'A'.
           03  CNS-HNENSYU800M          PIC X(001)  VALUE  'B'.
           03  CNS-HNENSYU500M          PIC X(001)  VALUE  'C'.
           03  CNS-HNENSYU300M          PIC X(001)  VALUE  'D'.
           03  CNS-HNENSYU150M          PIC X(001)  VALUE  'E'.

