      *****************************************************************
      * 更新依頼抽出データ
      *****************************************************************
           03  QXTS21-TRN.
               05  QXTS21-TABANO                      PIC X(05).
               05  QXTS21-KIGYOUCD                    PIC X(04).
               05  QXTS21-SUBRANGEKEY                 PIC X(04).
               05  QXTS21-NAIBUKAIINNO                PIC X(08).
               05  QXTS21-INQKBN                      PIC X(01).
               05  QXTS21-KAZOKURBN                   PIC X(01).
