      *****************************************************************
      * êMópè∆âÔèÓïÒ
      *****************************************************************
              03  QXTS09-DATA.
                  05  QXTS09-TYPE                           PIC  X(02).
                  05  QXTS09-NAME                           PIC  X(30).
                  05  QXTS09-SYMD                           PIC  9(07).
                  05  QXTS09-YUBIN                          PIC  9(05).
                  05  QXTS09-CHIBAN                         PIC  X(03).
                  05  QXTS09-TEL1                           PIC  X(14).
                  05  QXTS09-TEL2                           PIC  X(14).
                  05  FILLER                                PIC  X(6).
