      *****************************************************************
      * êMópè∆âÔóöó
      *****************************************************************
              03  QXTS10-DATA.
                  05  QXTS10-KAIIN                          PIC  X(09).
                  05  QXTS10-INQYMD                         PIC  9(07).
                  05  QXTS10-HOKBN                          PIC  X(01).
                  05  QXTS10-KYKBN                          PIC  X(02).
                  05  QXTS10-HINMEI                         PIC  X(03).
                  05  QXTS10-YUSHI                          PIC  9(06).
                  05  QXTS10-HARAI                          PIC  9(03).
                  05  QXTS10-INQMOTO                        PIC  X(02).
                  05  FILLER                                PIC  X(20).
