      *****************************************************************
      * êMópå¬ï èÓïÒ
      *****************************************************************
              03  QXTS08-DATA.
                  05  QXTS08-KAIIN                          PIC  X(09).
                  05  QXTS08-KYKNO                          PIC  X(20).
                  05  QXTS08-JYMD                           PIC  9(7).
                  05  QXTS08-JYOSYU                         PIC  X(02).
                  05  QXTS08-RIYU                           PIC  X(02).
                  05  QXTS08-KYMD                           PIC  9(7).
                  05  QXTS08-KYKBN                          PIC  X(02).
                  05  QXTS08-TANPO                          PIC  X(01).
                  05  QXTS08-SYOHIN                         PIC  X(07).
                  05  QXTS08-YUSHI                          PIC S9(06).
                  05  QXTS08-HARAI                          PIC S9(03).
                  05  QXTS08-ZANSAI                         PIC S9(06).
                  05  QXTS08-ENTAI                          PIC  X(02).
                  05  QXTS08-ENTAIDO                        PIC  X(02).
                  05  QXTS08-SUMIYMD                        PIC  9(07).
                  05  QXTS08-HOKBN                          PIC  X(01).
                  05  QXTS08-HONEME                         PIC  X(30).
                  05  QXTS08-TEKIYO                         PIC  X(20).
                  05  QXTS08-SAIBAN                         PIC  X(20).
                  05  QXTS08-JIKEN                          PIC  X(08).
                  05  QXTS08-FNO                            PIC S9(03).
                  05  QXTS08-FPAGE                          PIC  X(03).
                  05  QXTS08-JYUNEN                         PIC  X(01).
                  05  QXTS08-SYOKU                          PIC  X(01).
                  05  QXTS08-KNMNAME                        PIC  X(30).
                  05  QXTS08-KNMTEL                         PIC  X(14).
                  05  QXTS08-KNMTELK                        PIC  X(01).
                  05  QXTS08-KNMNEN                         PIC  X(02).
                  05  QXTS08-NENSYU                         PIC  X(01).
                  05  QXTS08-SYOTOKU1                       PIC  X(01).
                  05  QXTS08-SYOTOKU2                       PIC  X(01).
                  05  QXTS08-SYOTOKU3                       PIC  X(01).
                  05  QXTS08-CMNT                           PIC  X(01).
                  05  QXTS08-KNPCMNT                        PIC  X(01).
                  05  QXTS08-TEISHI                         PIC  X(01).
                  05  QXTS08-RIREKI                         PIC  X(12).
                  05  QXTS08-RUISUU                         PIC  X(04).
                  05  QXTS08-KSNYMD                         PIC  9(07).
                  05  QXTS08-GYOSYU                         PIC  X(02).
                  05  QXTS08-CMNTUMU                        PIC  X(01).
                  05  FILLER                                PIC  X(40).
                  05  QXTS08-FUKCMNT                        PIC  X(100).
                  05  QXTS08-KNMNAME2                       PIC  X(30).
                  05  QXTS08-KNMTEL2                        PIC  X(14).
