      *****************************************************************
      * 限度額昇降会員マスタ分割情報
      *****************************************************************
              03  QXTS23-DATA.
                  05  QXTS23-KEY-INFO.
                     07  QXTS23-PRMTABANO                   PIC  X(05).
                     07  QXTS23-PRMKIGYOUCD                 PIC  X(04).
                     07  QXTS23-PRMSUBRANGEKEY              PIC  X(04).
                     07  QXTS23-PRMNAIBUKAIINNO             PIC  X(08).

