      *****************************************************************
      * ÇbÇqäÓñ{óvåè
      *****************************************************************
              03  QXTS03-DATA.
                  05  QXTS03-TYPE                           PIC  X(02).
                  05  QXTS03-ENTRYITEM.
                      07  QXTS03-KANANA                     PIC  X(30).
                      07  QXTS03-KANJINA                    PIC  X(20).
                      07  QXTS03-SYMD                       PIC  9(07).
                      07  QXTS03-YUBIN                      PIC  9(05).
                      07  QXTS03-CHIBAN                     PIC  X(03).
                      07  QXTS03-KANAADD                    PIC  X(60).
                      07  QXTS03-KANJIADD                   PIC  X(80).
                      07  QXTS03-ADD                        PIC  X(11).
                      07  QXTS03-CHIBANKT                   PIC  X(60).
                      07  QXTS03-TEL                        PIC  X(14).
                      07  QXTS03-TELKBN                     PIC  X(1).
                      07  QXTS03-SEX                        PIC  X(1).
                      07  QXTS03-HAIGU                      PIC  X(1).
                  05  QXTS03-FUKAITEM.
                      07  QXTS03-ZANSAI                     PIC  9(06).
                      07  QXTS03-KOBETKN                    PIC  9(02).
                      07  QXTS03-ZHANFLG1                   PIC  X(01).
                      07  QXTS03-ZHANFLG2                   PIC  X(01).
                  05  FILLER                                PIC  X(20).
