      *****************************************************************
      * êMópóﬁéóéÅñº
      *****************************************************************
              03  QXTS13-DATA.
                  05  QXTS13-TYPE                           PIC  X(02).
                  05  QXTS13-RUINAME                        PIC  X(30).
