      *****************************************************************
      * êMópóﬁéóèÓïÒ
      *****************************************************************
              03  QXTS11-DATA.
                  05  QXTS11-TYPE                           PIC  X(02).
                  05  QXTS11-NAME                           PIC  X(30).
                  05  QXTS11-SYMD                           PIC  9(07).
                  05  QXTS11-YUBIN                          PIC  9(05).
                  05  QXTS11-CHIBAN                         PIC  X(03).
                  05  QXTS11-ADD                            PIC  X(60).
                  05  QXTS11-TEL                            PIC  X(14).
                  05  QXTS11-TELKBN                         PIC  X(01).
                  05  QXTS11-SEX                            PIC  X(01).
                  05  QXTS11-HOJIN                          PIC  X(01).
                  05  QXTS11-JYUKYO                         PIC  X(01).
                  05  QXTS11-HAIGU                          PIC  X(01).
                  05  QXTS11-JYMD                           PIC  9(07).
                  05  QXTS11-JYOSYU                         PIC  X(02).
                  05  QXTS11-RIYU                           PIC  X(02).
                  05  FILLER                                PIC  X(30).
