      *****************************************************************
      * êMópäÓñ{
      *****************************************************************
              03  QXTS06-DATA.
                  05  QXTS06-IDXNO                          PIC X(6).
                  05  QXTS06-INQNO                          PIC X(6).
                  05  QXTS06-SEQNO                          PIC X(18).
                  05  QXTS06-SINYOCNT.
                      07  QXTS06-DTSBT                      PIC  X(02).
                      07  QXTS06-CRE1                       PIC  9(03).
                      07  QXTS06-CRE21                      PIC  9(03).
                      07  QXTS06-CRE22                      PIC  9(03).
                      07  QXTS06-CRE23                      PIC  9(03).
                      07  QXTS06-CRE24                      PIC  9(03).
                      07  QXTS06-CRE25                      PIC  9(03).
                      07  QXTS06-CRE26                      PIC  9(03).
                      07  QXTS06-CRE27                      PIC  9(03).
                      07  QXTS06-CRE28                      PIC  9(03).
                      07  QXTS06-CRE29                      PIC  9(03).
                      07  QXTS06-CRE210                     PIC  9(03).
                  05  QXTS06-SHOKAICNT.
                      07  QXTS06-INQ1                       PIC  9(03).
                      07  QXTS06-INQ21                      PIC  9(03).
                      07  QXTS06-INQ22                      PIC  9(03).
                      07  QXTS06-INQ23                      PIC  9(03).
                      07  QXTS06-INQ24                      PIC  9(03).
                      07  QXTS06-INQ25                      PIC  9(03).
                      07  QXTS06-INQ26                      PIC  9(03).
                      07  QXTS06-INQ27                      PIC  9(03).
                      07  QXTS06-INQ28                      PIC  9(03).
                      07  QXTS06-INQ29                      PIC  9(03).
                      07  QXTS06-INQ210                     PIC  9(03).
                      07  QXTS06-RUIJI                      PIC  9(03).
                      07  QXTS06-TELS1                      PIC  9(03).
                      07  QXTS06-TELS2                      PIC  9(03).
                      07  QXTS06-RUIMEI                     PIC  9(03).
