      *****************************************************************
      * インターフェースヘッダー
      *****************************************************************
           03  QXTS20-HEADER.
               05  QXTS20-TABANO                      PIC X(05).
               05  QXTS20-KIGYOUCD                    PIC X(04).
               05  QXTS20-SUBRANGEKEY                 PIC X(04).
               05  QXTS20-NAIBUKAIINNO                PIC X(08).
               05  QXTS20-INQKBN                      PIC X(01).
               05  QXTS20-KAZOKURBN                   PIC X(01).
               05  QXTS20-RECORDKBN                   PIC X(01).
               05  QXTS20-RECORDSKB1                  PIC X(01).
               05  QXTS20-RENBAN1                     PIC X(02).
               05  QXTS20-RECORDSKB2                  PIC X(01).
               05  QXTS20-RENBAN2                     PIC X(02).
