      *****************************************************************
      * ‚b‚qŠî–{
      *****************************************************************
              03  QXTS02-DATA.
                  05  QXTS02-IDXNO                          PIC  9(06).
                  05  QXTS02-INQNO                          PIC  9(06).
                  05  QXTS02-SEQNO                          PIC  9(18).
                  05  QXTS02-DTSBT                          PIC  X(02).
                  05  QXTS02-CREDT                          PIC  9(03).
                  05  QXTS02-KOBET1                         PIC  9(03).
                  05  QXTS02-KOBET2                         PIC  9(03).
                  05  QXTS02-KOBET3                         PIC  9(03).
                  05  QXTS02-KOBET4                         PIC  9(03).
                  05  QXTS02-KOBET5                         PIC  9(03).
                  05  QXTS02-KOBET6                         PIC  9(03).
                  05  QXTS02-KOBET7                         PIC  9(03).
                  05  QXTS02-KOBET8                         PIC  9(03).
                  05  QXTS02-KOBET9                         PIC  9(03).
                  05  QXTS02-KOBET10                        PIC  9(03).
                  05  QXTS02-RUIJI                          PIC  9(03).
