      *****************************************************************
      * CRóﬁéóèÓïÒ
      *****************************************************************
              03  QXTS05-DATA.
                  05  QXTS05-TYPE                            PIC X(02).
                  05  QXTS05-KANANA                          PIC X(30).
                  05  QXTS05-KANJINA                         PIC X(20).
                  05  QXTS05-SYMD                            PIC 9(07).
                  05  QXTS05-YUBIN                           PIC 9(05).
                  05  QXTS05-CHIBAN                          PIC X(03).
                  05  QXTS05-KANAADD                         PIC X(60).
                  05  QXTS05-TEL                             PIC X(14).
                  05  QXTS05-SAISHYMD                        PIC 9(07).
                  05  QXTS05-SAISKNM                         PIC X(30).
                  05  FILLER                                 PIC X(10).
