      *****************************************************************
      * 信用電話番号識別
      *****************************************************************
              03  QXTS12-DATA.
                  05  QXTS12-KUBUN                          PIC  X(02).
                  05  QXTS12-NAME                           PIC  X(30).
                  05  QXTS12-SYMD                           PIC  9(07).
                  05  QXTS12-YUBIN                          PIC  X(05).
                  05  QXTS12-CHIBAN                         PIC  X(03).
                  05  QXTS12-TEL                            PIC  X(14).
                  05  QXTS12-KRKYM                          PIC  X(04).
                  05  QXTS12-JYOKBN                         PIC  X(01).
                  05  QXTS12-NAME2                          PIC  X(30).
      *           05  FILLER                                PIC  X(30).
