      *****************************************************************
      * êMópèÓïÒ
      *****************************************************************
                03  QXTS07-DATA.
                    05  QXTS07-TYPE                           PIC X(02).
                    05  QXTS07-NAME                           PIC X(30).
                    05  QXTS07-SYMD                           PIC 9(07).
                    05  QXTS07-YUBIN                          PIC 9(05).
                    05  QXTS07-CHIBAN                         PIC X(03).
                    05  QXTS07-ADD                            PIC X(60).
                    05  QXTS07-TEL                            PIC X(14).
                    05  QXTS07-TELKBN                         PIC X(01).
                    05  QXTS07-SEX                            PIC X(01).
                    05  QXTS07-HOJIN                          PIC X(01).
                    05  QXTS07-JYUKYO                         PIC X(01).
                    05  QXTS07-HAIGU                          PIC X(01).
                    05  FILLER                                PIC X(30).
