      *****************************************************************
      * ÇbÇqå¬ï óvåè
      *****************************************************************
              03  QXTS04-DATA.
                  05  QXTS04-KEIYAKUNAIYO.
                      07  QXTS04-GYOSYU                     PIC  X(02).
                      07  QXTS04-KAIIN                      PIC  X(04).
                      07  QXTS04-KEINO                      PIC  X(20).
                      07  QXTS04-KEIYMD                     PIC  9(07).
                      07  QXTS04-KEIKBN                     PIC  X(02).
                      07  QXTS04-TANPO                      PIC  X(01).
                      07  QXTS04-SYOHIN                     PIC  X(07).
                      07  QXTS04-HARAI                      PIC  9(03).
                      07  QXTS04-KEISYMD                    PIC  9(07).
                      07  QXTS04-KEIGAKU                    PIC  9(06).
                      07  QXTS04-KYOKGK                     PIC  9(06).
                      07  QXTS04-CKYOKGK                    PIC  9(06).
                      07  QXTS04-HOUYMD                     PIC  9(07).
                      07  QXTS04-ZANSAI                     PIC  9(06).
                      07  QXTS04-CZANSAI                    PIC  9(06).
                      07  QXTS04-SEIGAKU                    PIC  9(06).
                      07  QXTS04-NYUGAKU                    PIC  9(06).
                      07  QXTS04-NYURIGK                    PIC  9(06).
                      07  QXTS04-NYUREKI                    PIC  X(24).
                      07  QXTS04-KEICMNT                    PIC  X(02).
                      07  QXTS04-KEICYMD                    PIC  9(07).
                      07  QXTS04-ENDCMNT                    PIC  X(02).
                      07  QXTS04-KINGAKU                    PIC  9(06).
                      07  QXTS04-HRIKGK                     PIC  9(06).
                      07  QXTS04-HRIKYMD                    PIC  9(07).
                      07  QXTS04-KAIYMD                     PIC  9(07).
                      07  QXTS04-HOKBN                      PIC  X(01).
                      07  QXTS04-KANAHNA                    PIC  X(30).
                      07  QXTS04-KANJHNA                    PIC  X(20).
                  05  QXTS04-ATTRITEM.
                      07  QXTS04-JYUKYO                     PIC  X(01).
                      07  QXTS04-JYUNEN                     PIC  X(01).
                      07  QXTS04-SYOKU                      PIC  X(01).
                      07  QXTS04-KNMNAME                    PIC  X(30).
                      07  QXTS04-KNMTEL                     PIC  X(14).
                      07  QXTS04-KMTLKBN                    PIC  X(01).
                      07  QXTS04-KNMNEN                     PIC  9(02).
                      07  QXTS04-NENSYU                     PIC  X(01).
                      07  QXTS04-SYOTOKU1                   PIC  X(01).
                      07  QXTS04-SYOTOKU2                   PIC  X(01).
                      07  QXTS04-SYOTOKU3                   PIC  X(01).
                      07  QXTS04-ZOKCMNT                    PIC  X(02).
                  05  QXTS04-FUKAITEM.
                      07  QXTS04-KNRCMNT                    PIC X(1).
                      07  QXTS04-CMNT                       PIC X(1).
                      07  QXTS04-ZHFLG1                     PIC X(1).
                      07  QXTS04-ZHFLG2                     PIC X(1).
                      07  QXTS04-ZHFLG3                     PIC X(1).
                      07  QXTS04-ZHFLG4                     PIC X(1).
                      07  QXTS04-ZHFLG5                     PIC X(1).
                      07  QXTS04-ZHFLG6                     PIC X(1).
                      07  QXTS04-ZHFLG7                     PIC X(1).
                      07  QXTS04-ZHFLG8                     PIC X(1).
                      07  QXTS04-ZHFLG9                     PIC X(1).
                      07  QXTS04-ZHFLG10                    PIC X(1).
                      07  QXTS04-ZHFLG11                    PIC X(1).
                      07  QXTS04-ZHFLG12                    PIC X(1).
                      07  QXTS04-ZHFLG13                    PIC X(1).
                      07  QXTS04-ZHFLG14                    PIC X(1).
                      07  QXTS04-CMNTUMU                    PIC X(1).
                      07  FILLER                            PIC X(20).
                      07  QXTS04-FUKCMNT                    PIC X(100).
                  05  QXTS04-ZOKUSEI2.
                      07  QXTS04-KNMNAME2                   PIC X(30).
                      07  QXTS04-KNMTEL2                    PIC X(14).
