      *****************************************************************
      * âÒìöèÓïÒÇs (QXTT01)    ÉåÉRÅ[Éhí∑ÅFxxxÇaÇôÇîÇÖ
      *****************************************************************
            03  QXTT01-ANSWERT.
              05  QXTT01-TABANO                   PIC  X(005).
              05  QXTT01-KIGYOUCD                 PIC  X(004).
              05  QXTT01-SUBRANGEKEY              PIC  X(004).
              05  QXTT01-NAIBUKAIINNO             PIC  X(008).
              05  QXTT01-INQKBN                   PIC  X(001).
              05  QXTT01-KAZOKURBN                PIC  X(001).
              05  QXTT01-RECORDKBN                PIC  X(001).
              05  QXTT01-RECORDSKB1               PIC  X(001).
              05  QXTT01-RENBAN1                  PIC  X(002).
              05  QXTT01-RECORDSKB2               PIC  X(001).
              05  QXTT01-RENBAN2                  PIC  X(002).
              05  QXTT01-INQNO                    PIC  X(006).
              05  QXTT01-USER2                    PIC  X(010).
              05  QXTT01-KWSID                    PIC  X(008).
              05  QXTT01-USER                     PIC  X(019).
              05  QXTT01-KAITO                    PIC  X(001).
              05  QXTT01-MADCD                    PIC  X(003).
              05  QXTT01-KIKAN                    PIC  X(002).
              05  QXTT01-CICSRV                   PIC  X(002).
              05  QXTT01-NETSRV                   PIC  X(002).
              05  QXTT01-NAME                     PIC  X(030).
              05  QXTT01-HJNAME                   PIC  X(030).
              05  QXTT01-SYMD                     PIC  X(007).
              05  QXTT01-YUBIN                    PIC  X(005).
              05  QXTT01-TEL                      PIC  X(014).
              05  QXTT01-TEL2                     PIC  X(014).
              05  QXTT01-CHIBAN                   PIC  X(003).
              05  QXTT01-HHOSYO                   PIC  X(001).
              05  QXTT01-KYKBN                    PIC  X(002).
              05  QXTT01-SHOHIN                   PIC  X(003).
              05  QXTT01-YUSHI                    PIC  X(006).
              05  QXTT01-HARAI                    PIC  X(003).
              05  QXTT01-HJCODE                   PIC  X(010).
              05  QXTT01-CHIIKI                   PIC  X(005).
              05  QXTT01-CHOU                     PIC  X(011).
              05  QXTT01-CHIG                     PIC  X(008).
              05  QXTT01-HEYAG                    PIC  X(004).
              05  QXTT01-MUNEG                    PIC  X(004).
              05  QXTT01-DUMMY1                   PIC  X(003).
              05  QXTT01-KAIIN                    PIC  X(006).
              05  QXTT01-MISIYO                   PIC  X(003).
              05  QXTT01-SEQNO                    PIC  X(018).
              05  QXTT01-KYOKU1                   PIC  X(020).
              05  QXTT01-KYOKU2                   PIC  X(020).
              05  QXTT01-CHIKU                    PIC  X(020).
              05  QXTT01-HH                       PIC  X(002).
              05  QXTT01-MM                       PIC  X(002).
              05  QXTT01-SS                       PIC  X(002).
              05  QXTT01-ERR                      PIC  X(046).
              05  QXTT01-SRERR                    PIC  X(020).
              05  QXTT01-SRSBT                    PIC  X(002).
              05  QXTT01-DUMMY3                   PIC  X(018).
              05  QXTT01-DUMMY4                   PIC  X(040).
              05  QXTT01-ANSFLG                   PIC  X(001).
              05  QXTT01-KMSFLG                   PIC  X(001).
              05  QXTT01-CREFLG                   PIC  X(001).
              05  QXTT01-HOJFLG                   PIC  X(001).
              05  QXTT01-KSCFLG                   PIC  X(001).
              05  QXTT01-JICFLG                   PIC  X(001).
              05  QXTT01-TELFLG                   PIC  X(001).
              05  QXTT01-MAPFLG                   PIC  X(001).
              05  QXTT01-DUMMY5                   PIC  X(004).
              05  QXTT01-ANSSBT                   PIC  X(002).
              05  QXTT01-KMSSBT                   PIC  X(002).
              05  QXTT01-CRESBT                   PIC  X(002).
              05  QXTT01-HOJSBT                   PIC  X(002).
              05  QXTT01-KSCSBT                   PIC  X(002).
              05  QXTT01-JICSBT                   PIC  X(002).
              05  QXTT01-TELSBT                   PIC  X(002).
              05  QXTT01-MAPSBT                   PIC  X(002).
              05  QXTT01-DUMMY6                   PIC  X(008).
              05  QXTT01-ANSIX                    PIC  X(006).
              05  QXTT01-KMSIX                    PIC  X(006).
              05  QXTT01-CREIX                    PIC  X(006).
              05  QXTT01-HOJIX                    PIC  X(006).
              05  QXTT01-KSCIX                    PIC  X(006).
              05  QXTT01-JICIX                    PIC  X(006).
              05  QXTT01-TELIX                    PIC  X(006).
              05  QXTT01-MAPIX                    PIC  X(006).
              05  QXTT01-DUMMY7                   PIC  X(024).
              05  QXTT01-STRDATE                  PIC  X(019).
              05  QXTT01-UPDDATE                  PIC  X(019).
              05  QXTT01-DELDATE                  PIC  X(019).
              05  QXTT01-OPID                     PIC  X(008).
              05  QXTT01-WSID                     PIC  X(020).
