      *****************************************************************
      * 電話移転情報テーブル (QXTT17)    レコード長：xxxＢｙｔｅ
      *****************************************************************
            03  QXTT17-TELITENT.
              05  QXTT17-PRMTABANO          PIC  X(005).
              05  QXTT17-PRMKIGYOUCD        PIC  X(004).
              05  QXTT17-PRMSUBRANGEKEY     PIC  X(004).
              05  QXTT17-PRMNAIBUKAIINNO    PIC  X(008).
              05  QXTT17-SIMEI              PIC  X(030).
              05  QXTT17-TELSYUBETU         PIC  X(001).
              05  QXTT17-TEL1               PIC  X(007).
              05  QXTT17-TEL2               PIC  X(004).
              05  QXTT17-TEL3               PIC  X(004).
              05  QXTT17-IRAIDATE           PIC  X(019).
              05  QXTT17-HANTEI             PIC  X(001).
              05  QXTT17-STRDATE            PIC  X(019).
              05  QXTT17-UPDDATE            PIC  X(019).
              05  QXTT17-DELDATE            PIC  X(019).
              05  QXTT17-OPID               PIC  X(008).
              05  QXTT17-WSID               PIC  X(020).
