      *****************************************************************
      * 照会情報Ｔ (QXTT09)    レコード長：xxxＢｙｔｅ
      *****************************************************************
            03  QXTT09-SNINQT.
              05  QXTT09-TABANO                   PIC  X(005).
              05  QXTT09-KIGYOUCD                 PIC  X(004).
              05  QXTT09-SUBRANGEKEY              PIC  X(004).
              05  QXTT09-NAIBUKAIINNO             PIC  X(008).
              05  QXTT09-INQKBN                   PIC  X(001).
              05  QXTT09-KAZOKURBN                PIC  X(001).
              05  QXTT09-RECORDKBN                PIC  X(001).
              05  QXTT09-RECORDKBN                PIC  X(001).
              05  QXTT09-RECORDSKB1               PIC  X(001).
              05  QXTT09-RENBAN1                  PIC  X(002).
              05  QXTT09-RECORDSKB2               PIC  X(001).
              05  QXTT09-RENBAN2                  PIC  X(002).
              05  QXTT09-TYPE                     PIC  X(002).
              05  QXTT09-NAME                     PIC  X(030).
              05  QXTT09-SYMD                     PIC  X(007).
              05  QXTT09-YUBIN                    PIC  X(005).
              05  QXTT09-CHIBAN                   PIC  X(003).
              05  QXTT09-TEL1                     PIC  X(014).
              05  QXTT09-TEL2                     PIC  X(014).
              05  QXTT09-STRDATE                  PIC  X(019).
              05  QXTT09-UPDDATE                  PIC  X(019).
              05  QXTT09-DELDATE                  PIC  X(019).
              05  QXTT09-OPID                     PIC  X(008).
              05  QXTT09-WSID                     PIC  X(020).
