      *****************************************************************
      * ÇbÇqå¬ï óvåèÇs (QXTT04)    ÉåÉRÅ[Éhí∑ÅFxxxÇaÇôÇîÇÖ
      *****************************************************************
            03  QXTT04-CRKOBETSUYKT.
              05  QXTT04-TABANO                   PIC  X(005).
              05  QXTT04-KIGYOUCD                 PIC  X(004).
              05  QXTT04-SUBRANGEKEY              PIC  X(004).
              05  QXTT04-NAIBUKAIINNO             PIC  X(008).
              05  QXTT04-INQKBN                   PIC  X(001).
              05  QXTT04-KAZOKURBN                PIC  X(001).
              05  QXTT04-RECORDKBN                PIC  X(001).
              05  QXTT04-RECORDSKB1               PIC  X(001).
              05  QXTT04-RENBAN1                  PIC  X(002).
              05  QXTT04-RECORDSKB2               PIC  X(001).
              05  QXTT04-RENBAN2                  PIC  X(002).
              05  QXTT04-GYOSYU                   PIC  X(002).
              05  QXTT04-KAIIN                    PIC  X(004).
              05  QXTT04-KEINO                    PIC  X(020).
              05  QXTT04-KEIYMD                   PIC  X(007).
              05  QXTT04-KEIKBN                   PIC  X(002).
              05  QXTT04-TANPO                    PIC  X(001).
              05  QXTT04-SYOHIN                   PIC  X(007).
              05  QXTT04-HARAI                    PIC  X(003).
              05  QXTT04-KEISYMD                  PIC  X(007).
              05  QXTT04-KEIGAKU                  PIC  X(006).
              05  QXTT04-KYOKGK                   PIC  X(006).
              05  QXTT04-CKYOKGK                  PIC  X(006).
              05  QXTT04-HOUYMD                   PIC  X(007).
              05  QXTT04-ZANSAI                   PIC  X(006).
              05  QXTT04-CZANSAI                  PIC  X(006).
              05  QXTT04-SEIGAKU                  PIC  X(006).
              05  QXTT04-NYUGAKU                  PIC  X(006).
              05  QXTT04-NYURIGK                  PIC  X(006).
              05  QXTT04-NYUREKI                  PIC  X(024).
              05  QXTT04-KEICMNT                  PIC  X(002).
              05  QXTT04-KEICYMD                  PIC  X(007).
              05  QXTT04-ENDCMNT                  PIC  X(002).
              05  QXTT04-KINGAKU                  PIC  X(006).
              05  QXTT04-HRIKGK                   PIC  X(006).
              05  QXTT04-HRIKYMD                  PIC  X(007).
              05  QXTT04-KAIYMD                   PIC  X(007).
              05  QXTT04-HOKBN                    PIC  X(001).
              05  QXTT04-KANAHNA                  PIC  X(030).
              05  QXTT04-KANJHNA                  PIC  X(020).
              05  QXTT04-JYUKYO                   PIC  X(001).
              05  QXTT04-JYUNEN                   PIC  X(001).
              05  QXTT04-SYOKU                    PIC  X(001).
              05  QXTT04-KNMNAME                  PIC  X(030).
              05  QXTT04-KNMTEL                   PIC  X(014).
              05  QXTT04-KMTLKBN                  PIC  X(001).
              05  QXTT04-KNMNEN                   PIC  X(002).
              05  QXTT04-NENSYU                   PIC  X(001).
              05  QXTT04-SYOTOKU1                 PIC  X(001).
              05  QXTT04-SYOTOKU2                 PIC  X(001).
              05  QXTT04-SYOTOKU3                 PIC  X(001).
              05  QXTT04-ZOKCMNT                  PIC  X(002).
              05  QXTT04-KNRCMNT                  PIC  X(001).
              05  QXTT04-CMNT                     PIC  X(001).
              05  QXTT04-ZHFLG1                   PIC  X(001).
              05  QXTT04-ZHFLG2                   PIC  X(001).
              05  QXTT04-ZHFLG3                   PIC  X(001).
              05  QXTT04-ZHFLG4                   PIC  X(001).
              05  QXTT04-ZHFLG5                   PIC  X(001).
              05  QXTT04-ZHFLG6                   PIC  X(001).
              05  QXTT04-ZHFLG7                   PIC  X(001).
              05  QXTT04-ZHFLG8                   PIC  X(001).
              05  QXTT04-ZHFLG9                   PIC  X(001).
              05  QXTT04-ZHFLG10                  PIC  X(001).
              05  QXTT04-ZHFLG11                  PIC  X(001).
              05  QXTT04-ZHFLG12                  PIC  X(001).
              05  QXTT04-ZHFLG13                  PIC  X(001).
              05  QXTT04-ZHFLG14                  PIC  X(001).
              05  QXTT04-CMNTUMU                  PIC  X(001).
              05  QXTT04-FUKCMNT                  PIC  X(100).
              05  QXTT04-KNMNAME2                 PIC  X(030).
              05  QXTT04-KNMTEL2                  PIC  X(014).
              05  QXTT04-STRDATE                  PIC  X(019).
              05  QXTT04-UPDDATE                  PIC  X(019).
              05  QXTT04-DELDATE                  PIC  X(019).
              05  QXTT04-OPID                     PIC  X(008).
              05  QXTT04-WSID                     PIC  X(020).
