      *****************************************************************
      * 信用類似情報Ｔ (QXTT11)    レコード長：xxxＢｙｔｅ
      *****************************************************************
            03  QXTT11-SNRUIJIT.
              05  QXTT11-TABANO                   PIC  X(005).
              05  QXTT11-KIGYOUCD                 PIC  X(004).
              05  QXTT11-SUBRANGEKEY              PIC  X(004).
              05  QXTT11-NAIBUKAIINNO             PIC  X(008).
              05  QXTT11-INQKBN                   PIC  X(001).
              05  QXTT11-KAZOKURBN                PIC  X(001).
              05  QXTT11-RECORDKBN                PIC  X(001).
              05  QXTT11-RECORDKBN                PIC  X(001).
              05  QXTT11-RECORDSKB1               PIC  X(001).
              05  QXTT11-RENBAN1                  PIC  X(002).
              05  QXTT11-RECORDSKB2               PIC  X(001).
              05  QXTT11-RENBAN2                  PIC  X(002).
              05  QXTT11-TYPE                     PIC  X(002).
              05  QXTT11-NAME                     PIC  X(030).
              05  QXTT11-SYMD                     PIC  X(007).
              05  QXTT11-YUBIN                    PIC  X(005).
              05  QXTT11-CHIBAN                   PIC  X(003).
              05  QXTT11-ADD                      PIC  X(060).
              05  QXTT11-TEL                      PIC  X(014).
              05  QXTT11-TELKBN                   PIC  X(001).
              05  QXTT11-SEX                      PIC  X(001).
              05  QXTT11-HOJIN                    PIC  X(001).
              05  QXTT11-JYUKYO                   PIC  X(001).
              05  QXTT11-HAIGU                    PIC  X(001).
              05  QXTT11-JYMD                     PIC  X(007).
              05  QXTT11-JYOSYU                   PIC  X(002).
              05  QXTT11-RIYU                     PIC  X(002).
              05  QXTT11-STRDATE                  PIC  X(019).
              05  QXTT11-UPDDATE                  PIC  X(019).
              05  QXTT11-DELDATE                  PIC  X(019).
              05  QXTT11-OPID                     PIC  X(008).
              05  QXTT11-WSID                     PIC  X(020).
