      *****************************************************************
      * ÇbÇqóﬁéóèÓïÒÇs (QXTT05)    ÉåÉRÅ[Éhí∑ÅFxxxÇaÇôÇîÇÖ
      *****************************************************************
            03  QXTT05-CRRUIJIT.
              05  QXTT05-TABANO                   PIC  X(005).
              05  QXTT05-KIGYOUCD                 PIC  X(004).
              05  QXTT05-SUBRANGEKEY              PIC  X(004).
              05  QXTT05-NAIBUKAIINNO             PIC  X(008).
              05  QXTT05-INQKBN                   PIC  X(001).
              05  QXTT05-KAZOKURBN                PIC  X(001).
              05  QXTT05-RECORDKBN                PIC  X(001).
              05  QXTT05-RECORDKBN                PIC  X(001).
              05  QXTT05-RECORDSKB1               PIC  X(001).
              05  QXTT05-RENBAN1                  PIC  X(002).
              05  QXTT05-RECORDSKB2               PIC  X(001).
              05  QXTT05-RENBAN2                  PIC  X(002).
              05  QXTT05-TYPE                     PIC  X(002).
              05  QXTT05-KANANA                   PIC  X(030).
              05  QXTT05-KANJINA                  PIC  X(020).
              05  QXTT05-SYMD                     PIC  X(007).
              05  QXTT05-YUBIN                    PIC  X(005).
              05  QXTT05-CHIBAN                   PIC  X(003).
              05  QXTT05-KANAADD                  PIC  X(060).
              05  QXTT05-TEL                      PIC  X(014).
              05  QXTT05-SAISHYMD                 PIC  X(007).
              05  QXTT05-SAISKNM                  PIC  X(030).
              05  QXTT05-STRDATE                  PIC  X(019).
              05  QXTT05-UPDDATE                  PIC  X(019).
              05  QXTT05-DELDATE                  PIC  X(019).
              05  QXTT05-OPID                     PIC  X(008).
              05  QXTT05-WSID                     PIC  X(020).
