      *****************************************************************
      * ÇbÇqäÓñ{óvåèÇs (QXTT03)    ÉåÉRÅ[Éhí∑ÅFxxxÇaÇôÇîÇÖ
      *****************************************************************
            03  QXTT03-CRBASEYKT.
              05  QXTT03-TABANO                   PIC  X(005).
              05  QXTT03-KIGYOUCD                 PIC  X(004).
              05  QXTT03-SUBRANGEKEY              PIC  X(004).
              05  QXTT03-NAIBUKAIINNO             PIC  X(008).
              05  QXTT03-INQKBN                   PIC  X(001).
              05  QXTT03-KAZOKURBN                PIC  X(001).
              05  QXTT03-RECORDKBN                PIC  X(001).
              05  QXTT03-RECORDSKB1               PIC  X(001).
              05  QXTT03-RENBAN1                  PIC  X(002).
              05  QXTT03-RECORDSKB2               PIC  X(001).
              05  QXTT03-RENBAN2                  PIC  X(002).
              05  QXTT03-TYPE                     PIC  X(002).
              05  QXTT03-KANANA                   PIC  X(030).
              05  QXTT03-KANJINA                  PIC  X(020).
              05  QXTT03-SYMD                     PIC  X(007).
              05  QXTT03-YUBIN                    PIC  X(005).
              05  QXTT03-CHIBAN                   PIC  X(003).
              05  QXTT03-KANAADD                  PIC  X(060).
              05  QXTT03-KANJIADD                 PIC  X(080).
              05  QXTT03-ADD                      PIC  X(011).
              05  QXTT03-CHIBANKT                 PIC  X(060).
              05  QXTT03-TEL                      PIC  X(014).
              05  QXTT03-TELKBN                   PIC  X(001).
              05  QXTT03-SEX                      PIC  X(001).
              05  QXTT03-HAIGU                    PIC  X(001).
              05  QXTT03-ZANSAI                   PIC  X(006).
              05  QXTT03-KOBETKN                  PIC  X(002).
              05  QXTT03-ZHANFLG1                 PIC  X(001).
              05  QXTT03-ZHANFLG2                 PIC  X(001).
              05  QXTT03-STRDATE                  PIC  X(019).
              05  QXTT03-UPDDATE                  PIC  X(019).
              05  QXTT03-DELDATE                  PIC  X(019).
              05  QXTT03-OPID                     PIC  X(008).
              05  QXTT03-WSID                     PIC  X(020).
