      *****************************************************************
      * 電話番号識別Ｔ (QXTT12)    レコード長：xxxＢｙｔｅ
      *****************************************************************
            03  QXTT12-SNTELT.
              05  QXTT12-TABANO                   PIC  X(005).
              05  QXTT12-KIGYOUCD                 PIC  X(004).
              05  QXTT12-SUBRANGEKEY              PIC  X(004).
              05  QXTT12-NAIBUKAIINNO             PIC  X(008).
              05  QXTT12-INQKBN                   PIC  X(001).
              05  QXTT12-KAZOKURBN                PIC  X(001).
              05  QXTT12-RECORDKBN                PIC  X(001).
              05  QXTT12-RECORDKBN                PIC  X(001).
              05  QXTT12-RECORDSKB1               PIC  X(001).
              05  QXTT12-RENBAN1                  PIC  X(002).
              05  QXTT12-RECORDSKB2               PIC  X(001).
              05  QXTT12-RENBAN2                  PIC  X(002).
              05  QXTT12-KUBUN                    PIC  X(002).
              05  QXTT12-NAME                     PIC  X(030).
              05  QXTT12-SYMD                     PIC  X(007).
              05  QXTT12-YUBIN                    PIC  X(005).
              05  QXTT12-CHIBAN                   PIC  X(003).
              05  QXTT12-TEL                      PIC  X(014).
              05  QXTT12-KRKYM                    PIC  X(004).
              05  QXTT12-JYOKBN                   PIC  X(001).
              05  QXTT12-NAME2                    PIC  X(030).
              05  QXTT12-STRDATE                  PIC  X(019).
              05  QXTT12-UPDDATE                  PIC  X(019).
              05  QXTT12-DELDATE                  PIC  X(019).
              05  QXTT12-OPID                     PIC  X(008).
              05  QXTT12-WSID                     PIC  X(020).
