      *****************************************************************
      * 照会履歴Ｔ (QXTT10)    レコード長：xxxＢｙｔｅ
      *****************************************************************
            03  QXTT10-SNINQRIREKIT.
              05  QXTT10-TABANO                   PIC  X(005).
              05  QXTT10-KIGYOUCD                 PIC  X(004).
              05  QXTT10-SUBRANGEKEY              PIC  X(004).
              05  QXTT10-NAIBUKAIINNO             PIC  X(008).
              05  QXTT10-INQKBN                   PIC  X(001).
              05  QXTT10-KAZOKURBN                PIC  X(001).
              05  QXTT10-RECORDKBN                PIC  X(001).
              05  QXTT10-RECORDKBN                PIC  X(001).
              05  QXTT10-RECORDSKB1               PIC  X(001).
              05  QXTT10-RENBAN1                  PIC  X(002).
              05  QXTT10-RECORDSKB2               PIC  X(001).
              05  QXTT10-RENBAN2                  PIC  X(002).
              05  QXTT10-KAIIN                    PIC  X(009).
              05  QXTT10-INQYMD                   PIC  X(007).
              05  QXTT10-HOKBN                    PIC  X(001).
              05  QXTT10-KYKBN                    PIC  X(002).
              05  QXTT10-HINMEI                   PIC  X(003).
              05  QXTT10-YUSHI                    PIC  X(006).
              05  QXTT10-HARAI                    PIC  X(003).
              05  QXTT10-INQMOTO                  PIC  X(002).
              05  QXTT10-STRDATE                  PIC  X(019).
              05  QXTT10-UPDDATE                  PIC  X(019).
              05  QXTT10-DELDATE                  PIC  X(019).
              05  QXTT10-OPID                     PIC  X(008).
              05  QXTT10-WSID                     PIC  X(020).
