      *****************************************************************
      * 信用個別情報Ｔ (QXTT08)    レコード長：xxxＢｙｔｅ
      *****************************************************************
            03  QXTT08-SNKOBETSUT.
              05  QXTT08-TABANO                   PIC  X(005).
              05  QXTT08-KIGYOUCD                 PIC  X(004).
              05  QXTT08-SUBRANGEKEY              PIC  X(004).
              05  QXTT08-NAIBUKAIINNO             PIC  X(008).
              05  QXTT08-INQKBN                   PIC  X(001).
              05  QXTT08-KAZOKURBN                PIC  X(001).
              05  QXTT08-RECORDKBN                PIC  X(001).
              05  QXTT08-RECORDKBN                PIC  X(001).
              05  QXTT08-RECORDSKB1               PIC  X(001).
              05  QXTT08-RENBAN1                  PIC  X(002).
              05  QXTT08-RECORDSKB2               PIC  X(001).
              05  QXTT08-RENBAN2                  PIC  X(002).
              05  QXTT08-KAIIN                    PIC  X(009).
              05  QXTT08-KYKNO                    PIC  X(020).
              05  QXTT08-JYMD                     PIC  X(007).
              05  QXTT08-JYOSYU                   PIC  X(002).
              05  QXTT08-RIYU                     PIC  X(002).
              05  QXTT08-KYMD                     PIC  X(007).
              05  QXTT08-KYKBN                    PIC  X(002).
              05  QXTT08-TANPO                    PIC  X(001).
              05  QXTT08-SYOHIN                   PIC  X(007).
              05  QXTT08-YUSHI                    PIC  X(006).
              05  QXTT08-HARAI                    PIC  X(003).
              05  QXTT08-ZANSAI                   PIC  X(006).
              05  QXTT08-ENTAI                    PIC  X(002).
              05  QXTT08-ENTAIDO                  PIC  X(002).
              05  QXTT08-SUMIYMD                  PIC  X(007).
              05  QXTT08-HOKBN                    PIC  X(001).
              05  QXTT08-HONEME                   PIC  X(030).
              05  QXTT08-TEKIYO                   PIC  X(020).
              05  QXTT08-SAIBAN                   PIC  X(020).
              05  QXTT08-JIKEN                    PIC  X(008).
              05  QXTT08-FNO                      PIC  X(003).
              05  QXTT08-FPAGE                    PIC  X(003).
              05  QXTT08-JYUNEN                   PIC  X(001).
              05  QXTT08-SYOKU                    PIC  X(001).
              05  QXTT08-KNMNAME                  PIC  X(030).
              05  QXTT08-KNMTEL                   PIC  X(014).
              05  QXTT08-KNMTELK                  PIC  X(001).
              05  QXTT08-KNMNEN                   PIC  X(002).
              05  QXTT08-NENSYU                   PIC  X(001).
              05  QXTT08-SYOTOKU1                 PIC  X(001).
              05  QXTT08-SYOTOKU2                 PIC  X(001).
              05  QXTT08-SYOTOKU3                 PIC  X(001).
              05  QXTT08-CMNT                     PIC  X(001).
              05  QXTT08-KNPCMNT                  PIC  X(001).
              05  QXTT08-TEISHI                   PIC  X(001).
              05  QXTT08-RIREKI                   PIC  X(012).
              05  QXTT08-RUISUU                   PIC  X(004).
              05  QXTT08-KSNYMD                   PIC  X(007).
              05  QXTT08-GYOSYU                   PIC  X(002).
              05  QXTT08-CMNTUMU                  PIC  X(001).
              05  QXTT08-FUKCMNT                  PIC  X(100).
              05  QXTT08-KNMNAME2                 PIC  X(030).
              05  QXTT08-KNMTEL2                  PIC  X(014).
              05  QXTT08-STRDATE                  PIC  X(019).
              05  QXTT08-UPDDATE                  PIC  X(019).
              05  QXTT08-DELDATE                  PIC  X(019).
              05  QXTT08-OPID                     PIC  X(008).
              05  QXTT08-WSID                     PIC  X(020).
