      *****************************************************************
      * êRç∏åãâ  (QXTT15)    ÉåÉRÅ[Éhí∑ÅFxxxÇaÇôÇîÇÖ
      *****************************************************************
            03  QXTT15-SHINSAKEKKA.
              05  QXTT15-PRMTABANO          PIC  X(005).
              05  QXTT15-PRMKIGYOUCD        PIC  X(004).
              05  QXTT15-PRMSUBRANGEKEY     PIC  X(004).
              05  QXTT15-PRMNAIBUKAIINNO    PIC  X(008).
              05  QXTT15-PRMKANKEIKBN       PIC  X(001).
              05  QXTT15-PRMKAZOKURBN       PIC  X(001).
              05  QXTT15-HIRAISTATUS        PIC  X(001).
              05  QXTT15-JDSK001            PIC  X(001).
              05  QXTT15-JDSK002            PIC  X(001).
              05  QXTT15-JDSK003            PIC  X(001).
              05  QXTT15-JDSK004            PIC  X(001).
              05  QXTT15-JDSK005            PIC  X(001).
              05  QXTT15-JDSK006            PIC  X(001).
              05  QXTT15-JDSK007            PIC  X(001).
              05  QXTT15-JDSK008            PIC  X(001).
              05  QXTT15-JDSK009            PIC  X(001).
              05  QXTT15-JDSK010            PIC  X(001).
              05  QXTT15-JDSK011            PIC  X(001).
              05  QXTT15-JDSK012            PIC  X(001).
              05  QXTT15-JDSK013            PIC  X(001).
              05  QXTT15-JDSK014            PIC  X(001).
              05  QXTT15-JDSK015            PIC  X(001).
              05  QXTT15-JDSK016            PIC  X(001).
              05  QXTT15-JDSK017            PIC  X(001).
              05  QXTT15-JDSK018            PIC  X(001).
              05  QXTT15-JDSK019            PIC  X(001).
              05  QXTT15-JDSK020            PIC  X(001).
              05  QXTT15-JDSK021            PIC  X(001).
              05  QXTT15-JDSK022            PIC  X(001).
              05  QXTT15-JDSK023            PIC  X(001).
              05  QXTT15-JDSK024            PIC  X(001).
              05  QXTT15-JDSK025            PIC  X(001).
              05  QXTT15-JDSK026            PIC  X(001).
              05  QXTT15-JDSK027            PIC  X(001).
              05  QXTT15-JDSK028            PIC  X(001).
              05  QXTT15-JDSK029            PIC  X(001).
              05  QXTT15-JDSK030            PIC  X(001).
              05  QXTT15-JDSKEKKA           PIC  X(001).
              05  QXTT15-JDSIRAISTATUS      PIC  X(001).
              05  QXTT15-HANTEISYOKI        PIC  X(001).
              05  QXTT15-JDSYOSINRANK       PIC  X(001).
              05  QXTT15-JDSCASHLIMIT       PIC  X(005).
              05  QXTT15-JDSDATE            PIC  X(019).
              05  QXTT15-ENDHANTEI          PIC  X(001).
              05  QXTT15-ENDYOSINRANK       PIC  X(001).
              05  QXTT15-ENDCASHLIMIT       PIC  X(005).
              05  QXTT15-ENDFSTTANTOID      PIC  X(008).
              05  QXTT15-ENDFSTSHORIDATE    PIC  X(019).
              05  QXTT15-ENDTANTOID         PIC  X(008).
              05  QXTT15-ENDSHORIDATE       PIC  X(019).
              05  QXTT15-SRVHANTEI          PIC  X(001).
              05  QXTT15-SRVIRAIUMU         PIC  X(001).
              05  QXTT15-BUNSHOKANRINO      PIC  X(004).
              05  QXTT15-LETTERSYUBETU      PIC  X(001).
              05  QXTT15-KIJITUSTRDATE      PIC  X(019).
              05  QXTT15-HUPIRAIDATE        PIC  X(019).
              05  QXTT15-HUPKEKKADATE       PIC  X(019).
              05  QXTT15-HUPHANTEI          PIC  X(001).
              05  QXTT15-STRDATE            PIC  X(019).
              05  QXTT15-UPDDATE            PIC  X(019).
              05  QXTT15-DELDATE            PIC  X(019).
              05  QXTT15-OPID               PIC  X(008).
              05  QXTT15-WSID               PIC  X(020).
