      *****************************************************************
      * ÇbÇqäÓñ{Çs (QXTT02)    ÉåÉRÅ[Éhí∑ÅFxxxÇaÇôÇîÇÖ
      *****************************************************************
            03  QXTT02-CRBASET.
              05  QXTT02-TABANO                   PIC  X(005).
              05  QXTT02-KIGYOUCD                 PIC  X(004).
              05  QXTT02-SUBRANGEKEY              PIC  X(004).
              05  QXTT02-NAIBUKAIINNO             PIC  X(008).
              05  QXTT02-INQKBN                   PIC  X(001).
              05  QXTT02-KAZOKURBN                PIC  X(001).
              05  QXTT02-RECORDKBN                PIC  X(001).
              05  QXTT02-RECORDSKB1               PIC  X(001).
              05  QXTT02-RENBAN1                  PIC  X(002).
              05  QXTT02-RECORDSKB2               PIC  X(001).
              05  QXTT02-RENBAN2                  PIC  X(002).
              05  QXTT02-IDXNO                    PIC  X(006).
              05  QXTT02-INQNO                    PIC  X(006).
              05  QXTT02-SEQNO                    PIC  X(018).
              05  QXTT02-DTSBT                    PIC  X(002).
              05  QXTT02-CREDT                    PIC  X(003).
              05  QXTT02-KOBET1                   PIC  X(003).
              05  QXTT02-KOBET2                   PIC  X(003).
              05  QXTT02-KOBET3                   PIC  X(003).
              05  QXTT02-KOBET4                   PIC  X(003).
              05  QXTT02-KOBET5                   PIC  X(003).
              05  QXTT02-KOBET6                   PIC  X(003).
              05  QXTT02-KOBET7                   PIC  X(003).
              05  QXTT02-KOBET8                   PIC  X(003).
              05  QXTT02-KOBET9                   PIC  X(003).
              05  QXTT02-KOBET10                  PIC  X(003).
              05  QXTT02-RUIJI                    PIC  X(003).
              05  QXTT02-STRDATE                  PIC  X(019).
              05  QXTT02-UPDDATE                  PIC  X(019).
              05  QXTT02-DELDATE                  PIC  X(019).
              05  QXTT02-OPID                     PIC  X(008).
              05  QXTT02-WSID                     PIC  X(020).
