      *****************************************************************
      * 信用基本Ｔ (QXTT06)    レコード長：xxxＢｙｔｅ
      *****************************************************************
            03  QXTT06-SNBASET.
              05  QXTT06-TABANO                   PIC  X(005).
              05  QXTT06-KIGYOUCD                 PIC  X(004).
              05  QXTT06-SUBRANGEKEY              PIC  X(004).
              05  QXTT06-NAIBUKAIINNO             PIC  X(008).
              05  QXTT06-INQKBN                   PIC  X(001).
              05  QXTT06-KAZOKURBN                PIC  X(001).
              05  QXTT06-RECORDKBN                PIC  X(001).
              05  QXTT06-RECORDKBN                PIC  X(001).
              05  QXTT06-RECORDSKB1               PIC  X(001).
              05  QXTT06-RENBAN1                  PIC  X(002).
              05  QXTT06-RECORDSKB2               PIC  X(001).
              05  QXTT06-RENBAN2                  PIC  X(002).
              05  QXTT06-IDXNO                    PIC  X(006).
              05  QXTT06-INQNO                    PIC  X(006).
              05  QXTT06-SEQNO                    PIC  X(018).
              05  QXTT06-DTSBT                    PIC  X(002).
              05  QXTT06-CRE1                     PIC  X(003).
              05  QXTT06-CRE21                    PIC  X(003).
              05  QXTT06-CRE22                    PIC  X(003).
              05  QXTT06-CRE23                    PIC  X(003).
              05  QXTT06-CRE24                    PIC  X(003).
              05  QXTT06-CRE25                    PIC  X(003).
              05  QXTT06-CRE26                    PIC  X(003).
              05  QXTT06-CRE27                    PIC  X(003).
              05  QXTT06-CRE28                    PIC  X(003).
              05  QXTT06-CRE29                    PIC  X(003).
              05  QXTT06-CRE210                   PIC  X(003).
              05  QXTT06-INQ1                     PIC  X(003).
              05  QXTT06-INQ21                    PIC  X(003).
              05  QXTT06-INQ22                    PIC  X(003).
              05  QXTT06-INQ23                    PIC  X(003).
              05  QXTT06-INQ24                    PIC  X(003).
              05  QXTT06-INQ25                    PIC  X(003).
              05  QXTT06-INQ26                    PIC  X(003).
              05  QXTT06-INQ27                    PIC  X(003).
              05  QXTT06-INQ28                    PIC  X(003).
              05  QXTT06-INQ29                    PIC  X(003).
              05  QXTT06-INQ210                   PIC  X(003).
              05  QXTT06-RUIJI                    PIC  X(003).
              05  QXTT06-TELS1                    PIC  X(003).
              05  QXTT06-TELS2                    PIC  X(003).
              05  QXTT06-RUIMEI                   PIC  X(003).
              05  QXTT06-STRDATE                  PIC  X(019).
              05  QXTT06-UPDDATE                  PIC  X(019).
              05  QXTT06-DELDATE                  PIC  X(019).
              05  QXTT06-OPID                     PIC  X(008).
              05  QXTT06-WSID                     PIC  X(020).
