      *****************************************************************
      * 審査結果 (QXTT16)    レコード長：xxxＢｙｔｅ
      *****************************************************************
            03  QXTT16-SHINSARIREKIT.
              05  QXTT16-TABANO                   PIC  X(005).
              05  QXTT16-KIGYOUCD                 PIC  X(004).
              05  QXTT16-SUBRANGEKEY              PIC  X(004).
              05  QXTT16-NAIBUKAIINNO             PIC  X(008).
              05  QXTT16-KANKEIKBN                PIC  X(001).
              05  QXTT16-KAZOKURBN                PIC  X(001).
              05  QXTT16-SHINSACD                 PIC  X(004).
              05  QXTT16-HONKBN                   PIC  X(001).
              05  QXTT16-PARM1                    PIC  X(009).
              05  QXTT16-PARM2                    PIC  X(009).
              05  QXTT16-JUDGE                    PIC  X(100).
              05  QXTT16-RESULTCD                 PIC  X(001).
              05  QXTT16-STRDATE                  PIC  X(019).
              05  QXTT16-UPDDATE                  PIC  X(019).
