      *****************************************************************
      * 信用情報Ｔ (QXTT07)    レコード長：xxxＢｙｔｅ
      *****************************************************************
            03  QXTT07-SNJOHOT.
              05  QXTT07-TABANO                   PIC  X(005).
              05  QXTT07-KIGYOUCD                 PIC  X(004).
              05  QXTT07-SUBRANGEKEY              PIC  X(004).
              05  QXTT07-NAIBUKAIINNO             PIC  X(008).
              05  QXTT07-INQKBN                   PIC  X(001).
              05  QXTT07-KAZOKURBN                PIC  X(001).
              05  QXTT07-RECORDKBN                PIC  X(001).
              05  QXTT07-RECORDKBN                PIC  X(001).
              05  QXTT07-RECORDSKB1               PIC  X(001).
              05  QXTT07-RENBAN1                  PIC  X(002).
              05  QXTT07-RECORDSKB2               PIC  X(001).
              05  QXTT07-RENBAN2                  PIC  X(002).
              05  QXTT07-TYPE                     PIC  X(002).
              05  QXTT07-NAME                     PIC  X(030).
              05  QXTT07-SYMD                     PIC  X(007).
              05  QXTT07-YUBIN                    PIC  X(005).
              05  QXTT07-CHIBAN                   PIC  X(003).
              05  QXTT07-ADD                      PIC  X(060).
              05  QXTT07-TEL                      PIC  X(014).
              05  QXTT07-TELKBN                   PIC  X(001).
              05  QXTT07-SEX                      PIC  X(001).
              05  QXTT07-HOJIN                    PIC  X(001).
              05  QXTT07-JYUKYO                   PIC  X(001).
              05  QXTT07-HAIGU                    PIC  X(001).
              05  QXTT07-STRDATE                  PIC  X(019).
              05  QXTT07-UPDDATE                  PIC  X(019).
              05  QXTT07-DELDATE                  PIC  X(019).
              05  QXTT07-OPID                     PIC  X(008).
              05  QXTT07-WSID                     PIC  X(020).
