      *****************************************************************
      * 類似氏名Ｔ (QXTT13)    レコード長：xxxＢｙｔｅ
      *****************************************************************
            03  QXTT13-SNRUIJINAMET.
              05  QXTT13-TABANO                   PIC  X(005).
              05  QXTT13-KIGYOUCD                 PIC  X(004).
              05  QXTT13-SUBRANGEKEY              PIC  X(004).
              05  QXTT13-NAIBUKAIINNO             PIC  X(008).
              05  QXTT13-INQKBN                   PIC  X(001).
              05  QXTT13-KAZOKURBN                PIC  X(001).
              05  QXTT13-RECORDKBN                PIC  X(001).
              05  QXTT13-RECORDKBN                PIC  X(001).
              05  QXTT13-RECORDSKB1               PIC  X(001).
              05  QXTT13-RENBAN1                  PIC  X(002).
              05  QXTT13-RECORDSKB2               PIC  X(001).
              05  QXTT13-RENBAN2                  PIC  X(002).
              05  QXTT13-TYPE                     PIC  X(002).
              05  QXTT13-RUINAME                  PIC  X(030).
              05  QXTT13-STRDATE                  PIC  X(019).
              05  QXTT13-UPDDATE                  PIC  X(019).
              05  QXTT13-DELDATE                  PIC  X(019).
              05  QXTT13-OPID                     PIC  X(008).
              05  QXTT13-WSID                     PIC  X(020).
