      *8...........2.........3.........4.........5.........6.........7..
      ****************************************************************
      *   コピー句名称　       :  発券データテーブル                 *
      ****************************************************************
      *upd 2000/05/27
           03   ()-PRMSAKUSEIYMD     PIC  X(8).
           03   ()-PRMKOUZABANGOU    PIC  X(16).
           03   ()-PRMKAKITOMEBARCD  PIC  X(11).
      *
      *add 2000/05/27
           03   ()-KIGYOCD           PIC  X(4).
           03   ()-SUBRNG            PIC  X(4).
           03   ()-NAIBUKAIIN        PIC  X(8).
      *
           03   ()-HAKKOURIYU        PIC  X(1).
           03   ()-MAISU             PIC  X(1).
           03   ()-KANRITEN          PIC  X(2).
           03   ()-KAKUTOKUTEN       PIC  X(2).
           03   ()-CARDKBN           PIC  X(6).
           03   ()-FACEKBN           PIC  X(1).
           03   ()-ATSUKAIBUKA       PIC  X(6).
           03   ()-SOUFUYUBIN        PIC  X(7).
           03   ()-SOUFUKJUSYO1      PIC  X(50).
           03   ()-SOUFUKJUSYO2      PIC  X(50).
           03   ()-SOUFUKJUSYO3      PIC  X(50).
           03   ()-SOUFUKJUSYO4      PIC  X(50).
           03   ()-SOUFUKJUSYO5      PIC  X(50).
           03   ()-SOUFUHONNAME      PIC  X(50).
           03   ()-SOUFUTEL          PIC  X(15).
           03   ()-DAISHINYUKAIYMD   PIC  X(8).
           03   ()-DAISHIKIGEN       PIC  X(6).
           03   ()-DAISHICARDNM      PIC  X(34).
           03   ()-RIYOUKNAME1       PIC  X(40).
           03   ()-RIYOUKNAME2       PIC  X(40).
           03   ()-RIYOUKNAME3       PIC  X(40).
           03   ()-RIYOUKNAME4       PIC  X(40).
           03   ()-RIYOUKNAME5       PIC  X(40).
           03   ()-RIYOUKNAME6       PIC  X(40).
           03   ()-RIYOUKNAME7       PIC  X(40).
           03   ()-RIYOUKNAME8       PIC  X(40).
           03   ()-RIYOUKNAME9       PIC  X(40).
           03   ()-HIKIBANK          PIC  X(20).
           03   ()-HIKISHITEN        PIC  X(20).
           03   ()-HIKISYUMOKU       PIC  X(4).
           03   ()-HIKIKOUZA         PIC  X(8).
           03   ()-HIKIMEIGI         PIC  X(22).
           03   ()-EMBOSS1-1         PIC  X(30).
           03   ()-EMBOSS1-2         PIC  X(30).
           03   ()-EMBOSS1-3         PIC  X(30).
           03   ()-EMBOSS1-4         PIC  X(30).
           03   ()-EMBOSS2-1         PIC  X(30).
           03   ()-EMBOSS2-2         PIC  X(30).
           03   ()-EMBOSS2-3         PIC  X(30).
           03   ()-EMBOSS2-4         PIC  X(30).
           03   ()-EMBOSS3-1         PIC  X(30).
           03   ()-EMBOSS3-2         PIC  X(30).
           03   ()-EMBOSS3-3         PIC  X(30).
           03   ()-EMBOSS3-4         PIC  X(30).
           03   ()-EMBOSS4-1         PIC  X(30).
           03   ()-EMBOSS4-2         PIC  X(30).
           03   ()-EMBOSS4-3         PIC  X(30).
           03   ()-EMBOSS4-4         PIC  X(30).
           03   ()-EMBOSS5-1         PIC  X(30).
           03   ()-EMBOSS5-2         PIC  X(30).
           03   ()-EMBOSS5-3         PIC  X(30).
           03   ()-EMBOSS5-4         PIC  X(30).
           03   ()-EMBOSS6-1         PIC  X(30).
           03   ()-EMBOSS6-2         PIC  X(30).
           03   ()-EMBOSS6-3         PIC  X(30).
           03   ()-EMBOSS6-4         PIC  X(30).
           03   ()-EMBOSS7-1         PIC  X(30).
           03   ()-EMBOSS7-2         PIC  X(30).
           03   ()-EMBOSS7-3         PIC  X(30).
           03   ()-EMBOSS7-4         PIC  X(30).
           03   ()-EMBOSS8-1         PIC  X(30).
           03   ()-EMBOSS8-2         PIC  X(30).
           03   ()-EMBOSS8-3         PIC  X(30).
           03   ()-EMBOSS8-4         PIC  X(30).
           03   ()-EMBOSS9-1         PIC  X(30).
           03   ()-EMBOSS9-2         PIC  X(30).
           03   ()-EMBOSS9-3         PIC  X(30).
           03   ()-EMBOSS9-4         PIC  X(30).
      *add 2000/05/27
           03   ()-NUKITORIFLG       PIC  X(1).
           03   ()-NUKITORIYMD       PIC  X(8).
           03   ()-TOUROKUDATETIME   PIC  X(14).
           03   ()-KOUSHINTANTOCD    PIC  X(8).
           03   ()-KOUSHINTANTOMEI   PIC  X(12).
           03   ()-KOUSHINDATETIME   PIC  X(14).
