      *       QYNS01              LEVEL=3        DATE=03.05.26
      ******************************************************************
      *　　　　　　年会費告知マスタ                                    *
      *----------------------------------------------------------------*
      *　障害NO　修正履歴（内容）　　　　　　　　　　担当者　修正日付　*
      *----------------------------------------------------------------*
      *QXXXXXXX-XXX  ＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸ  XX/XX/XX  *
      ******************************************************************
           03  QYNS01-SEG.                               *>会員レコード
             05  QYNS01-G0010.                           *>キー部
               07  QYNS01-T0010.                         *>ロケーションキー
                 09  QYNS01-A0010    PIC  9(04).         *>企業コード
                 09  QYNS01-A0020    PIC  9(04).         *>サブレンジキー
               07  QYNS01-A0030      PIC  9(08).         *>内部会員番号
             05  QYNS01-G0040.                           *>会員情報
               07  QYNS01-A0040      PIC  9(07).         *>入会日ドＳＥＱ
               07  QYNS01-A0050      PIC  9(05).         *>有効期限
               07  QYNS01-A0060      PIC  9(05).         *>初回請求年月（予定）
               07  QYNS01-A0070      PIC  9(07).         *>退会予定日
               07  QYNS01-A0080      PIC S9(07)          *>年会費
                                 SIGN LEADING SEPARATE.
               07  QYNS01-A0090      PIC  X(01).         *>利用区分
               07  QYNS01-A0100      PIC S9(11)          *>年間利用額
                                 SIGN LEADING SEPARATE.
             05  QYNS01-G0110.                           *>案内状情報
               07  QYNS01-A0110      PIC  9(03).         *>最新ＳＥＱ
               07  QYNS01-T0120    OCCURS  6.            *>案内状作成テーブル
                 09  QYNS01-A0120    PIC  9(07).         *>作成日
             05  QYNS01-G0130.                           *>案内状情報
               07  QYNS01-A0130      PIC  X(01).         *>告知フラグ
               07  QYNS01-A0140      PIC  X(01).         *>同意フラグ
               07  QYNS01-A0150      PIC  9(01).         *>有効ＩＤＸ
               07  QYNS01-T0160    OCCURS  6.            *>返信状況テーブル
                 09  QYNS01-A0160    PIC  X(01).         *>返信内容
                 09  QYNS01-A0170    PIC  9(07).         *>返信日
             05  QYNS01-G0180.                           *>処理情報
               07  QYNS01-A0180      PIC  9(01).         *>請求有無フラグ
               07  QYNS01-A0190      PIC  9(01).         *>期限到来フラグ
               07  QYNS01-A0200      PIC  9(05).         *>初回請求年月
               07  QYNS01-A0210      PIC  9(07).         *>拒否退会年月日
             05  QYNS01-G0220.                           *>レコード情報
               07  QYNS01-A0220      PIC  9(07).         *>作成日
               07  QYNS01-A0230      PIC  9(07).         *>更新日
               07  QYNS01-A0240      PIC  9(04).         *>セションカウンタ
